[
{"content": [" "], "expanded_content": ["Pixar's Coco is yet another perfect and oscar worthy piece of animation from the studio that first introduced us to computer-animation. The writing for the story and the characters is so well done, the animation is simply stunning, the music is out of this world and the movie is filled with many funny and touching moments, making it a wonderful ride for viewers of all ages."]},
{"content": [" "], "expanded_content": ["\"Coco\" is Pixar's 19th film. It comes out exactly 22 years after the release of the studio's very first film, \"Toy Story\". Pixar reinvented the animation genre by using computer animation to tell smart, family friendly, beautiful and creative stories. Even though the studio has seen a drop in quality as of late, \"Coco\" is definitely a return to form.", "It tells the story of Miguel Rivera, a young musician who lives in the village of Santa Cecilia in Mexico. His family has banned music though, so he is struggling to make his dreams come true. But everything will change once he transports to the Land of the Dead and tries to find his icon, Ernesto de la Cruz.", "\"Coco\" faithfully presents the Mexican culture and people, making you not just want to visit the country, but want to live there. But not to the expense of the story. It's smart, beautifully told, filled with strong and complex characters, incredible music and a message that's powerful and though-provoking. \"Coco\" is a must see for families and fans of animation. It's a masterpiece and meets the high bar set by the studio's earlier works."]},
{"content": [" "], "expanded_content": ["Who doesn't love to sit back and enjoy a good animated movie? What better one to choose than Coco. Pixar has gifted us with yet another wonderful and heartfelt film so get the tissues ready.", "Miguel longs to be a musician but with his family's strict ban on all things music he is forbidden to even hold a guitar. On the night of Día de Muertos Miguel enters the Land of the Dead to find his great great grandfather, the legendary singer Ernesto del la Cruz. As with most Pixar movies you're hit with comedy and sadness all at the same time, and Coco doesn't hold back. It's funny, emotional and thoroughly enjoyable. The music is beautiful, the array of colours in the land of the dead is mesmerizing. The attention to detail surrounding this beautiful story is worth the ticket price alone. It really is true that the best kids movies are ones adults can enjoy too and you will fall in love with this movie. Pixar has always been better with original ideas as opposed to sequels just for the sake of it so if you enjoy a good animation Coco is not to be missed. Highly recommended, it's stunning."]},
{"content": ["I haven't cried in a movie in so long. Probably my new favorite Pixar film."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Coco is a great family movie that really continues in the tradition of Pixar Animation studios. While the overall story is one we have seen before, the incorporation of music as the central, driving force of the movie really spoke to me as a musician as well as a movie reviewer. I highly recommend this movie to anyone who either enjoys music or movies."]},
{"content": [" "], "expanded_content": ["Coco is one of Pixar's best films in years. You don't have to be of latin/hispanic descent to appreciate the culture and history that this movie puts on display. It is truly a beautiful homage to family, tradition and Mexican heritage. I loved the songs, the story and the characters. The humor was spot on and the emotional investment definitely paid off. Its the first animated movie since Toy Story 3 to almost make me cry. It is a very well structured movie that is great for both adults and children."]},
{"content": [" "], "expanded_content": ["Where do I begin? Coco was a movie that made me laugh. It made me cry. It drew me into this world like no movie has in years. Every time the characters experienced an event or felt an emotion, I experienced and felt it with them. I can't recall the last time I felt such joy walking out of a theater, but Coco plastered a stupid smile on my face for the longest time after I finished it. It is truly a piece of masterful animation that rivals Pixar's best. For those who are still skeptical of this movie, I say give it a shot. It is one of the greatest animated movie's I've ever seen, this coming from an avid fan of animation of every form. Despite the trailers, it's not a rip off of the Book of Life and instead takes many unexpected twists and turns. Coco has climbed quickly established itself as one of my favorite animated movies, if not one of my favorite movies of all time. Definitely a 10/10"]},
{"content": ["Que Filme Incrivel,muito emocionante,uma Historia Fantastica e Surpreendente,Mais Uma Obra Prima da Pixar"], "expanded_content": []},
{"content": [" "], "expanded_content": ["The best animated film since 'Inside Out' and 'Wall-E'! This will be one to remember 10 years from now, unlike 'The Good Dinosaur'.. :| All the components you hope for in a great Pixar film - story, visuals and art direction, culture, character design, emotion, and a payoff in the end... (one that 'Up' didn't have, for me.) If you suffered through Star Wars VIII like I did, have faith that this is one film that Disney DIDN'T destroy."]},
{"content": ["Coco is absolutely fantastic. Whether you know about Dia de los Muertos or not, or whether you are a kid or not, you will still love this movie. It is the best Pixar has made in years."], "expanded_content": []},
{"content": [" "], "expanded_content": ["This movie is probably the best animation that I ever saw, but unfortunately not all people can enjoy it entirely. It brings various messages, but the deepest one is about remembering the ones that we love and how time can affect our memories, Alzheimer is not directly shown but its presence is undeniable, the way that music brings back lost memories was so similar to my own experiences that I could tell it was someone expressing their own experiences, I felt some intense emotions in that scene."]},
{"content": ["You must be a fool, if you don't want to see this film. The story, the songs everything is incredible, this film will win every award for its category."], "expanded_content": []},
{"content": ["can highly recommend coco, the new disney film, really good story, surprising amount of twists for a disney film, songs are great its very colorful and funny and **** moving"], "expanded_content": []},
{"content": ["This is an awesome movie, Pixar did a great job researching, best animated movie in years, just like that"], "expanded_content": []},
{"content": [" "], "expanded_content": ["A work of art that beautifully matches Pixar's amazing artistic stories and designs with Mexico's beautiful and sacred culture. And the music... Oh the music. This a beautiful work of art that not only touches your heart, but your soul as well. This is why Pixar is and will always be of the most creative and beautiful animators ever."]},
{"content": ["This movie was a constant joy to watch. The characters' dialogue and delivery was incredibly believable and touching."], "expanded_content": []},
{"content": ["A film with a deep message beyond being an animated film. Perfect for not only for children with a great imagination, but for young people and adults with a big heart."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Pixar has done it again. \"Coco\" has elements of \"Back to the Future\", \"An American Tail\", and \"The Little Mermaid\" all woven into the storyline. This is a great thing. All the good elements are there without just being a rehash. The artwork is phenomenal. The accuracy that they put into the guitar music right down to the way that the fingers shape the chords is simply wonderful. This is definitely a must see."]},
{"content": ["Coco is an amazing film for the whole family. The atmosphere is beautiful, and the storytelling is on another level. It is an emotional journey that managed to keep me hooked the entire time."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Es muy buena, no es como decir \"pelicula para niños\". Fui a verla y me encanto, sus musicas, su historia, es perfecta"]},
{"content": [" "], "expanded_content": ["Emotional beyond limits, visually breathtaking and crafted with such respect for a culture foreign to many, this movie is one of Pixar's best of all time. A story about life and death, family and destiny, passion and love. Everything you need in a perfect Pixar film. The only 'flaw' is that it is a bit too predictable somtimes, but even sitting in the theater knowing what is going to happen makes your heart jump in excitement. A must see film and one for everyone. Bring tissues!"]},
{"content": [" "], "expanded_content": ["This is another Oscar-winning piece of animation that Pixar accomplished. I watched it in theatres and I was stunned by the visuals, music, plot and character development. I am one of the fans of latino music and I couldn't believe when I heard that Disney is going to make a movie with that sort of music. It is sourley an Oscar-winning animated movie of 2018!!"]},
{"content": [" "], "expanded_content": ["remember me..", "Coco", "Lee Unkrich's witty and dramatic world of dead, works on all levels; from music to secrets, from drama to comedy, from kids to adults, Coco delivers the whole package where not only it's characters but range too works in its favor."]},
{"content": [" "], "expanded_content": ["Coco continues Pixar's long tradition of great film making. While it didn't have me the whole way through it still hooked me with it's message of living your dream no matter the cost and an ending that is incredibly satisfying and which had me tearing up with a message of family. A-"]},
{"content": [" "], "expanded_content": ["I can't even begin to put in words how much I loved Coco. Pixar, thank you for taking the time and effort to study and understand the culture, to really try and make a movie about a holiday that means so much to so many people. And in doing it, creating a movie that is just so darn good, filled to the brim with amazing music, animation and a story that really made me feel close to all of those that have moved on. A fantastic movie, worthy of ever possible recommendation. Must see."]},
{"content": [" "], "expanded_content": ["I watch the movie complete, I cry at the end! This is a amazing movie where it is shown that everything in life is not good, and that the achievements are not voted on, they stay forever in your life, as well as if one of your family members has died, but will always be by your side, remembering all Those beautiful moments with you, and everything they did, and that's why I cried, I have no words to describe how beautiful this movie was, Thanks Pixar!"]},
{"content": ["One of the most touching coming of age stories in recent memory. It is well written and I love that it was able to cleanly deliver a message about healing family ties. I will see this again and recommend it to everyone."], "expanded_content": []},
{"content": ["This is one of Pixar's finest films ever. Gorgeous animation, great music, beautifully paced, I have not one fault with this film. Take your kids to see this movie."], "expanded_content": []},
{"content": [" "], "expanded_content": ["This is an excellent effort from Pixar. Not only is it an entertaining and moving story, but also one of the most vividly colorful and visually appealing movies...ever. My kids (6 and 3 years) enjoyed it, although it took a bit of explaining for my youngest to grasp the concept of the skeletons representing the memories of loved ones. We adults adored the film. Highly recommended!"]},
{"content": ["A great celebration and showcase of Mexican culture and folklore. Watched it twice and cried each time. A must see for any family, ESPECIALLY for those with Mexican heritage."], "expanded_content": []},
{"content": [" "], "expanded_content": ["The story is well though out, the main character is immediately sympathetic in his goals and situation, but most of all - I heard everyone in the theater sobbing or sniffling at the end. And I was no exception. This movie will jerk your tears out. Years after Toy Story 3, Lee Unkrich did it again."]},
{"content": ["Without any doubt COCO will remain as one of the best animations for all ages! I would give it a 9/10 because i predicted almost the entire movie. But the story and the idea behind it deserves nothing but a 10/10"], "expanded_content": []},
{"content": [" "], "expanded_content": ["Great movie and great message. Pixar has only shown improvement after improvement with each release this decade. Coco may be one of the best animated movies ever released... The story will catch you from start to end and you may drop a few tears while at it."]},
{"content": [" "], "expanded_content": ["Even when Pixar comes out with the occasionally weaker film, they still manage to make something entertaining, and while they've definitely released some films recently that wouldn't rank alongside their best films (I'm looking directly at \"The Good Dinosaur\" when I say this), there's always some excitement going into their films that they are just gonna blow everyone away. With \"Coco,\" they've once again created something truly special. Beyond the beautiful, heart-wrenching storytelling, the lovable, well-written and hilarious characters, the absolutely breathtaking animation, and the wonderful songs, \"Coco\" succeeds for its incredibly respectful and wondrous portrayal of Mexican culture, and the way it handles the themes of family, life and death, and how these themes are interwoven so perfectly so as to create an adventure that is as entertaining as it is emotional. Sí sí, \"Coco\" es magnífico!!! Believe the hype, and go watch this film!!!!!"]},
{"content": [" "], "expanded_content": ["Pixar strikes again with a vibrant, colorful, and all-around endearing look at Spanish music, culture, and the Day of the Dead celebration! The film is fun to watch for the most part and is undeniably heartwarming, albeit a bit predictable in some spots here and there. But overall, I'd consider it another true and fun winner from Pixar!"]},
{"content": [" "], "expanded_content": ["The charm and the specatacular sea of colors and sensations, give \"Coco\" originality and a unique emotional involvement, making it one of the best animated features of the last decade."]},
{"content": ["Maravillosa, emotiva, fantástica, me emociona cada vez que la veo y es muy entretenida."], "expanded_content": []},
{"content": ["An adults perspective.  Great animation, storyline and acting.  The Mexican aspect was not stereotypical and was authentic.  This film was terrific and special."], "expanded_content": []},
{"content": [" "], "expanded_content": ["*NOTE: I would highly encourage that parents/guardians consider the age and maturity of their children before attending.  Coco deals with themes of death and depicts characters dying.  Kids 7+ should generally be fine.", "1. The animation is beyond what Pixar has been achieving recently.  For some reason, they seemed to really not want to settle for anything less than perfect with Coco.  Unlike Disney's older, earlier use of CGI where they'd achieve a large background or hundreds of characters in the distance by cloning the same character over and over like the armies in Mulan, Disney had 2D artists meticulously detail every single building in the background.  It was similar to Hayao Miyazaki's use of highly detailed background mixed with simple characters in the foreground.", "2. I think I'd give it a 7 actually, I think the plot had a bit of fat that could have been trimmed and as another reviewer mentioned, it lacks the classic constantly near-perfect Pixar humor, but I'm bumping up the rating slightly because some reviews are giving it a zero because using a handful of Spanish words and referencing South American and Spanish culture is now an \"SJW liberal agenda.\"  The film is just a cute Day of the Dead story.", "3. The character design is really good.  They use shape language and costume really well, successfully designing characters that look exactly like their personalities.", "4. I had that feeling of being slightly ahead of the plot but that's alright in a children's film, it wasn't entirely predictable or boring.", "5. I wouldn't personally call the film a musical.  There are characters who perform music and sing, but only in realistic ways.  The songs are pretty enjoyable.  I feel like it could have used an extra lighthearted or pick-me-up song because the central song of the story, Remember Me, was a little sad although also the best song in the film.", "6. Coco's message is one we've seen a lot from Disney and Pixar.  Despite it not being a very original moral, they managed to present it in a pretty original way.", "7. The best thing I can say is that I went into this film with no knowledge of it.  Having been burned a lot by a couple bad titles recently, I was expecting nothing good.  It blindsided me by being memorable and surprisingly heartfelt."]},
{"content": ["it was amazing! I'd like to recommend this movie to my all friends. Particularly the actors in the movie soooo great!"], "expanded_content": []},
{"content": [" "], "expanded_content": ["When Miguel, a 12 year old Spanish boy wants to follow his hearts' dream of becoming a musician, things turn for the worst as he finds himself trapped between his family with an apathy towards music and egocentric, sleazy characters in the afterlife. On a quest to find his Grandfather he discovers a world never imagined.", "What a fantastic film, rich of intrigues, emotion and mesmerizing scenes.", "The warmth and Spanish undertone of the film, evoke your own family bonds, while fond memories and love for one’s Grandmother stirs your heart.", "I lost myself in the movie to such an extent that I forgot I was watching an animated production.", "Coco is not a musical, but there is a hint of music in the film, which builds on top of the superb storyline. The screenwriter manages to create a suspense in which one can’t wait for Miguel to play his next riff on his strum.", "The film is heartwarming. It manages to show us a different side to the afterlife, a side which we never imagined, where the dead interacts with the living and skeletons are beautiful, emotional and lovable characters.", "Miguel strikes a friendship with a trickster named Hector and together they discover the story about Miguel’s family, which eventually leads to making his dream become reality.", "The animated 3D adventure encourages oneself to follow your dreams at all cost, but most importantly to put your loved ones first.", "The movie has been produced by Disney and taken Gross Income of $457,925,760 from it’s opening on the 22nd of November until 22nd of December 2017.", "Coco is a wonderful film for the whole family and a must see for everyone who loves music, beautiful scenes and awesome characters!"]},
{"content": ["A beautiful hero's journey told like it was never told before. Bravo. I loved it. Start to finish."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Pixar’s newest movie has been the best they have hadn’t in years, beating out: Finding Dory, The Good Dinosaur and Cars 3.  Coco is one stellar performance (literally) that is one you don’t want to turn your head away from.  An amazing story, characters and animations, although  Coco is a little draggy, it is all worth it in the end.  Coco is a true masterpiece that I can’t imagine being forgotten."]},
{"content": ["Disney Pixar has raised the bar really high with this one. Up used to be my favorite animated movie of all time, but now it is number 2 and keep in mind I am in my late 20s."], "expanded_content": []},
{"content": ["the best.......... you should see it you will cry....well all cool things are in this movie"], "expanded_content": []},
{"content": ["Love love loved Coco!  Beautiful graphics, sound effects, great storyline... perfect, in every way.  It made want to celebrate Dia de los Muertos and inspired me to buy my 5 year old a guitar."], "expanded_content": []},
{"content": ["EN: I found a show, it's amazing how they used the characters. A beautiful work by Lee Unkrich and Co.", "PT: Eu achei um espetáculo, é incrível como eles usaram os personagens. Um belo trabalho de Lee Unkrich e Cia."], "expanded_content": []},
{"content": ["Pixar and Disney, you two son of a ******, this is i would say one of the best movie in our century. If you havent watched it, just go now! NOW!"], "expanded_content": []},
{"content": [" "], "expanded_content": ["Rewatched Mar 25, 2018", "Matt Kerr’s review published on Letterboxd :", "First time I watched this, I thought that the only flaw was recycling some plot elements from older Pixar films. However, having watched it the second time, I realised that even these points were used possibly to a better effect than their predecessors, and in a more deserving film. All in all i would say this is more than a return to form for Pixar, calling back to their golden age; it may just be the best feature-length film they have ever made, and a wonderful achievement in animated film."]},
{"content": [" "], "expanded_content": ["Una carta de amor a la cultura mexicana. Este filme posee una increíble belleza visual y desarrolla, en buena parte, de forma interesante algunas temáticas como el significado de la memoria, la muerte, la familia y el olvido. A pesar de lo anterior, el guión es un tanto simple, cliché y hasta predecible."]},
{"content": ["Somewhat predictable, but nonetheless another smash hit from Pixar after some years of mediocrity. It has all the heart and character you'd come to expect."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Look, this movie means well. It really does. I'm truly fascinated by foreign cultures. but Coco was a big disappointment for me.", "Yeah, it looks pretty, there's some heart, and admittedly the ending was brilliant, but in between those are very bland jokes that I never found funny, modern Disney cliches like the plot twist villain, and a dog named Dante who's probably one of the most annoying animal side characters I've ever seen.", "Very mixed feelings for me."]},
{"content": ["Our family watched this on Netflix after seeing Solo at the theaters.  Nobody cared for Solo, but the whole family absolutely loved Coco!", "Tip to Disney - Let Pixar take the reins with the Star Wars material."], "expanded_content": []},
{"content": [" "], "expanded_content": ["(I'll keep this very spoiler free) As someone who is a Hispanic and was surrounded with many Mexican traditions and taught the history of my family's culture, I was happy seeing the film wasn't a big Mexican stereotype like The Book Of Life (which I personally did not enjoy because it wasn't able to keep my attention besides its interesting animation) it felt like an actual Mexican family and many of the characters reminded me of my own family members with the way they would interact with the lead Miguel. This film was filled with a lot of charm and love with every bit of detail they would add in the animation and even the music, so much of this film kept me with a big smile and never looking away. The only issue I have that keeps it from being a perfect film is the story, I was able to predict most of the twist and part of the ending, it does do some of the typical Disney tropes where the boy tries leave the family to pursue his dreams that the family forbids him to do, but it doesn't ruin the film, because It works in the film's favor, it helps give it even more charm that it already has. In short, Coco is a fantastic film with so much to love about it and even if the story can be predictable with the some of the typical Disney plot, it doesn't take away from the film, but it gives it more to love about it. I highly recommend this film to everyone and I think it's up there with the great Pixar films and deserve all the praise it's getting."]},
{"content": ["Another great movie by Pixar with Coco delving with different parts of your emotions you may have. Following your dream, family, grief, this movie does a great job with those themes."], "expanded_content": []},
{"content": ["Coco is definitely a family film to check out. Pixar did everything they've always done and put it into this movie. Emotional moments, incredible animation, great setting, fantastic plot, and the musical scores are at their best here."], "expanded_content": []},
{"content": ["refreshing for pixar. visually stunning and surprisingly emotional.!.!.!.!."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Since I'm a huge fan of Pixar, I had to watch Coco, and of course, as expected, I LOVED it. The emotions that are conveyed are so powerful. The characters are so likable, Miguel and Hector form a perfect duet together, the antagonist was (at least as far as I'm concerned) very unexpected, and yes, I cried at the end, it was so powerful. The only thing I HATE about this movie are the people who think that this is a rip-off of \"The Book of Life\", whereas it's absolutely not. I loved Coco !"]},
{"content": ["Just wow, this movies touches your soul with song and lyrics. The way some lyrics are meant are just those where words fall short. A heartwarming movie with some amazing original soundtrack."], "expanded_content": []},
{"content": [" "], "expanded_content": ["This is an amazing movie. Beautifully directed and amazing story. Its great to learn more and more about people and Mexican amazing traditions. Definitely on the same level as the Book of Life. Inspiring, funny and the music score is great! Its sad that some ignorant people are scoring this movie with a 0, but well you got racists everywhere ."]},
{"content": ["Absolutely loved this movie and its message about the importance of family.  Reviews were spot on- great music, visuals and story.  Can't wait to see it again!"], "expanded_content": []},
{"content": [" "], "expanded_content": ["Hands down one of Pixar's best movies if not their very best. On the surface it is a visual beautiful and vibrant tale of a boy's passion for music that pays homage to Dia de los Muertos. On a deeper level, it pulls at your heartstrings with an expression of love and connection that transcends this life and goes into the next."]},
{"content": [" "], "expanded_content": ["Pixar had done it again. Coco is excellent in every aspect of movie making: it's characters, it's plot, it's performances; but what pushes it over the edge is the absolutely gorgeous animation style, which is where Pixar continues to push the envelope. This movie is sure to feature on many top 10 lists this year and that Best Animation Feature Oscar is a lock."]},
{"content": [" "], "expanded_content": ["12-year-old Miguel Rivera dreams to be a musician, but his family is against this, because the family business of the shoemaking. The problem is that Miguel's great-great-grandfather abandoned his wife and daughter for the musician's career, and since then in the Rivera's house any melody is banned. There comes the Mexican Day of the Dead, and Miguel secretly goes to the city square to participate in the talent contest, but he does not have a guitar. He decides to \"borrow\" the instrument in the crypt of his idol - Ernesto de la Cruz - but, touching guitar, Miguel falls into the world of the dead. And if he does not get out of there until the morning, he will forever remain a skeleton.", "Pixar is surprising again. This time - the ability to tell a very grown-up story by kids' language. As in the Oscar-winning \"Inside Out\", here we go on a journey, where the ultimate goal is homecoming, back to the family. Add to this juicy Mexican melodies, brilliant animation, and Pixar's sense of humor and you will get an unforgettable cocktail of all possible emotions. It is clear that the \"Oscar\" is already in their pocket."]},
{"content": [" "], "expanded_content": ["Despite the negative and somewhat racist reviews, I felt as if Coco had nailed all of its key points: it had a beautiful aesthetic, a well thought out story, and a compelling message. Coco has some breathtaking scenes that will completely mesmerize an audience, it has a great message about the importance of family and remembering them, and it managed to create a story that had few hiccups. The only major problem that I had with Coco is that it had some predictable twists. But overall, Coco is a fine and worthwhile film to go out and see, be it by yourself or with some friends or family."]},
{"content": ["Coco was an emotional, cultural, insightful and beautiful. It's become my favorite Pixar film to date and I need y'all to honestly stop reading this and go see it. 10/10  -A"], "expanded_content": []},
{"content": [" "], "expanded_content": ["as a Latin American (and great friend of Mexico), I have to say I really loved this movie.", "The animation is incredible, the characters are funny, the message of the family is really deep and emotional, the creators spent years doing a real study on the culture of Mexico and they knew how to respect it better than anyone in hollywood.", "I hope that people from other countries can appreciate this, thanks Pixar, you did it again!"]},
{"content": [" "], "expanded_content": ["Best Pixar/Animated Disney movie I have seen in years. This story made me cry over and over throughout the film,and not out of sadness. The final scene before the end was the so heartwarming,it left me using the napkins I planned on using for buttery popcorn hands to wipe the tears out of my eyes. 10/10 Beautiful!"]},
{"content": ["I cried the entire last thirty minutes - and I don't cry! This has all the elements of good storytelling; ghosts, a dog, music, family, and a dash of darkness."], "expanded_content": []},
{"content": ["Pleasant enough, with some decent music and animation. The main problem with Coco is that Pixar have done this very formula before, and they've done it much better."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Wow! I had high expectations for this film, but it was more enjoyable than I thought it would be! Even with a long running time and not much laughs, Coco succeeds thanks to its gorgeous visuals, endearing characters, imaginative settings, strong plot, and heartfelt messages about the importance of life, death, memories, and family.", "It's also great to see Mexican culture be represented with care and affection by a Hollywood studio. A great film to watch on your Thanksgiving break. 8.5/10", "(P.S. That Frozen short was awful. Dear G O D is it annoying!)"]},
{"content": [" "], "expanded_content": ["I'm from northeastern Mexico, and we do not have such deep-rooted traditions, but in my opinion this film portrays Mexico of deep traditions in an exceptional way, without falling into the previous stereotypes of colonial Mexico in which the Spanish culture was present. The story seemed excellent and very entertaining, with funny moments and some very sad, the characters sufficiently developed."]},
{"content": [" "], "expanded_content": ["Reproduces in a respectul and a masterful way the tradition and folklore of Mexico in The Day of the Dead, with emotive references to iconic characters (Frida Kahlo, El Santo, Cantinflas); that deserves from Mexico a loud: Bravo! (In the name of God and your sanity: skip the short animated feature of Frozen)."]},
{"content": [" "], "expanded_content": ["It is a great movie for both kids and adults (both my kids - 7 and 10 - liked it very much). Despite a serious topic - i.e. death (and death taken seriously, not Transylvania style ;-)), the movie is really fun to watch.", "Don’t listen to reviews claiming that Disney / Pixar should not touch other cultures, because it is an absurd claim. I’m quite aware Mexicans are perfectly capable making own movies, but who - apart from Mexicans - is watching them? I’m sure I’m not, as millions of people that will watch Coco. And I’m really glad that I did. Besides going this road we could never see Mulan, Moana and many more great animations..."]},
{"content": [" "], "expanded_content": ["I was expecting to see a lot of stereotypes about my country and my culture, but instead it felt familiar, really familiar. Like \"haha y grandma does that too!\" and the cemetery looked almost exactly as it is on every day of the dead... and that \"happy nostalgia\" so intrinsic of my culture..."]},
{"content": [" "], "expanded_content": ["Remember when Pixar films were funny?  I mean, REALLY gut wrenching funny like the \"Toy Story\" films or \"Monster's Inc.\"?  I miss those days.  This film has a few chuckles and a lot of impressive, beautiful animation, but like most recent Pixar offerings it relies more on tugging your heart strings than making you laugh.  I enjoyed the movie but it certainly isn't a Pixar classic like \"Finding Nemo\" (their last masterpiece).  I feel it is probably their finest film since \"The Good Dinosaur\", a very underrated Pixar film.  Like most Pixar films there is a short film before the main event.  It was probably the longest \"short\" ever, more like a mini-movie.  It involved Olaf the snowman and Christmas and was enjoyable, although lengthy."]},
{"content": [" "], "expanded_content": ["A beautiful film that examines the importance of memory and family, with exquisite visual design and an engaging storyline that is a delight to experience. The cinematography is excellent, the performances are polished, and the careful pacing allows for profound emotional resonance without losing momentum. From the opening sequence, it's clear this is a unique and considered narrative that makes for a perfect family film during the holiday season. A lovely film well worth your time. 8.89/10"]},
{"content": [" "], "expanded_content": ["While one might expect me to be more benevolent with this film because it focus on celebrating a very important part of the Mexican culture, Coco does not appeal to that, after all it is Disney and Pixar film and quality has never been a problem with them.", "Although Coco's has a certain fallacy because the family of the main character, is a Mexican family rooted in the rural spectrum and these people celebrate music, the fact that Miguel's passion is forbidden it certainly does not seem entirely believable, but at least the background is believable and functional.", "Evidently Coco plays with the idea of ​​any children's movie where children seem to know more than adults and adults do not react well to that, after his grandmother smashes his guitar, Miguel's true odyssey begins and Coco's magic appears .", "The visual aspect - not the animation - is frankly rich and any Mexican or Latino living in the US will find it familiar, all the inconography and folklore are present and they are the most striking strength of this film.", "That it does not feel original? No, undoubtedly it does not, but the difference lies in the more entrenched quality that Pixar imposes on the film, its message is not new either and although it's fair to believe that Pixar took something already seen and improved it's also fair to give this film the chance and appreciate it for the quality it contains, not for what it did better than those who came before and at that point, like it or not, Coco is better.", "Maybe I am softer than I usually am but frankly Coco is what I expected, I did not want surprises or something lavish, I wanted quality, I wanted a beautiful animation and I wanted a good story and in my opinion Coco has all that.", "*** By the way when the movie gets released, if you're not very interested In Frozen, skip the first half hour, Disney included the long and boring short of ''Olaf's Frozen Adventure'' and that was a very annoying experience. Ironically, the rest of the audiences here in Mexico also hated it so much that it was removed. I don't think that's going to happen in the US so that's why I'm preventing you."]},
{"content": [" "], "expanded_content": ["the animation was beautiful. i didn't even want to blink and miss a second of it. its very colourful and the main characters have some great backstory, they leave out just enough information to give it an amazing ending. yes, the ending was almost completely unpredictable! the only thing i slightly disliked was that sometimes the story felt slightly \"all over the place\" and a few parts felt short, other than that, it was great"]},
{"content": ["\"Coco\" is heartfelt, and boasts a thoughtful story about life, death, music, and the importance of family. It is also filled with stunning music and is gorgeously animated."], "expanded_content": []},
{"content": [" "], "expanded_content": ["wow guys was I surprise with this movie... I'm not mexican but share some of the same culture back in guatemala.... and this movie was awesome... It doesn't mater if you even know anything about the Dia de los Muertos tradition... this movie is a delight from start to finish."]},
{"content": [" "], "expanded_content": ["Coco is another great film by Pixar studio. On one side it is just an entertaining family movie about a boy and his passion for music, but like most Pixar films has more serious messages slipped into the narrative.    **Light spoilers**  This time around the studio touches on themes of family, the loss of loved ones, and a more subtle reference to Alzheimer’s/Dementia.    **End of spoilers**    The only Con to the film for me is that the final act felt a little rushed; this did not impact my overall enjoyment factor.  If you are a fan of any of the studios other works I highly recommend this film. The attention to detail is amazing, and they even went as far as to capture the hand motions of actual musicians to add to the authenticity. Coco is a great film for both kids and adults"]},
{"content": ["Coco is simply breath taking in it's art style story telling and most surprisingly symbolism."], "expanded_content": []},
{"content": [" "], "expanded_content": ["I loved every second of it. At first it looked way too similar to \"The Book of Life\", another film set in Mexico during the Day of the Dead holiday, but it's actually much different (and better). \"Coco\" is emotional, inspiring, beautiful and feels like it's going to be another Pixar classic. It truly fits with the spirit of Thanksgiving too, as it teaches some imporant lessons about family and following your dreams."]},
{"content": [" "], "expanded_content": ["All around enjoyable film. I was a little worried going in because there were TEN previews for other kids' films (nine of which relied heavily on bodily functions for cheap laughs), but I was pleased that Coco had none of this. It's a beautiful film with great music and morals. If you liked Kubo & the Two Strings, you'll very probably like this."]},
{"content": [" "], "expanded_content": ["Let see how do i put this ? minus the b*.l.ls.h*t Frozen singing  at beginning plus 15 minute boring of the movie. This movie is 1 of the best pixar this year. I almost cry at the end of the movie one again pixar touch audience's heart. As i said 15 minute of movie kind cliche and boring but if you get thought it you will find this is best animation this year"]},
{"content": ["Coco is a fine children's movie, with a good message, but Pixar can honestly do better. Cliches are noticeable and world building is very flawed (to be fair Pixar always had problems with world building)."], "expanded_content": []},
{"content": ["Very pretty to look at and creative in terms of the animation but offers an extremely formulaic and predictable narrative. Twangs on the heart strings relentlessly and you end up leaving the cinema more depressed than when you entered."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Pixar continues its streak of stark, visually resplendent, and narratively superior animated films with \"Coco,\" a celebratory look at death, the afterlife, and the importance of family and following your dreams. It's rare that you watch an animated movie with a story that's as effective on children as it is on adults - something that Pixar's proved it can do time and time again, albeit - but when you mix in some of the thematics mentioned above, it's that much more impressive. Hats off to co-directors Lee Unkrich and Adrian Molina for crafting such a powerful treat."]},
{"content": ["The animation is stunning. I love that, since Frozen, Disney realised that love isn't only between a man and a woman but also, among family. It can become restless at times even for adults but overall it has a good story. Go watch it."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Pixar know how to make a visually beautiful film, that WILL tug hard on your heart strings. Coco is no exception. You don't have to be of latin or hispanic descent to appreciate the history and culture that this film presents us with. Such a beautiful homage to family."]},
{"content": [" "], "expanded_content": ["A film so beautiful that it made me cry.  The Mexico culture is so great here, it shows that Pixar put a lot of effort to make it correct in this aspect. The animation is beyond excellent and proves that Pixar is getting better in each film in the animation aspect. The voice acting is great (more than anything Gael Garcia Bernal). A very original story, even do, it is similar in a few things with \"The Book of Life\" (incredible movie) in his plot. The only thing this film did badly is the 30 minutes short from \"Frozen\" that is shown at previous this film starts. Is such a cliched pain in the ass and it is extremely long. I went to go to buy some popcorns and to the bathroom and when I came back, the f*@#ng short was still running."]},
{"content": [" "], "expanded_content": ["Real Score: 8.5/10! What a fun way to quick off my break! I went with some friends to a night time showing and I think it's safe to say we all enjoyed the film. Scoring this movie was really hard for me because if we were to look at letter grades, it definitely would be somewhere in the B-range for me but where? An 80% seemed too low but something closer to 90% seemed too high. I think it would be hard to counter that the illuminating scenery was anything less than magnificent.  I don't think a scene went by where I was not in awe of the pure beauty of the movie from the spirit guides to the bridge; I think the best word to describe it would be \"enticing!\" Even the opening which was not lit up was gorgeous and was reminiscent of Hercules or Beauty and the Beast. The music was also stellar and I felt hypnotized by the guitar. I had extremely high expectations because Lee Unkrich is credited as the sole director of TS3, which I think is a perfect film, but I don't exactly think Coco was. I feel like there was a lot less humor in this film as compared to most Disney or Pixar films and that the jokes just didn't hit quite as much as they could. It was also a bit predictable plot wise which being a family film is forgivable but doesn't add to the score? I will say I feel like my experience watching this film was very similar to my experience watching ET. I didn't think I was that connected until the end when the drama hit and I started choking up, and for clarification sake , I've never cried in a movie, so choking up is about as far as I get. Overall, this won't crack my top five movies of 2017 but I'm willing to say it will hit my top ten. I definitely think you should go see it but I don't think it is the best Pixar film we've ever had. * And then the little foot note that is Olaf's Frozen Adventure. I didn't like the Frozen short before Cinderella, and I think this was better but oof. There was exactly one joke, where Olaf is being a savage, that I just started balling out laughing and is probably the only time I purely laughed while I was at the movie. But, other than that, it was tedious. Yes, I'm probably being too harsh on it but the movie ticket said 7:45, OFA started at 8:00, and that's a 20 minute short of all these discombobulated D-rate songs. I love Frozen, I saw it seven times in theatres, but goodness, I think I'm done with Frozen. Of course, I'm sure temptation will win over when Frozen 2 comes out in 2019..."]},
{"content": ["It's a movie that's way better than Cars 3. Although i don't think is one of Pixar's best movies, is one of the best ideas in represeting better \"El día de los muertos\" than in The Book of Life. So yeah, It's good. Not the best, but good"], "expanded_content": []},
{"content": [" "], "expanded_content": ["Compared to Pixar's previous original installment, Inside Out, this one's attempt to win best film of the year is extremely slim due to its huge difficulty attempting to keep up the hype from the get-go. While Inside Out may seem to be on something to win best film of the year and it literally worked, Coco, on the other hand, may seem to follow the same tracks that Inside Out went but it just can't find itself to win best film of the year. Although it won't win best film of the year in my opinion, Coco is definitely a solid film that definitely proves that Pixar is still the king of animation movies since the release of their first feature film, Toy Story, and no other animation studio can overtake the throne. If you can still find a way to ask them to see this movie, please do so right away because Coco is definitely worth watching since it's Pixar after all."]},
{"content": [" "], "expanded_content": ["Тайн Коко- настоящий шедевр от студии Pixar! После халтурно сделанного фильма \"Тачки 3\", я мало чего ожидал от будущих проектов Pixar, но меня приятно удивили. Отличный персонажи (особенно хочу отметить бабулиту). Также в фильме понравилось атмосфера праздника \"Дня мертвых\". Отличный юмор, который вставлен к месту и просто удивительный крепкий сюжет в котором почти нет косячков. Песни вставлены в подходящее место, а не как в мультфильме \"Холодное Сердце\", где песни вставлены просто, чтобы было. Последняя сцены мультфильма просто шедевр! На фильм нужно идти всем от возраста 4 до 90 лет! Шедевр от студии Pixar!"]},
{"content": [" "], "expanded_content": ["\"Humans are weak for their emotions\". I can't agree more with that statement after watching the movie. If the movie ever moved you, then congratulations -- you have lost your rationality. Don't let emotional outbursts override your rational thinking.", "Now, calm down and reevaluate the whole movie. The core conflict is presented by the first scene: Music vs. Family. But have you ever realized that these two isn't a conflict at all. You CAN enjoy music while having a loving family.", "However the director chose to show us a stubborn mother. Music is BANNED forever only for a family member left forever -- she don't have to, since that will be a irrational choice. Let's return to reality: Will you ban cooking forever if a family member got badly hurt and died while preparing dinner?", "Also what REALLY disappointed me is the final wrap-up song \"Proud Corazón\". This sentence is repeated twice: \"Our love for each other will live on forever\". So: the director believes that the message of this movie is to promote family union? Well, that is WRONG! I think it's about compromising and accepting.", "why? That's because the family never ripped apart in the first place. Hector is already planning his return to his family and let's use our imagination: if Hector returned to the family, will music still be banned? Obviously, not.", "The reason why most audiences think a happy ending would be appropriate is that since the \"Remember Me\" music made Coco remembered Hector, music is accepted by his family and Miguel received his freedom to play music, which, have no connections at all with family reunion.", "However, these flaws won't stop the musics included in this movie to be enjoyable. But since a movie has its mission to let its audience learn something from, too musical will be inappropriate.", "I don't think this movie will be Oscar worthy. But it should be good for an age group of 5~7."]},
{"content": ["Beautiful to look at, well crafted in every way. Very entertaining. But WHY is Pixar choosing to spend so much time and effort in this lesson on pagan religion?"], "expanded_content": []},
{"content": [" "], "expanded_content": ["How do you feel after a relative passes on? Sad? Afraid? Regretful? Doubtful? Relieved? Maybe you’ll remember your exact emotions after seeing Pixar’s newest celebration of family.", "A young Mexican boy named Miguel lives with his mamá Luisa and papá Enrique, his little sister Socorro, his aunts Carmen and Gloria, his uncle Berto, his cousins Abel, Rosa, Benny and Manny, his grandparents Franco and Abuelita, and his great grandmother, Coco, together, they’re the Rivera family. The ancestors remain dear to the Riveras’ memories—well, except the father of Mamá Coco who left his family to pursue music. Today, all the Riveras, Grandma Abuelita in particular, took it to discipline anyone for touching an instrument.", "On the other side, a dense city houses Mexico’s deceased souls alongside numerous other colorful spirit animals. When one of the inhabitants’ photographs is set out by the live family members in the local cemetery on Día de los Muertos, a gate designed to resemble an immigration system gives them the okay to cross the amber leaf bridge to see their loved ones. Miguel knew them for years only through stories and photographs, and now he finally meets them in person after stealing a famous musician’s guitar leaves him cursed. Miguel’s ancestors include great-great grandmother Imelda, Mamá Coco’s mother, the short Papá Julio, the plump Rosita, the horn-eyed Victoria, and the twins Felipe and Óscar; he must receive one of their blessings before sunrise, or else he will be stuck there forever.", "But Miguel thinks he found another way home through his musical idol, Ernesto De La Cruz, his great-great uncle from the story! He even has a way to find De La Cruz: Héctor, a silly little man desperate to see his family again since they never once set out his photo. Then once a Shyamalan twist reveals why he wants to see his family again so bad, the true heartache comes full circle.", "This production proves Pixar’s continually committed research, including the steps outlined in the Día de los Muertos ceremony. Especially amongst the world of the incarnate, beautiful leaves create relaxed candlelight glows, like the long celebrated fun creativity shined by the immortal hopping lamp! I’m sure it keeps accurate to Mexico’s family values, since audiences in Mexico were supposedly thrilled at the premiere, taking in $28 million since its October 27th release! The same level of effort goes to the voice actors: Anthony Gonzalez gives a true, soulful performance for Miguel, his musical voice as pure as child actors come, and the right cast surrounds him with further compassionate voices, whether dead or alive.", "Yet once Miguel enters the afterlife, coincidences lead him to wherever the narrative takes him. Similar to what the revolutionary animation studio continues failing at, the details of the world prioritize comedy over realism. For instance, the undead skeletons drink liquor, but at the same time, say they need no bathrooms. Some other elements appear to contradict the hard research, such as English being the primary language spoken in a Mexican location. Pixar long succeeded in its widely-loved shorts without dialogue, so couldn’t they expand that format to a feature length? I mean, imagine if Coco was entirely in Spanish, except speech kept to a minimum? I think it would have made the experience a lot more authentic.", "Looking deeper into the script’s issues, the title character, Mamá Coco, gets too little screen time to serve her plot importance justice; she just sits in her wheelchair, eyes half open, less prominent than her highest potential. The writers should have implemented the family theme further by giving each boy and girl (and dog) in the Rivera family a purpose.", "In full honesty, the script’s issues stem from the protagonist, Miguel; he starts off whiny and selfish, in turn making his growth throughout less earned than its capacity. In fact, quite a few offensive moments seem tossed in for humor’s sake, specifically a brief unnecessary scene where Miguel notices a nude portrait model (a skeleton). The depiction of Mexico’s afterlife as truth rather than myth may also concern some more religious viewers. And finally, the gate used to allow Mexicans to pass through on Día de los Muertos almost parallels Trump’s future vision of his wall, which could offend some more conservative viewers.", "Although Coco can overall still please anyone looking for a good holiday treat. These months are not always a happy time, considering the number of deaths around this time, so this special celebration of both life and death just might satisfy our hurt."]},
{"content": [" "], "expanded_content": ["I know this will cause a lot of controversy but here goes. I would seriously consider myself a bit of a Pixar fanboy. I’ve seen every Pixar film ever (bar cars 3) and this one was by far the worst. I hated Coco. My expectations weren’t even superbly high. It wasn’t funny, the characters weren’t especially strong, the songs weren’t that good and the number that won an Oscar for best original song (Remember Me) was the absoulete worst. I really try in these reviews to be as positive as i can but the only parts of this film i did like were the dog and the absouletely stunning animation."]}
]