[
{"content": ["The third installment in the Thor trilogy is by far the best one. It's the most fun movie of the year, hilarious but also epic, filled with incredible action sequences, stunning visual effects and a powerful cast."], "expanded_content": []},
{"content": ["This movie was a whole lot of fun. Great action sequences, good music selection, genuinely humorous moments. It's the best movie Marvel has done. It's just a fun action flick."], "expanded_content": []},
{"content": ["Easily the best Thor film. Ragnarok changes key elements from the comics, includes a bevy of minor Marvel characters and adds a truly 1980s sci-fi look and somehow manages to make it all work."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Those complaining about the humor seriously need to watch more diverse films and look up Waititi’s films. The film utilized Gallows Humor. I know it’s probably unfamiliar with most people but Waititi’s films have all incorporated that form of humor."]},
{"content": [" "], "expanded_content": ["Taika Waititi has brought us a film firmly set in the MCU while still putting together a piece of bold storytelling. It has a Guardians of the Galaxy feel but the way the comedy is delivered here is much more stripped down and less produced. Films like this will keep the MCU fresh. A-"]},
{"content": ["Changes a lot with the other Thor's movies. I didn't feel scared about Hela or de Ragnarok, fight scenes aren't bad as much. Another movie from Marvel but not another movie from Thor. A Guardians of the Galaxy movie but with only humor, 0 drama."], "expanded_content": []},
{"content": [" "], "expanded_content": ["This is the only Marvel movie I have ever watched that I can honestly say deserves a 10/10. I think it surpasses both of the prior films. I've never been in a theater and heard so many jokes land so well and get belly laughs from the audience like this film did. Every scene was engaging and the execution was absolutely perfect."]},
{"content": [" "], "expanded_content": ["Under the direction of New Zealand director, Taiki Waititi, Thor: Ragnarok is Marvel's most audacious film in their cinematic universe to date. Not only does it supersede the previous Thor films, but does so in the funniest and entertaining of ways. By far the most unorthodox character change within the Marvel universe, the new direction for Thor is pleasantly unique and sought-after, filled with Waititi's trademark humor and exuberance from start to finish. However, Thor: Ragnarok is more than just a comedic act. There are dark undertones that prevail throughout the core plot of the story, and the fundamentals of a superhero movie are all present. From the opening sequence, the action and visuals are on point, the quality never deterred for a second. And it has now become quite clear that Chris Hemsworth has embraced the role as Thor Odinson, showing off his comedic range and immediately making the character much more compelling than the darker and least fun of the Avengers that we were previously used to. In the film, Thor must prevent Hela (Cate Blanchett) from unleashing Ragnarok, the end of everything, and in doing so, must assemble a team to face her head- on and save the Universe because-as he quotes-\"that's what heroes do\". The \"Revengers\" as he names them includes the Hulk (Mark Ruffalo), \"his friend from work\", Valkyrie (Tessa Thompson), a hard-drinking former warrior, and Loki (Tom Hiddleston), the mischievous brother who no- one should trust by now. And it is not a Waititi film without an appearance by the man himself, which came in the form of Korg, a hilariously voiced rock-monster who was the champion of cracking a joke whenever he popped up. Waititi's style of filmmaking is palpable to the point where it becomes evident that everyone had so much fun making this movie, that is carried through to what audiences were seeing. This is why Thor: Ragnarok works so well and is so fun."]},
{"content": ["It's a really fun movie with a spectacular picture. The effects are also extraordinary, which gives you an agony, is that the film does not end and this, gives you a discomfort, gives the impression that the end will not come."], "expanded_content": []},
{"content": [" "], "expanded_content": ["While this isn't close to the best marvel movie, its still a good one. With some fun humor, nice direction, and solid action, plus working as a stand alone film, it keeps the viewer entertained for sure. It struggles to break it's MCU problems though, like it's mediocre color palette, weak villain, and by-the-books plot, but Thor: Ragnarok is a nice superhero movie worth watching."]},
{"content": [" "], "expanded_content": ["Thor: Ragnarok is a fun re-invention of the Thor film series.", "After the disappointing The Dark World, Marvel needed to get the next Thor film right. Chris Hemsworth (Thor) demanded the next film be more comedic and his character funnier, like Guardians of the Galaxy, and it shows on Ragnarok. There are plenty of jokes and running gags, but thankfully not too many as to drag the film down in parody (unlike the Guardians of the Galaxy films). Seriously the film is a joy to watch. A couple of laughs never hurt anybody.", "The action scenes are amazing and beautifully executed. From the gladiatorial fight between Thor and Hulk, to the fight against Hela and her army of the dead, to the air fight on Sakaar. Special effects abound, and we even see Thor finally mastering his power as the God of Thunder, after his Mjolnir hammer was destroyed.", "The story is complex but still quite predictable. The movie's plot is a mix of the Ragnarok myth (the Viking equivalent of the End of the World), the \"Planet Hulk\" comic book storyline, and a new enemy, the Goddess of Death Hela, who escapes from her prison and is hell bent on revenge against the House of Odin. After a series of events Thor ends up on the planet Sakaar which is ruled by the Grandmaster who organises gladiatorial fights for his pleasure. Thor has to fight against Hulk to gain his freedom. They both escape from the planet along with Valkyrie and Loki to save Asgard (and the Universe) from Hela's army.", "But the film's story features plot holes and logic inconsistencies, like, isn't Ragnarok too convenient to take advantage of while at the same time Hela happens to be on Asgard, raising hell (literally)? Still it's a fun movie to watch but I think Thor Ragnarok adds nothing new to the wider Marvel Cinematic Universe (for example there is no new Infinity Stone found) other than introduce the Valkyrie (possibly a love interest for Thor in the future films), the Grandmaster and a couple minor characters. Hela could have been a major enemy of the Avengers but she is no more apparently (you never know whether Marvel bring her back somehow, after all she's the Goddess of Death).", "All in all, I definitely enjoyed Thor Ragnarok even if it's not perfect. Go and see it, it's great."]},
{"content": [" "], "expanded_content": ["I think it's fair to say that, of all the franchises in the Marvel Cinematic Universe, the \"Thor\" franchise, to put it short, is passable. While 'Thor' (2011) was a better-than-your-average introduction to the God of Thunder, many did feel that it didn't spend enough time showing him as such, instead they had to make him human in order for us to get to know him. I liked the spectacle, the emotion and the effort for it... it was an entertaining film, but nothing special. 'Thor: The Dark World' (2013) did have bigger action sequences, and more funny chemistry between the brothers Thor and Loki, but the comedy and final act dragged it down, and became forgettable and uninspired, but I still had some fun with it. So, it's easy to understand that with the third movie about the mighty God of Thunder, Marvel needed this one to be good. And, luckily, with director Taika Waititi ('What We Do in the Shadows'), it seems this franchise has been brought some life. 'Thor: Ragnarok' is easily the best chapter in this saga. It's vibrant, entertaining, action-packed, sometimes dark, and, to many's surprise, very funny. I know the word \"funny\" is odd, since the story of \"Ragnarok\" is meant to be dark and apocalyptic, but the humor does hit when it needs to. We see that Thor (Chris Hemsworth) has been imprisoned, still searching for those Infinity Stones, but as he returns to Asgard, he discovers that his brother Loki (Tom Hiddleston), the God of Mischief, has been ruling the kingdom and Odin (Anthony Hopkins) is nowhere to be seen. They discover that Asgard is in danger when they meet Hela (Cate Blanchett), the Goddess of Death, and sister of Thor and Loki (wasn't she supposed to be Loki's daughter? Then again, Ego was never meant to be Peter Quill's father...), who wants to rule Asgard and banish those who wrong her. Thor ends up on Sakaar where he meets Valkyrie (Tessa Thompson) and the Grandmaster (Jeff Goldblum), and he is told that he must fight in the arena in order to get to where he needs. His opponent happens to be the Hulk (Mark Ruffalo), which is seen as not much of a challenge for him. Thor tries to reason with the Hulk and manages to persuade him to help fight Hela before all of Asgard is in ruins. What makes this movie work is that it seems Chris Hemsworth has more fun in the role of Thor than in previous films. Thor has always been seen as the more \"boring\" Avenger simply because he is an all powerful god who holds a hammer. There's nothing more about him to make him sympathetic, only when he is rid of those powers, does he become interesting. Taika Waititi has a unique vision on the characters of Thor and the Hulk, they really get a chance to shine in this movie than previous ones. They are more interesting here, than before. Plus, the comedy is used effectively. Unlike in 'Guardians of the Galaxy Vol. 2' (2017) where the humor stretches beyond the first act, and the characters joke, even when they're in danger... here, Waititi only uses the humor when its needed. During the final battle, no spoilers, there is little-to-no joking around, especially when the whole world could end. Plus, the replacing of Kat Dennings with the charismatic Jeff Goldblum is also inspired... he is great as the Grandmaster, and I cannot wait to see more of him, if Marvel decides to put him in more upcoming films. Overall, this is a fantastic \"Thor\" movie, and it works because it ticks the boxes that the other two films forgot to tick. Hemsworth really shines as the God of Thunder, and the supporting cast all do a terrific job in their respective roles. It's funny... but not too funny. It's a blast."]},
{"content": [" "], "expanded_content": ["This Thor is a deviation from an already deviated cb origins that MCU adopted on the predecessors. I'd say the forced injection of humor in the form of corky, fratboy stuff and bathos to instill the idea of FUN is used at the expense of something that could have had a bigger potential for fans who were expecting more post the vision in Ultron. It leaves you demanding more justice to the central character. Taika's humor might land well for those who follow his previous offers."]},
{"content": [" "], "expanded_content": ["Let me sum up Ragnarok in a few words:'It's that great moment when a studio like Marvel understood that we needed a comedy a-la Spider-Man (2002) (Aside from Guardians Of The Galaxy 2014)'. But really,getting out of Thor Ragnarok really made my day,because it was exactly the movie i wanted to see: (Ragna) Rocky,Action-packed,and mostly funny at times.", "Let's talk about the story...I was blown away. Not by how the story was structured,but because they somehow managed to transform the dark and gritty source material of the comics into a flat-out comedy in the best way possible. What they tried to accomplish in 2h 10m really gave me a huge smile on my face. Oh,and also because we're talking about Thor,which movie-wise,was kind of decent as a franchise (quite frankly). Don't get me wrong,i loved it,but there are some problems with the story. If you already saw The LEGO Movie,well,get ready,because there are so many jokes in this movie that at some point you won't even remember that you smiled. Another problem is Hela. While being excellently played by Cate Blanchett,i was almost going to call her Mrs. Exposition,given the fact that in some scenes it'll be just like The Mummy (2017),where you'll see stuff that sets-up something for another movie.", "The humor,as i said,was really great all around,and there wasn't a moment where i rolled my eyes or got bored with it. It was some solid humor all along. When the action kicked in,i was amazed by how those were choreographed actor-wise and created effects-wise. You even get to hear The Immigrant Song,which was used in the trailers as part of the \"Hype Engine\".", "And it was satisfying to see some actors (like Chris Hensworth and Mark Ruffalo) actually breath some fresh air (not the serious fresh air of the comics).", "So in the end,if you wanted to see a comedy that is really good and not The House or Rough Night,then this is the right movie. Thor Ragnarok deftly pays off itself with a great (mind-blowing for me) story,some funny hints at humor and some of the (not really) best action scenes of the year. And all of this comes out from a Thor movie,so i'm impressed."]},
{"content": [" "], "expanded_content": ["The short review: Starting wonderfully with surprising cameos, links to other Marvel Cinematic Universe (MCU) characters, and a great Infinity Stone-esque reveal, the film peaked at the Thor vs Hulk fight (not a spoiler) in the middle and did not rise any higher in the final act.", "Related media: I have seen all of the MCU films, but felt that the Thor films were never great. Thor was 3/5 and Thor 2 was 4/5.", "What's it like?: Packed with surprising things, was very funny, but the final act was sort of OK, not great.", "Pros: 1) The best part of the film was the Thor vs Hulk fight, particularly the part where Thor has to rediscover himself. 2) The film is super funny.", "3) The film started well with surprising cameos, links to other MCU characters and a great Infinity Stones-esque reveal.", "Cons: 1) The final act wasn’t as sharp, doesn’t completely make sense and wasn’t as funny. This seems to be typical of Thor films where the directors run out of ideas at some point in the films.", "2) Karl Urban’s character, Skurge, was poorly written and poorly acted.", "How would the the different age groups rate it?", "Children: (not rated for children)", "Teens: Average: Excellent", "Young adults: Excellent", "Medium age adults: Good", "Old adults: Good", "Rating: 4/5 (no half scores). It's worthwhile to pay to watch it in the cinema."]},
{"content": [" "], "expanded_content": ["amazing movie with epic fights and perfect cast... thor is finally badass god like characters and fight scenes are amazing. Really enjoyable movie. And as the last comic book based movie for this year it was awesome... so next year again MCU cant wait"]},
{"content": [" "], "expanded_content": ["Thor – and Hulk after a certain amount of years since Age of Ultron's release to theaters – returns yet again with their latest Marvel adventure that Marvel Studios has bought for us. I won't – scratch that, I meant to say can't bother to say that this may be disappointing because it actually isn't in the movie's inner core heart. Fun enough to actually be called a new adventure that features lovable characters that gets treated as much as the plot actually does to make the movie feel brand new."]},
{"content": [" "], "expanded_content": ["Cheap comedy with no real substance. Feeled walking outta a stand up comedy rather than a superhero action drama. But still best Thor movie till date. This movie adds to trash Guardians of Galaxy 2 came with. Captain America Winter Soldier still remains the beat MCU movie till date."]},
{"content": [" "], "expanded_content": ["Not bad by any means, it's still a satisfying conclusion to such a disappointing Trilogy. It's better than other awful 2 first movies. The comedy is good, better than Vol 2, which proves Waititi needs to direct GOTG Vol 3 instead of James Gunn again.", "Thor & Hulk have their best performances yet, Loki still shines. Valkyrie is break-out. However Hela is overhyped even though she's fine.", "The movie smashes Planet Hulk & some bits of Ragnarok into each other in a Jack Kirby-ized movie. It's messy in some parts as well.", "Overall, Finally a Good Thor movie but still Overhyped and Overrated. 8 / 10 (CBM Fan-Service)", "4 / 10 (Cinematic View)"]},
{"content": [" "], "expanded_content": ["This might be the absolute worst movie I have seen since Star Wars Episode 2. Never have I seen a company or owner of an intellectual property treat not only the product this badly, but to treat its fanbase like this is astonishing. Marvel took the last decade or so of these movies we've watched and flush them down the toilet with this abomination.", "Nothing works in this movie, not within the confines of the movie, not within the confines of the narrative of the MCU. When did Thor turn into a stuttering, unsure dork? Why is Bruce Banner suddenly the stereotype of a Jewish guy from Queens? Did every single line have to be humor? Why did this thing have to exist!! It makes zero sense from start to finish. The end of Asgard was a foreboding moment in the age of ultron, one the audience knew to look forward to because of the Epic moments to come. RAGNAROK!!! We instead got campy Flash Gordon with a huge budget. I hated this movie with every fiber in my being. I feel betrayed as a fan of these movies. This epic narrative these movies have been building to is gone with this abortion. It's one thing to poke fun at yourself, it's another thing entirely when you poke fun at EVERYTHING you've done. Thor Ragnarok just unwound this entire franchise for me. The humor was forced, the \"effects\" were bad (The Hela fights were laughably bad. Like Matrix Reloaded bad). The Odin moment was god awful as was the Jane breakup. I don't say this often, but spare yourselves, don't go see this. Easily in my top five worst movies of all time."]},
{"content": [" "], "expanded_content": ["The only thing that saves this movie is the last 20 minutes because these things are taken seriously and you are left wanting to see what happens afterwards (I felt the desire to see Infinity War). If it were not for this the film would be bad for: Hulk and Valkyrie inescesarios (they contribute almost nothing to the plot), Hela appears little, the cameos did not like me, Loki very out of place making jokes, the music also out of place, many unnecessary jokes that ruin moments and CGI half fart. Even so, the movie can be seen and, as I said, the last half hour is full of action."]},
{"content": [" "], "expanded_content": ["Those who love Nordic folklore will not enjoy the latest Thor much. I imagine they will feel it borderline sacrilegious. They should keep in mind that this is a Marvel comic books production with profit in mind.", "Thor is essentially a comedy with fantastical characters. In its favour, it is much much funnier than 99% of the comedies we've been forced to endure the last number of years. It's a tremendous spectacle with heaps and heaps of CGI , cosplay and in jokes. It doesn't take itself too seriously and that works here. The focus is on laughs and special effects. Purists will bleat but I think the die is cast for Thor . Jeff Goldblum's very funny comic side is on show here and will be a permanent feature for sure."]},
{"content": [" "], "expanded_content": ["Taika Waititi takes Thor in a bold new direction that completely redefines the character. A smart move as his previous two movies have been among the most divisive in the MCU. What we end up with is more Guardians of the Galaxy than god of thunder. Only drenched in 80's neon flair and with a taste for heavy metal.", "The action is stellar and the sense of humor is the funniest this cinematic universe has had thus far. Waititi proves to not only be more hilarious than Gunn, but more imaginative as well. Ragnarok takes us to surprising new corners of the MCU. Every time I think the world of these heroes can't get any bigger another movie comes out that proves me wrong. Thor 3 is yet another example of that. The expansion on the Asgardian mythology is equally as impressive.", "The latest events Thor finds himself mixed up in are a lot of fun and filled with memorable characters. Ragnarok has a great villain in Cate Blanchett. Hela? More like hella cute. Tessa Thompson is no slouch either. This movie has the baddest women in superhero history onscreen. The brotherly love and rivalry between Thor and Loki is just as compelling as ever even if it feels like some ground is just being retreaded. What did they do to my boy Heimdall? Elba looking all old almost made me question if he is actually the sexiest man alive. Almost. Kudos to the movie for trimming some of the fat character-wise in the Thor trilogy. I mean, it adds it back on by the end but at least the new guys are much more interesting. Can't forget Karl Urban. So underappreciated as an actor.", "This is simply an absolute blast of a movie. Kudos to Marvel, Disney, and Waititi for actually bringing some change to the MCU and for finally doing something significant with the Hulk after leaving him in a sort of lame limbo since Incredible back in 2008. It only took them nine freaking years. Ragnarok stands out as the most original feeling entry to date. It's all so boldly done and stylish to boot.", "9.2/10"]},
{"content": [" "], "expanded_content": ["This is a movie that's not afraid itself lightly, which definitely allows it to hit some of the most organic comedic notes in the entire MCU. I think the biggest plus in this movie was the pacing; the story isn't much better than \"a'ight\" on the whole, but I'm actually surprised in hindsight at how smoothly it breezed from the titles to the credits... The ups and downs are there, but with none of the jarring feeling that often happens with these movies.It's like the cinematic equivalent of being on a rollercoaster at zero G (in a good way.) It's also got some inventiveness to it in the third act—or maybe it was pulled from the comics, I don't know. Oh, and it has just the right Goldilocks level of Jeff Goldblum.   On the minus side, not crazy about Loki's character arc. Also, I'm guessing I'll need another couple movies before I can understand how this one has any meaningful impact on the wider MCU, besides the fact that Hulk can talk now."]},
{"content": [" "], "expanded_content": ["It's rarely often that the sequel is better than the first film, let alone the third installment, but 'Ragnarok' is a pleasant exception of \"three is the charm\". Its emphasis on humour dilutes the melodrama that accompanies fantasy movies whose main characters have a British accent, and instead places more support on the fantastic chemistry between Chris Hemsworth and Tom Middleton, who is always the breakout whenever he gets a chance to play Loki. It also has a more dynamic villain and an ending without a ex machina that saves the day. The ending leaves as much doubt as it does hope. For a more comical entry, it also packs a heavier dramatic punch that first two."]},
{"content": ["It takes time to adjust to \"Thor: Ragnarok\"'s whimsical plot and humour, but once the zaniness settles, it's an entertaining and genuinely hilarious ride."], "expanded_content": []},
{"content": ["Funny from start to finish. Doesnt take itself too seriously, lots of kick arse action and a super battle scene between two huge Marvel characters. Also add in a superb sound track, with many of its songs now part of my weight workouts."], "expanded_content": []},
{"content": ["One Of Marvel's Funniest", "Who Would've Thought That A 3rd Thor Would Be A HUGE Improvement On The First Two!?"], "expanded_content": []},
{"content": ["This movie is way better than other 2. I loved it. Amazing writing and Planning and plotting was so clear. Heads off to 'HELA'. She is damn good."], "expanded_content": []},
{"content": ["the best of a group of very solid Marvel movies. Witty, fun and clever. The ending was kind of rushed but the film is well worth the hype"], "expanded_content": []},
{"content": [" "], "expanded_content": ["Thor has got to be one of the least interesting Avenger (well maybe on the same level as Hawkeye) and his movies aren't exactly memorable with his second entry being one of the worst MCU movies. This third entry decides to take a vastly different approach and it works. Director Taika Waititi puts a lot more comedy into this movie and adds a lot more comedic personality to Thor. This really makes the movie a very enjoyable watch and some great moments.", "The plot is relatively simple in the fact that because of Loki taking over Asgard it has resulted in Hela a new threat trying to take over Asgard. Thor is sent to the other side of the universe and now has to rush back to Asgard to prevent Ragnarok. While many synopsis of the plot and even the title itself makes it seem like the stakes are really high. However, in the film it never really does amount to anything and watching it you don't feel like there is really any stakes at all. This is especially because of the fact that this movie is much more comedic and can be a bit jarring. You could go from Hela murdering people to a fun moment with Thor and it makes the plot not seem that important. The characters are great and fun to watch. Thor now has a much more lively personality compared to previous entries and there are some moments where we see more of his character. Still only \"some\" which is really weird considering the fact that his home is about to be destroyed and he isn't as panic as we think he should be. Chris Hemsworth is still a great Thor and while this movie does feel like more of Chris's personality than Thor it still feels natural and gives a much more fun movie to watch. Loki returns and is treated much more of a joke in this movie which leads to some great laughs but you remember that he was the threat that led to the Avengers to Assemble in the first place. Still he does have a pretty interesting character arc in this story and it works quite well with Tom Hiddleston still being an amazing Loki even for the laughs. Hela is the villain of this movie played by Cate Blancett and is the first true female MCU villain. Sadly, just like most MCU movie villains she is rather forgettable and underused. She only has one really cool scene and then is just typical villain of the day which is a shame as there was potential.The stand out of this movie is Valkyrie played by Tessa Thompson who is an amazing badass character and Hulk played by Mark Ruffalo. Valkyrie has a lot of great cool action moments and Hulk just steals the scene every time and since he can speak this time it leads to great moments between him and Thor. Though Hulk isn't in this movie for as long as you think he is which is a shame but understandable since this is a Thor movie still. Jeff Goldblum is the grandmaster with a lively personality and is great in every scene he is in and Karl as Skurge is pretty good as well with his own believable character arc though a relatively small role. Taika Waititi the director as Korg was also very funny as well. The best part of this movie is the amount of colour and design that goes into the sets. Clearly this movie took a lot of inspiration from Guardians of the Galaxy and it definitely shows, They both explore the cosmic side of the MCU and are much more focus on the comedy. The design of the sets though have a Jack Kirby feel to it and that is very fitting for the planet of Sakaar. The action scenes are also very good especially the Thor vs Hulk fight with its great choreography and comedic timing. The action scenes are much more memorable then Spiderman Homecoming and are much more enjoyable to watch in my opinion. The score while not super memorable, still does its job and led zeppelin \"immigrant song\" is a great song.", "Some critics say this movie sets a new standard for the MCU and I honestly don't agree with it. I think this is a really good movie and is most definitely the best Thor movie. However, it does have the feeling of a typical MCU movie. It takes many tropes that have happened in the MCU and amplifies it. This really worked for the movie and creates an enjoyable experience for us. This movie is what we loved about the MCU and that is why it was such a good movie. The fault for this movie is that it doesn't really go in a new direction and still has the common flaws of a MCU movie. Still, if you liked many of the MCU movies then you are going to really love this movie as it feels like a love letter to us fans."]},
{"content": [" "], "expanded_content": ["just bought the blue ray of Thor Ragnarok. I've been waiting month to watch this for a second time and I've come to the realization that, it's \"perfect\" for me at least, heres why...", "The good", "Damn near everything. It's so **** sci-fi and Metal! When I go looking for sci-fi stories this is what I'm after. A heroic tale, magic powers and space ships, an epic adventure, topped off with fun an interesting characters. Sprinkle on some emotional impact and you have my ideal sci-fi experience. TR had all those things plus amazing fight scenes, tons of humor, and visuals that were so GOD-DAMN beautiful each still could have been a painting. I mean Hole-ee **** do I need an art book of this **** movie! The women were so bad ass and I have to mention the guns on Tessa Thompson. She was Jack'd! and I mean that in the best way possible. This is going to get long if I talk about how great each individual character is so let me just say they range from good to great. Goldbloom was exceptional tho, had to be said. I think I covered everything. It's **** perfect. What more could anyone possibly **** want. I mean if you find yourself wanting after seeing this then you're just a greedy little **** and you should **** off some where and let people enjoy this perfect **** movie starring the perfect **** Tessa Thompson. Just go **** yourself, seriously...", "...", "...there is one thing...", "The bad", "The CG on the hulk was a bit wonky. Barley noticeable , but after seeing what they did with those damn dirty apes I expect more.", "The ugly", "There is none, **** off! This movie is **** perfect."]},
{"content": [" "], "expanded_content": ["Thor: Ragnarok: After the last film Left Loki (Tom Hiddleston) in charge of Asgard disguised as his father Odin (Anthony Hopkins) whom he trapped on earth, Thor comes home to set things right. Thor (Chris Hemsworth) then finds out he has an older sister Hela (Cate Blanchett) who is the vying for the throne. Can Thor stop the usurper, take his place as the rightful heir and save Asgard from Ragnarok a prophesied destruction of both Asgard and all the old gods?", "The Good: Pretty much everything. Looking at the above synopsis one can easily imagine a dour grey family drama with lightning. (Heck one doesn’t have to imagine it just watch Thor the Dark World again.) Instead, we have a joyful, colorful action-packed film that is easily the most fun I have had watching a movie in a long time. It is pure joy. Too many things are perfect but a shout out to the use of Led Zepplin’s Immigrant Song and director Taika Waititi as super friendly rock monster Korg.", "The Bad: Nothing. Seriously nothing. Okay fine the use of Willy Wonka and the Chocolate Factory’s Pure Imagination is a little on the nose. There is also a realization while watching that not enough films have Jeff Goldblum in them… does that count as a negative?", "In Conclusion: Thor Ragnarok is simply the most fun I had at the movies this year. Dunkirk is a slightly better film and there are certainly more “important” films out there but this was pure joy. Imagine a comic book movie that felt like reading a comic book. What will they think of next?"]},
{"content": ["Thor: Ragnarok was a blast. This is now one of my favorite MCU movies. Also probably the funniest. Sorry, Guardians of the Galaxy."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Thor: Ragnarok reinvents the Asgardian God in a way that by the end of this film, he became from one of my least favorite Avengers to one of my favorites. This film simply focuses much more on him, his powers and the comedic talents of its star, which, combined with the dazzling visuals, the killer soundtrack and the powerful supporting cast leads to a nearly perfect superhero adventure."]},
{"content": ["I was confused. Is this an action super hero movie or a comedy? Pfftt. The makers of this film should read comics first, they're literally giving Marvel a makeover, from an action comics to comedic. SMH."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Any sense of drama or suspense is sacrificed for the sake of the joke. Thor Ragnarok weaves together two almost completely unrelated plots, The Contest of Champions and Ragnarok. The movie dwells on the Contest of Champions subplot for so long that the imposing doom of Asgard isn't developed or taken seriously. Jokes are predictable, the movie serves very little point as far as plot, and characterization of people like Thor and Bruce Banner are lost to comedic clowns. Thor Ragnarok is a light-hearted fun time if you don't think about it too much, but really it's just forgettable. Thor isn't a terrible movie, but it's not good either."]},
{"content": [" "], "expanded_content": ["Thor Ragnarok is another reinvention for the franchise and in most parts, it succeeds quite well. Who would have thought that hiring a comedy director would do wonder to this franchise. Watiti brought in his zany sense of humor to the film, and along with Chris Hemsworth newly found comedic 'talents', made Thor Ragnarok a fun flick.  Kudos of course should be given to its stellar supporting casts, the usual suspects such as Hiddleston and Rufallo, but also 'newcomers' Tessa Thompson and Cate Blanchett. Biggest weakness? Well, its orientation toward comedy is a double edged sword, lessening the seriousness of some of its set pieces.  Other than that, it's business as usual for the MCU."]},
{"content": [" "], "expanded_content": ["Currently Marvel comic sales are in the tank.  And while there are many fingers to point at the reason, for the most part it seems that the Marvel Universe as a whole has become dull and boring...  Then we have the Marvel Cinematic Universe (MCU).  If you needed any thought on how to fix Marvel, this is it.  Funny, witty, unique...  And a original universe/telling of events in itself.  I like to think of the MCU as a well needed/deserved reboot (multiverse) of Marvel as a whole.  And while there have been some flops along the way (Spiderman...  *cough*).  This is one of the movies that is a MUST if you enjoy Marvel at all.  I could go on a long rant about the pure bliss it was to watch this movie...  However you should just freakin' see it.  It is AMAZING!"]},
{"content": [" "], "expanded_content": ["Wow... All I have to say is that this movie is splendid. It is easily the best MCU film to date. It features plenty of action and an awesome storyline. It also has a different tone from the previous Thor movies, in which it is lighter whereas the previous Thor movies are darker. I also liked the music used for this film. Thumbs up for this movie!"]},
{"content": [" "], "expanded_content": ["Eureka!, a shrewd filmmaker gives Thor what he deserves.  Just like Luke Skywalker, Odin is still off the Asgardian radar. While Thor and his fallacious stepbrother Loki move to Earth to discover the whereabouts of their father, Hela, their cruel (step)sister, a powerful goddess, rises up from the ashes of the past to send, by force, the pair of brothers to Sakaar, a planet ruled under the jolly way of acting of the Grandmaster, in order to get the throne of his former nation, Ragnarok. To address this, He will face a staggered succession of mishap without his legendary hammer, making use exclusively of his worldly abilities and picking up on the way an irreverent and irregular group of allies who crave, from the deepest part of their hearts, to eliminate vile Goddess of Death before it is too late. Narratively, \"Ragnarok\" possesses heroic avant-garde conjunctures, such as introducing the very first bisexual character within this mega-franchise, fencing two characters in the same Roman war area, playing with more than one antagonist in the same plot, going for broke to cut main hero's powerful blonde long hair, changing abruptly settings by amusingly ordinary circumstances that are poured into utopian and fantastic molds as the coexistence of our stouthearted superhero with a sour-faced roomie into a galactic apartment for a few days, holding dear really the possibilities that comic books have and hundreds more that enable the feature film to differentiate itself radially from the multitude of film genres Marvel Studios has managed to run.", "Perhaps most of the spectators don't agree with my perception, but, in personal terms, visual imagery and artistic work exhibited in the film did not impress me as I expected.Marvel has assumed the hard task of distinguishing, thoroughly, every of its film ideas in any of the work fields, either frictions lying in the lexicon of characters, the distinctive nature of them, the film genre or the artistic scenarios that serve as a home for the stories. \"Ragnarok\" was advertised as a deluge of colors and hilarious events — both in its narrative strangeness and its splendor in film execution — never seen before; the posters have been one of the best among the competition and the trailers had a high expectation, in fact, this was fulfilled, however, it worked as a desired allergen for me. In short: \"Thor: Ragnarok\" is like eating up your favorite candies without any limit, after an hour, you're terribly cloyed. Color saturation, paraphernalia and spectacularity attempt to fill a lack of real new landscapes, imaginations that are absent, bombarding with color and artistic eccentricities to excess. Analyzing the sound condition, the feature film seems to have been produced by a mix of talents between Edgar Wright, James Gunn, and Mark Mothersbaugh. Under a prominent influence of classic hits of yesteryear, Waititi's movie promised great things in regard to the original motion picture soundtrack, including, as a starter, no more no less, that Led Zeppelin's revolutionary \"Immigrant Song\" as a fundamental music accompaniment at the first official trailer, a song that also mean a key point in the closing colossal bout. Garnished by compositions created explicitly for the film, the flick switch between classics and proper musical creations at a good pace, it ranks third in the top list of the best scores in the MCU, a merit achieved even though when they aren't entirely original sounds.", "No doubt, the main cause of the triumphant revival of Thor is thanks to this funny filmmaker— an adjective justly gained. Sinewy God of Thunder has passed through the hands of Kenneth Branagh  and Alan Taylor , however, neither of the two didn't get the opportunity to draw forth his potential in all its splendor, a flaw faded only until the nifty and creative vis comica of the New Zealander emerged as a genuine elixir of life to the character. Without fear of being mistaken, in the marrow of every fascinating feature is this proficient director, his diversity of ideas is absolutely comedic and his film determinations fit in the profile he desires for his projects with great diligence. By dint of a sharp, irreverent and daring perspective, this man has raised a pic of interesting properties, with a heart and a dramatic weight that exceeds in size and visual quality the creative display.", "In sum, \"Thor: Ragnarok\" can be synthesized adequately in a brief and exciting name: Taika Waititi— of course, not downplaying the fabulous work done by the different areas of the film. Hilarious, visually oppressive and entertaining, Marvel Studios remains high on its prestige as it prepares for a wave of spasmodic and challenging releases, Among which stand out its very first motion picture starring an entirely black cast, its film with a female in the stellar role and the mega-event that will mean \"Infinity War\" when arrives our hearts in May 2018."]},
{"content": ["Nothing groundbreaking as far as the Marvel movies go, but a very funny comedy in line with director Taika Watiti's other works. Very strong characterization and visuals to boot."], "expanded_content": []},
{"content": [" "], "expanded_content": ["OK, I first want to say that this movie was funny. I did laugh in the theaters as I saw it. So if you are looking for pure laughs and just a chance to see some old characters again the movie is fine. All the director wanted to do was make people laugh and he achieves that. Its a weak goal for a superhero movie, but I give him the credit he did what he set out to do. This movie is funny and that's where it ends.", "I love the MCU and had such high hopes for this film, Thor's story (not necessarily movies) is one of my favorites in the MCU.  I thought that Ragnarok would take us on an epic journey to save the fate of the Nine Realms, but it did not.", "Ragnarok has entirely too many jokes for something about the end of the world. Ragnarok refuses to take the event or the characters seriously. There are so many emotional moments that need to happen in this movie that don't happen.", "SPOILERS:", "During the death of major characters there is hardly any emotional response from Thor or Loki or the people of Asgard as a whole. The forced relationship between the villain and Thor and Loki is unnecessary, Hela did not have to be their sibling. It could have easily been that she was a rogue warrior, Odin's first wife or even Odin's sister. The fact that they make her Thor and Loki's sister undercuts the relationship between Thor and Loki. The heart of the Thor story is the bond of brothers having Hela come out of nowhere just doesn't add to the development of the main relationship in the Thor arch which is Thor and Loki. She is a good villain though, but she doesn't need to be related. It's forced for shock value. Then it comes down to the biggest issue I have with the movie is the complete lack of development of Characters.  Thor's character has regressed.  He was supposed to become wiser, but he's actually become quite dumb.  He was supposed to become stronger, but he's actually become quite weak... he can't hold his own against the villain and instead of gain strength and confidence he actually becomes weaker. He is no threat to the villain and the villain knows it. He can't save his people and he knows it.  That is rather disappointing for a hero. Also Loki's character, one of the most compelling characters in the MCU who had a beautiful arc gets watered down. His powers, intelligence and personality get watered down. I wanted a cathartic moment between Thor and Loki when they reveal that they need each other and miss each other, but instead everything is played for laughs. Loki's character never had to make a choice to do the right thing... we don't see motivation or the sympathetic emotions that make this character so well loved. The movie is funny, but its no substance. I miss the old characterizations. I miss the poignant emotional moments that Thor and Loki's relationship offered. But the director got what he wanted he made me laugh in theaters and then when I left he made me cry."]},
{"content": [" "], "expanded_content": ["The tone of Thor: Ragnarok was not as serious as its title may lead you to believe, but don’t let that stop you from seeing a great fun filled adventure.  I’ve seen all the marvel movies so far, with this latest Thor entry coming across as one of the funniest ones yet.    I knew going into this it was going to have a comedic flair to it with Director Taika Waititi at the helm.  Chris Hemsworth’s interpretation of Thor in this was the best one yet. Not only was he funny and likable, but he finally felt like the God of Thunder!  This movie had some really great CGI fight scenes.  Not only was Chris great, but he was complimented by a great cast. Tessa Thompson, Mark Ruffalo, Jeff Goldblum, and Kate Blanchett all gave great performances.    My only critique with the film is that because it went for a fun vibe that some serious moments did not feel as impactful due to the tonal shifts. All in all that did not hinder the film for me and I recommend it to all Marvel Fans or those looking for a not to serious action adventure."]},
{"content": [" "], "expanded_content": ["In the comics, Ragnarok killed every Asgardian, including Thor, and he was gone for years from the comics. The darkest story in Thor's history.", "So of course Marvel Studios makes it a comedy.", "There is nothing to this movie but jokes. It's quips, pratfall, anus jokes, Hela's kind of lame, Hulk and Thor are a comedy duo. And Thor helps Loki bring Surtur to Asgard so he can destroy it. Let me repeat that in case I wasn't clear. THOR HELPS DESTROY ASGARD AT THE END.", "It's just so bad.", "Some of the action was really good, but the forced humor didn't work in this movie.", "At least Marvel Studios has finally admitted that comedy is their main focus.", "Getting stellar reviews, of course. Because critics love the MCU and will just pretend they're masterpieces when they're not. This movie was terrible.", "Critics call it \"FUUUUNNNN\". But it was just lame.", "I wish I would have saved my money, or burned it. At least if I burned it I still would have wasted money but I wouldn't have sat through this.", "It sets the final stage for Infinity War, which is going to be a bloated mess."]},
{"content": [" "], "expanded_content": ["Thor: Ragnarok finally gives the character of Thor something to do other than standing around and being overshadowed by his adopted brother. This movie is exciting, absurdly hilarious and visually stunning. The interactions between Thor and the Hulk are entertaining, while scenes including Bruce Banner give this movie some much needed emotional depth. Cate Blanchett shines in the role of Hela, mostly because of her amazing costume, which is just one of many amazing costumes.", "Now, this movie is not perfect. The stakes could have been higher and the creators could have created some more meaningful scenes by getting rid of some of the jokes in scenes that really didn't need them.", "All in all, this movie is great fun in a beautifully crafted world that looks like it came straight out of a comic book. While by no means perfect, I had a blast with this film and I am excited to see what's next for Thor. Heck, I never thought I'd say that. Well done Marvel, once again."]},
{"content": ["One of the year's worst films period. Bland CGI and poor action scenes. Cate Blanchett is the only good thing about the film. Huge let down, I hope they fire the director of this movie. Thor 1 and 2 were much better than this piece of trash."], "expanded_content": []},
{"content": ["This move is a joke, I really enjoy previously part but this one is completely rubish good for mop the floor. It is comedy or what?!. It's like converting Startrek in to The Orville series."], "expanded_content": []},
{"content": [" "], "expanded_content": ["I like heroes. Heroes become heroes because of the difficulty they had to overcome and the struggles they go through to achieve something greater for the benefit of others or save them. When the hero jokes all the time or when the movie has too many jokes, it's no longer heroic but comedic. Where is the emotional struggle, pain and finally exhilaration from the triumph in the end? This movie is too shallow for my liking."]},
{"content": [" "], "expanded_content": ["Best Marvel movie since Iron Man, it was a clear step up from Thor and Dark World. I never laughed harder in a move than I did when I saw this last night. Incredible cast, especially Jeff Goldbloom, Hulk and the beautiful Tessa Thompson. I also really liked Matt Damon's cameo, I hope to see him in future Marvel flicks."]},
{"content": [" "], "expanded_content": ["Yeeeeeeeeeeeeeees... Thor has made such a comeback that he has amazingly raised the bar for the entire MCU franchise Villainwise, herowise, storywise and even graphicwise. It looks amazing, it feels amazing and even sounds amazing. Thor ragnarok has successfully redeemed the Thor franchise by paying back for what happened in Thor 2. I love it"]},
{"content": [" "], "expanded_content": ["Probably the best Thor movie in the trilogy! Thor: Ragnarok is action packed, visually gorgeous, emotionally touching, and equally funny as Guardians Of The Galaxy. Every character is memorable and likable in a way. With a little bit of humor and fun, Thor: Ragnarok is unique and special. A blast for all the fans of the MCU and nice way to wrap up and conclude the Thor trilogy."]},
{"content": [" "], "expanded_content": ["I'll preface this review by admitting that I do have an odd sense of humor, so that is probably why Thor: Ragnarok was right up my ally since director Taika Waititi seems to have a similarly odd sense of humor.  It has a lot of very funny moments - some are fairly obvious that everyone in my theater laughed at, while others are a little more subtle and require that you've seen other MCU films as they take shots at and make of fun stuff from them, specifically Age of Ultron.  Chances are that if you enjoyed a lot of the \"off the cuff\" / kind of subtle humor present in the first Guardians of the Galaxy, chances are you are going to like Thor: Ragnarok.  At its heart, this is very much a buddy film (with Thor/Hulk and Thor/Loki), but that is part of what made it so enjoyable.  A lot of the best scenes are back and forths between these characters, but it does more to build on their relationships than a lot of the other \"solo\" character MCU films to date.  They were honestly the high point of the movie as it kind of tailed off as the story turned towards the ending (see below for my only complaints with the film).", "In terms of why I didn't give the movie a perfect score of 10 (it came close for me), I really had two main bones to pick with it so to speak.  1) Like a lot of other MCU films, most of the movie centers around the heroes so I can see some feeling this is yet another example of an MCU film not devoting enough time to build up a villain in Hela (played by Cate Blanchett) that otherwise had a lot of potential.", "2) I thought the ending seemed kind of abrupt and rushed.  As I've told friends and co-workers who've asked, part of that may have been the result of the fact that I was enjoying the rest of the movie so much that the ending might  have snuck up on me somewhat.  But there are some...what I'll call \"actions\" I guess taken by Hela (against some of Thor's allies) that I thought would've been better saved for the end as it would've made Thor's decision about how best to fight her carry more meaning.  I don't want to say too much more than that as it would take this review into spoiler territory.", "All in all I really enjoyed the movie and definitely recommend it to anyone that enjoys the MCU (even though it is not your standard superhero movie), and also anyone that is a fan of movies like the original Guardians of the Galaxy that are part space opera / part comedy.  I liked it enough that I would put it among my top 5 MCU films to date (with the first Iron Man, the first Avengers film, Captain America: Winter Solider, and the first Guardians of the Galaxy), though I do expect it will likely be surpassed when Black Panther (which is reminding me a lot of Winter Soldier) and Infinity War are released next year."]},
{"content": [" "], "expanded_content": ["I watched this film yesterday, I headed into the cinema not knowing what to expect, but I was blown away by this film. This is definitely my favourite MCU (Marvel Cinematic Universe) film, albeit for the two Guardians of the Galaxy films. The story kept me hooked, throughout the entire film and I never wanted to miss a moment of what was going on, due to the fast flowing motion of what was actually going on. The comedy in the film was fantastic, with plenty of jokes the entire cinema, full of both kids and adults, burst out laughing, although personally I did laugh out loud much more than anyone else. The action scenes in the film were very well written and I was in awe at the fantastic CGI. The inclusion of The Hulk was remarkable, as he had a much more important role than what I'd expect him to have from all the trailers I'd personally seen, and The Hulk was a very nice inclusion into the film. The lead villain, Hela, was one who I loved to hate and the fight scenes with her in were both intense and comedic. The film is a perfect lead up to the new Avengers Infinity War film coming out next year, and if that film manages to blend in comedy, action and story as well as this film did, we should all be very excited!"]},
{"content": [" "], "expanded_content": ["I think i'm getting tired of watching a disney movie when i go to the theater expecting a marvel movie, it seems the comedy is more important than the story itself, and everything has to be pg13 (teens and above) friendly, it is not a bad movie, but it should be so much more."]},
{"content": [" "], "expanded_content": ["This film was AMAZING. I don't want to spoil anything, but it was as fun as a movie like this can get. Amazing fighting scene, amazing actors, it is probably my favorite Marvel movie. Many unnecessary jokes, basically almost any \"epic\" moment was ruined by bad timing or something like that, to the point that you know the joke is coming and making it not as funny. Still, great movie.", "SPOILER: the only downside is that during the movie Thor is captured and is kept in check by a freaking... electric shock. At one point, he is literally emitting electricity from his body and he get knocked out by... Electricity. Coming out from a little chip on his neck. WTF. That was as stupid as a plot can get."]},
{"content": [" "], "expanded_content": ["Thor 3 is certainly the most interesting of all the Thor movies. The story is pretty good and it's a very funny one. Cate Blanchett makes an incredible villain. Idris has the more serious role. The FX complement the action and depicts complex areas. The action is also very strong and not too confusing. There is some weakest moments but there is always either humour or action that put it back on track. It's well edited and follow a good pace. The soundtrack is also not that bad. I give it a 75%. It's a nice change for a hero movie. Where was Sif ?"]},
{"content": [" "], "expanded_content": ["JordanRossReviews: Thor: Ragnarok– 7/10", "Rating: PG-13 | How to Watch: Theaters", "“A hilariously fun ride, that isn’t anything deeper.”", "I greatly enjoy the Marvel movies because of their balance. I’ve often admired how Marvel Studios has been able to take the seriousness of these fantasy stories and fuse them with the comedy of its characters and situations to find a perfect middle. Some are more serious than others and some more comedic, and you will find fans on either side of the spectrum. Thor: Ragnarok was not balanced. If you’re looking for a fun ride than look no further, but if what you’re after is an intriguing storyline, serious acting, or even some great battles then look elsewhere.", "Speaking of acting, I loved Cate Blanchett as Hela, but the threat of her character and overwhelming power never seemed serious. Obviously you can guess that the heroes will most likely win at the end of the day, but when you make it so blatant it really steals away the threat. When it came to the action I was let down as well. There were the start of some very good scenes, but none of them could stay serious for longer than thirty seconds, if they even managed that long without a one-liner or pokes at superhero tropes.", "The scenes where we did see the darker and grim side of events felt rushed and after thoughts, almost as if the director had to put them in, but only to get back to the humor. Once I found out Taika Waititi was the director, whose previous work includes What We Do in the Shadows it made a little more sense. It truly felt like one big joke, but if you like your comedy you’ll probably like this movie. If you’re a hardcore nerd who seriously debates who would win in a fight between Thor and Hulk, don’t get too excited. This film felt like a side story within the Marvel universe and one I hope that was meant to be the comic relief in the long line of more serious titles. A great comparison to make within the Marvel family would be that Thor: Ragnarok was the complete opposite of Logan. This film had jokes from the first line to the last. The serious fantasy and science-fiction fanboy part of me wanted to attack this movie, but even I can enjoy a pure laugh fest from time to time, as long as this doesn’t become the norm.", "FILM INFO:", "Genre: Action, Adventure, Comedy", "Directed By: Taika Waititi", "Written By: Eric Pearson, Craig Kyle, Christopher Yost", "Release: Nov. 3rd, 2017", "Runtime: 2h 10min", "Studio: Marvel"]},
{"content": [" "], "expanded_content": ["Is it better than the other Thor movies? Yes. But that doesn't mean much, believe me. Taika Waititi leaves some of his signature comedic touch, but it's clear that he doesn't have too much creative control over the movie which is a shame. At times Thor:Ragnarok seems a bit far-fetched and ridiculous. But,perhaps, my biggest problem with this movie is that it has a great tonal discrepancy. One side is filled with jokes and is light and the other part that is filled with death, destruction and it's supposed to be more serious. The movie bounces between these two surprisingly amateurish. That being said it's a step in the right direction...for the Thor franchise, that is."]},
{"content": [" "], "expanded_content": ["As a huge fan of most of the Marvel Cineverse that is worried about superhero fatigue, this take on Thor left me optimistic about the future. By far the best of the Thor movies (admittedly not that hard of a challenge), Waititi's Ragnarok has elevated Thor to the levels of Tony Stark and Starlord. Start the countdown to the lovefest that will be Infinity War!"]},
{"content": [" "], "expanded_content": ["Тор: Рагнарек- отличный и смешной фильм Мarvel. Хороший сюжет, отличные главные персонажи. Вот что плохо, так это опять слитый злодей! Теперь Тор это не фэнтези, а самая настоящая космоопера. Так же в фильме очень много смешных шуток, но иногда было неловко за шутки. Фильм отличный на который можно сходить с друзьями!"]},
{"content": ["AMazing movie with great effects, fast paced and a big, huge amount of comedy, i strongly suggest to watch it with the original alnguage + subtitles to avoid missing any joke"], "expanded_content": []},
{"content": [" "], "expanded_content": ["Thor Ragnarok is a fun, action packed exciting and hilarious film with a dramatic plot twist and climax incredible sound, graphics, and acting. It's stuffed with fresh new content, but not overstuffed, and it's certainly a movie to be passed along down the centuries as a classic."]},
{"content": [" "], "expanded_content": ["This will be a very polarizing film. Many will decry the amount of humour in it which is considerable.", "It was much like a parody of the other Thor films. A joke every 30 seconds mocking itself. The first half hr made me feel that way but fortunately it slowed down after awhile.", "A lot of the jokes fall flat .", "A lot of it is quite funny because Helmsworth and Hiddleston are funny guys.", "Even the hulk was cracking wise.", "It is a grand spectacle though with incredible visuals and the action is fantastic. Fight scenes are tremendous and Blanchett as Hela is tremendously evil.", "By the end of the film i was very satisfied and am going again today."]},
{"content": [" "], "expanded_content": ["Three years ago when Kevin Feige showed to the world all the films that would be part of the MCU's phase 3, he showed a dark logo for Thor: Ragnarok, a logo that was in line with the plot and the weight that that name represented, and he talk about what that name meant, but once Taika Waititi was on board they presented a new logo and the alarms went on.", "I am a comic book reader, I have been one since I was a kid so I know first hand how annoying the fanboys can be, how upsetting and pedantic they can be and I must emphasize that because here I'm talking about a movie, not a comic book, however it is still an adaptation and that should be taken into account.", "Thor: Ragnarok is a very different film to its predecessors, in every sense, especially in the tone and I must say, the tone is everything for this movie and I say it simply for a reason, that tone will cause many to love it but also many will hate for it.", "Thor: Ragnarok represents an advance and at the same time a setback for the MCU, after all, it's been almost 10 years and the fatigue of superheroe films will be more evident if the studio do not dare to take risks.", "Ragnarok represents a substantial change for the character and yet remains within the conformity that Marvel has nurtured in recent years. They already know their formula and it seem like they aren't willing to change it.", "As I said before, Ragnarok it's very different from its predecessors, now the focus of the story is centered on the adventure and the comedy, an irreverent tone that will divide the fans, after all many of them are expecting something darker and they aren't getting it.", "Taika Waititi manages to impose his personality as a filmmaker and in the process he also gives one to Thor who frankly never showed an evolution since we saw him for the first time. It's true that it tries to make him more humorous and it's not a bad thing but let's say that in that department Mark Ruffalo takes away the protagonism when he makes his appearance.", "Loki's reappearance is welcomed but unfortunately he feels more collateral than ever before on front of the rest of the characters because those who have the most attention are Thor, Hulk, Valkirie and Hela, played by Cate Blanchett who manages to create a very good villain, although it's due more to the enormous talent of Blanchett than to what the script provides for her.", "In the most strict sense, Ragnarok delivers what was asked of it and what it's offering, which is entertainment, a entertainment with action and doses of comedy that will undoubtedly be more than enough for any fan.", "The tone, the performances, the story, the production, the score, the effects, everything is first level and as I said it will be enough for anyone who continues enjoying these films without any objections, I'm also a comic book fan and I enjoy this movies a lot, nevertheless I also love movies and I must be analytical in that aspect.", "I don't really have arguments to say that Thor: Ragnarok is a bad movie and although it changes the face of the character, it does not change it to the Marvel franchise in general and that honestly as a comic book fan and a movie lover it bothers me, it bothers me when conformism has become the norm instead of the exception.", "I'm frustrated that Marvel does not want to innovate anymore and it's sad considering that although they did not bring superheroes to the movies, they do gave them another face, another level and they took a risk when nobody in Hollywood did it with those characters, that's what Marvel should do if they really want to continue for another ten years or beyond.", "I judge this film with more fierceness because it's the third MCU film this year and the other two did not move or change the formula at all, considering that we are less than eight months before the premiere of its greatest epic, the project they've been cooking for the last six years, indifference and complacency cannot be accepted as standard.", "Thor: Ragnarok is not a disappointment, it's not a bad movie, it's a fun, graceful and entertaining film, it's worth your time and it's even more if you've already have walked all the way of the MCU, it's a solid entrie, superior to its predecessors and I must say that currently it's the second best movie of Phase 3.", "Any day, go watch it, you'll have a great time."]},
{"content": [" "], "expanded_content": ["Thor - Ragnarok is one of those movies that you do not see every year. The third Thunder God movie brought a new gas and a new vision to Thor's films, managed to hit on several points with scenes and fantastic scenes and actors actress that fell perfectly in their characters. Thor - Ragnarok was able to reconcile and balance well the scenes of comedies and the dramatic moments the scenes in Sakaar were fantastic the scenarios although a little different from the BD they were perfect the scenes of comedies were good of more (In Sakaar they abused of the comic part) and framed in the perfect moment, throughout the film has several more jokes this does not disturb in the part more serious and in the moments of drama, if in Sakaar was fun in Asgard you feel something quite different a heavier climate with a good dramatic charge. The fight scenes are sensational and the effects were nicely worked Hulk VS Thor was fantastic an unparalleled fight the two battling yet swapping huge blows that make it vibrate with each hit. The scenes of Hela's fight are perfect, Hela (risk telling me that she is the best villain of the UCM) proved to be an overwhelming, deadly and cold force capable of great feats bathing Asgard in blood, it was unstoppable neither Thor, Valkyrie, Loki and others were a match for Hela. Valkyrie was a very well-developed character in the story you can rightly understand her story there in a way yet noticeable race has brought us strong and a powerful cream warrior. The film was very good but still has its low points more comprehensible as in the beginning the fact that we see Sutur as a primordial threat is more quickly forgotten throughout the film, but the motive should be at the end of the films for the purpose that he carries in order to everything else still should be used more."]},
{"content": [" "], "expanded_content": ["This is easily the best Thor movie and I loved the way they went for an action comedy this time. It made me laugh over and over. If you thought Antman was funny this tops it. Fun film that doesn't take itself seriously at all. A nice surprise! I give it a nine because I have been getting weary of superhero movies but loved this one."]},
{"content": [" "], "expanded_content": ["Thor: Ragnarok is an excellent Marvel movie. Its subtle humor and good action scenes never failed to deliver. Taika Waititi knows what he's doing, his genius is apparent all over the movie. So watch it and decide for yourself; maybe you won't be mind blown, but you'll definitely be more than satisfied."]},
{"content": [" "], "expanded_content": ["Marvel fans rejoice! Because Thor: Ragnorok is arguably one of the most fun MCU movies that you will ever enjoy than GOTG2 and the other Thor movies! If you are wondering why I said that, it’s because the smooth direction, clever humor, rockstar performances, and the dazzling visual effects of this movie is just upbeat to look at. As you watch this movie, you may encounter a minor issue that involves repetition, but overall, it still sounds good. Thor: Ragnorok is perhaps one of the best sequels that has more depth and humor than its predecessors. To be honest, as a diehard DC fanatic, I am excited what will Marvel Studios do to Infinity War in 2018."]},
{"content": ["Probably the best Thor movie so far: It's packed with action and has lots of hilarious & funny moments (although I felt that they went a bit overboard on the comedy stuff)"], "expanded_content": []},
{"content": ["This movie belongs to the top.Very great action and story. Everyone can enjoy this movie without a doubt. Solid 9/10 great job marvel. hehehehehehhehhehe"], "expanded_content": []},
{"content": [" "], "expanded_content": ["I went to watch waiting for a joke every minute, since, before the premiere, they emphasized too much the fact that the film was a comedy, a statement that was an exaggeration: the film is not even a joke and does not have all the humor ultraescrachado Guardians Galaxy, having been very well dosed and worked with the most diverse moments (action, humor, etc.).", "It is notably the film of the franchise that brings more serious (and seemingly irreversible) consequences and transformations for the character, who leaves the film properly valued and more \"dignified\" (especially if we consider his previous films). And the actor-protagonist has the one who is, shot, his best moment within the Marvel universe. It delights to see!", "Among many surprises, I highlight the performance of the talented Tessa Thompson. And this is doubly positive, because she took the role discredited by those who complained about climbing a black woman to do a valkyrie of the Norse mythology and ended up proving more than worthy to embody the character. She is an expressive actress, talented (to me, surprising) for humor (I did not expect her to do so well), to dialogue and to trickery, interacting very well with others. There's no getting around that cliché comment: she STOLE THE SCENE on several occasions.", "The rest of the cast is great too. I call attention to the muse Cate Blachett, charming and GODY in every way; for Tom Hiddleston / Loki, still being that mix of villain and anti-hero we love; and to the director himself, Taika Waititi, who, in addition to directing, played the excellent Korg, a stone giant who is a mix of simplicity, ingenuity and loyalty - perhaps my favorite character in the film.", "As an unconditional lover of the 80's, it may be unnecessary to say how much I LOVED the visual aesthetics (Flash Gordon, Jack Kirby, although this second reference is older) and the synth-pop soundtrack (made by the vocalist of Devo, a new wave band from that time). Palms to the director, who took all of this and tapped the blender, serving a delightful dish to otentistas like me.", "Another very positive point is that trailers and commercials have, for the most part, VARIOUS scenes that do not exist in the film (or, at most, present them at different angles, with different dialogs etc.), which shows that Marvel learned not to overexpose his lengths as he did with Ultron's Era. Soon, that prediction (mainly of haters) that \"who saw the trailers and commercials already watched the whole movie\" is very stuck here."]},
{"content": ["Hino sem precedentes;", "Hela dona, valquíria ícone, taika rei que ressuscitou o Thor.", "Enfim um filme muito bom, bom até demais vindo de um filme solo do Thor."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Good? Yes. Spectacular? Absolutely not. For what it is, Thor: Ragnarok is creative, funny, exciting, and entertaining... but it lacks the emotional resonance that the best superhero movies have. It has lots of likeable characters and a decent-enough story, but there's no real weight to anything that happens until the last 20 minutes. It's a fun, goofy blockbuster film to invite your friends over... but don't have your expectations up too high, m'kay?"]},
{"content": [" "], "expanded_content": ["I went into this movie with modest expectations due to the criticism from others about the comedy portion of the movie.  That said, I really liked this movie.  This is my favorite Thor movie so far.  They still are all seriously flawed.  I thought the comedy was done well.  There were some truly funny moments.  The good part of Thor is they allowed him to be Thor with his powers throughout the movie.  However, I was generous and subtracted only 1 star for taking Thor's hammer away from him for 95% of the movie.  This isn't a spoiler since they do this at the beginning.  Would it kill Hollywood to let Thor have his powers and his hammer during an entire movie?  If they do one day, it will become a Thor blockbuster movie.  I must say Cate Blanchett was spectacular as the main villain in the movie.  She should get an Oscar nod for this.  She looked like she enjoyed playing as Hela.  Minus one star for not having enough of her in the movie.  She won't get the Oscar nod since they didn't give her enough time in the movie.  They get a great villain and then underutilize her.  Shame on you Hollywood.", "Jeff Goldblum does another great job at the movies.  He was a lot of fun to watch as he ruled as supreme leader and Tessa Thompson was excellent as the brooding Valkyrie who needs her passion roused to find herself again.", "One day, I would like to see Marvel and Hollywood make a serious Thor movie.  Just recreate the story from one of the classic Thor comics and run with it.  Is it that hard to figure out how to draw Thor's legions of fans to the theaters over and over again???  I enjoyed this movie, but would not repeat while in the theaters.  And of course go see it at a genuine 70 mm IMAX theater if you want to truly be treated to a great movie experience!"]},
{"content": ["A very good movie. Not a great movie, but a very good one. It is funny, has great action, and has great characters, both returning and new characters. If you like Marvel I see no reason why you should not like Thor: Ragnarok."], "expanded_content": []},
{"content": [" "], "expanded_content": ["I always base my reviews on how much fun I had compared to what I was expecting. In the case of Thor's part of the MCU I was expecting another in the style similar to his first two movies; Serious subject matter with humour provided by or at the expense of Loki. This felt more like Guardians of the Galaxy taking place in Asgaard. It's not necessarily a bad thing, I still had a lot of fun, but it wasn't what I was expecting from this movie so I was slightly let down."]},
{"content": [" "], "expanded_content": ["Thor Ragnarok is a silly popcorn summer movie (that came out in the fall...kinda weird).  Anyways, THAT is exactly the problem with the movie.  Thor is NOT supposed to be funny and yet they have him cracking Arnold Swartzenegger like jokes right and left and in TOTALLY inappropriate times.  Bad guy talking about destroying your whole planet and ALL of you people...crack a joke!  Also apparently you can defeat Thor with a Taser.  So guess he's not to super after all.  That doesn't even make sense!  He's the \"god of thunder\" (IE ELECTRICITY) and yet he can't survive a taser?  It has some fun parts and the fight with Hulk is entertaining.  But it's merely an average movie.  Not bad, but not particularly good either."]},
{"content": [" "], "expanded_content": ["If you enjoy most Marvel movies, then you should find this movie entertaining and worth your money. If you're like me and generally believe every super hero movie is a failure except the Dark Knight trilogy, then don't see this movie. Like all super hero movies nowadays, it features a new villain that is hell-bent on taking over the universe, while recycling older side characters from previous films in the Marvel universe to aid the protagonist. Some of the cameos in the film (both by actors and characters) are quite nice and funny, others are awkward (as performances). Also, the whole act where the super hero acts like he doesn't really care and just jokes around is getting a bit overplayed, and when done in this movie it made me cringe on several different occasions. The movie featured some humorous moments that I thought were well done, but they don't make up for the overused plot, average acting, and underwhelming effects (the effects were what I was most disappointed in). Overall it wasn't worth the money to me."]},
{"content": ["Far too much lame attempts at humour. Really detracted from the drama of the plight and destruction of Asgard. This was not a film I would want to see again."], "expanded_content": []},
{"content": [" "], "expanded_content": ["It was a pretty funny movie, missing some action opportunities. The one thing that made him Thor was the Shakespearean way that he talked. That was not found in this movie.Sure it's better then the rest, but not great. There's no point of where you could relate to what he's going through since they put a joke on everything. It's a good one time movie."]},
{"content": [" "], "expanded_content": ["A fun super hero movie, but there are too many jokes. Way too many jokes. There are moments where named characters die and where cities are destroyed, and those moments are immediately followed up with a one-line quip. The humor was actually pretty good, but it is so jarring to have emotion/tension filled moments just immediately under-cut with jokes that make light of character deaths. I always liked that Thor was more of the straight man in the Avengers, but this time around he's playing for a laugh in every scene. I liked Cate Blanchett's villain, and her backstory was interesting, but her motivation was just as bland as every other villain these days. She hints at some interesting stuff about Asgard white-washing its history to hide the past cruelties, but that never creates any conflict between Thor and Odin/Loki. Jeff Goldblum's character was fun but underused, Tessa Thompson was good but underused. I just feel like if the movie had gone for a bit more heart and a bit less comedy then this could have been another Iron Man."]},
{"content": [" "], "expanded_content": ["This movie is by far the best of the Thor trilogy. Taika Waititi (Director) truly worked his magic on this film. Thor's newfound Humour and the Humour that is displayed generally throughout the film will make and have made everyone who watches laugh and enjoy the film. From world to world as the plot thickens, this film will entertain all who watch. With great humour, an awesome plot, awe-inspiring action and an overall enthralling adventure, Thor: Ragnarok is concludingly the best film of the Thor series and personally my favourite Marvel film to date."]},
{"content": [" "], "expanded_content": ["What a blast! The movie was extremely exciting and all around a great time. The movie is colorful and full of life with all the environments and locations. The action set pieces are some of the best in Marvel movies to date and sets a new standard for Marvel movies. The acting was super as always and chemistry with everyone involved. The movie was one of the funniest marvel movies and they just know how to keep making us laugh with over the top comedic scenes. One of the best marvel films to date!"]},
{"content": [" "], "expanded_content": ["I guess everything Marvel is a joke now. It wouldn't kill them to take a serious or emotional moment for once. I hated Gardians 1 and 2 because it tried way to damn hard to be funny. This movie did the same but not as bad. It was a good movie but had so many problems. Like how is he getting knocked out by tasers when he has lightning coming out of his body. Why is Valkyrie bi-racial. I kinda picture that woman who plays Ragnar's wife from Vikings as the perfect cast but no everything as to be multicultural now. Isn't that just as bad as white washing or cultural appropriation? It didn't bother me that much but she has the cliche snobby tough girl attitude and she just wasn't likable at all. Kate Blanchette was great but tried to be too seductive all the time, always cocking her head to the side trying to look cute. I don't know thought, I should get a more Norse - Viking feel from Asgardians, not this forced multicultural cast. To be fair, I'm not a hypocrite. I won't watch Gods of Egypt because they got a Scottish and Danish guy as the two stars. Also Call of Duty lets you be a black female nazi soldier in multiplayer. This is getting out of hand."]},
{"content": [" "], "expanded_content": ["I am quite disappointed by this movie. I've always thought that Marvel has dropped the ball with Thor and his lore. He is probably one of the greatest characters that Marvel has ever created, in terms of personality, the lore surrounding him, etc. Asgard and the nine realms is an incredible pool of possibility, but what does Marvel do? They squander it.", "None of the Thor movies have ever been spectacular. The first Thor movie was, in my opinion, the best because it explored Thor as a character, who went from overly cocky to becoming a humble protagonist. I loved this part of his development. It really made for a compelling character who one would want to believe in. I won't talk about the second movie because it really didn't do anything for the character, but as for Thor: Ragnarok...", "Marvel decided to go in an entirely new direction with Thor this time around, giving him a comedic, **** attitude. Wow, does that really suck. With this joke-a-minute format, all of the emotion is stripped from this movie. Scenes that should be extremely, EXTREMELY emotional are destroyed because the build-up to them was all laughs. The relationships between the characters is not founded at all. The villain, who many are praising, is not developed as a villain should be. I could write a four page essay, but those are my brief thoughts."]},
{"content": ["The film is very interesting, and I finally could not watch any of the thora,Great story, developed characters, I thought, nothing to understand, but I understood suggest"], "expanded_content": []},
{"content": ["A bit over rated in my personal opinion.  I dont think that Cate Blanchett gave the best performance either.  However, I did enjoy the trash planet.  Jeff Goldbloom's character the Grandmaster was the perfect combination of snarky and sarcastic."], "expanded_content": []},
{"content": [" "], "expanded_content": ["I really enjoyed the movie. All the cast is great and the story is cool, but.. TOO. MUCH. COMEDY. MOMENT. I'm pretty sure in the phase 4 Thor and The Guardians Of The Galaxy will become teammates, so the 'tone' of Thor is switched to TGOTG tone. Anyway, some 'funny' parts are very forced and unnecessary. Great movie, but not well balanced. I hope this is the one and only movie by Waititi for Marvel."]},
{"content": ["\"Thor: Ragnarok\" was a very good movie, although the jokes were very out of place, the story and the characters were very good, maybe not a good movie for the MCU, but a very good movie for the trilogy of Thor."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Without a doubt the best of the Thor films, however is that really saying much? The film has solid performances all across the board, and the movie visually is spectacular. But the action sequences are just kind of average, the villain Hella is the standard one note Marvel villain, and the movie feels more forced with its fun tone, than it being natural. Overall one of the better films in the MCU, but a little to formulaic to stand out from the bunch."]},
{"content": ["I understand what the critics appreciate about the attempts of humour and style in this movie but Deadpool did it way much better.  It's entertaining enough to watch."], "expanded_content": []},
{"content": ["For me, without a doubt, the best of the Marvel's C.U. movies. Fun, funny (very!), engaging and a pleasure to the eyes and ears. This is what most comicbook action movies should be like: campy, short and intense; a thrill ride!"], "expanded_content": []},
{"content": [" "], "expanded_content": ["Not awesome or horrible..it's an Average blockbuster film: If you like movies similar to \"Guardian of the Galaxy 2 & 1\" or \"Transformers last knight\" (that kind humor, action, visual setting)....you'll like Ragnarok also. If you prefer a different kind of Superheroes films like \"Avengers 1 & 2\", \"Sam raimi's Spidermans\", \"Logan - The Wolverine\"... you'll be bored and a little annoyed by Ragnarok.", "If you'r a fan of Planet Hulk Comics storyline you'll hate Ragnarock rapresentation of it.", "I'm not entertained by Guardian of the Galaxy film so for me it's a 5 or less"]},
{"content": ["Its CGI porn and nothing else predicable story, terrible one liners, and some of the laziest fight scenes I've ever seen. Good for children not much else. Walked out of theater."], "expanded_content": []},
{"content": ["Good but too silly for me. The movie is definitely entertaining and worth the price of admission; it's just that our heros we're becoming clowns. I prefer them to still have respectability."], "expanded_content": []},
{"content": [" "], "expanded_content": ["I must say that Thor:Ragnarok I liked and didn't like it-that's the average.The jokes in this film as terrible, and the mood of the film-too much fun.Ragnarok is the end of all living things and they prepodneset it as a normal,fun adventure of Thor.The music is good but I'm still loyal to the guardians of the galaxy 2.One of the problems is the deception trailer-the film actually has such scenes but just why the other and some changes are also present.....(for example, eye of the torus).In General the film just for once."]},
{"content": [" "], "expanded_content": ["Considering the glowing reviews out there and that other aggregate sites rating number I was disappointed in Thor: Ragnarok. It just is not that great when held up against the other top entries in the MCU. It is not that funny, although it really tries to be. It does not do anything that bad but it does not do anything that great either. Considering the stakes in this movie you would think it would not resemble what amounts to kiddie comedy for its humor. We have slapstick humor, sight gags and the only thing missing was fart jokes.  I do not want to say it was bad because it isn't bad. It just is not that great. On to Black Panther."]},
{"content": ["Se pasa un poco con el humor; pero no es tan mala como la pintan. Sigue la línea de colores estilos ochentas de Guardianes de la Galaxia y Spider-man. A ver hasta cuándo le dura a Marvel este estilo."], "expanded_content": []},
{"content": [" "], "expanded_content": ["This is a very fun movie that will entertain you. It is the best Thor movie to date but in my opinion it is not one of the Best Marvel movies to date. The comedy is well place but I think it is a bit overused. Great chemistry among the lead characters and all seem to click well. After the many, many commercials i saw for this movie I thought it ended up being a bit over hyped. Not bad by any means but not one of the best superhero movies out there."]},
{"content": [" "], "expanded_content": ["Thor Ragnarok had the potential to be an excellent action, superhero movie. It had a great story, threatening villain, and high stakes. However, it turned out to be a comedy from start to finish with non-stop jokes. Literally, each scene was to set up the next joke. There were so many jokes they ruin scenes which were supposed to be emotional or provide a major game changer for the protagonist. If I had to give Thor Ragnarok a grade it would be a C-."]},
{"content": [" "], "expanded_content": ["Funnier than either Guardians flicks and on a par with the first Avengers movie for sheer action fun, this is one of the best superhero movies ever. Cast is pitch perfect, with Hemsworth delivering a great tongue in cheek performance. Plus Goldblum, as usual, is pure scene-chewing gold."]},
{"content": [" "], "expanded_content": ["It's the best and most fun of the Thor films yet without a doubt. Nothing too mindblowing or amazing in terms of the MCU, but it never takes itself seriously, even during times when you might expect it to most, and that's what makes it such a fun and entertaining watch. It never lets up on the lighthearted tone or humor for a second. I also found the film to be nowhere near as corny as the previous two Thor films, especially the second one, which I thought got extremely ridiculous in the final act, but I digress. Overall, it's a both a humorous and visual treat, and is definitely a worthwhile and satisfying entry to the MCU."]},
{"content": [" "], "expanded_content": ["amazing movie with epic fights and perfect cast... thor is finally badass god like characters and fight scenes are amazing. Really enjoyable movie. And as the last comic book based movie for this year it was awesome... so next year again MCU cant wait, mainly for infinito war"]},
{"content": [" "], "expanded_content": ["Amazing movie with epic fights and perfect cast... thor is finally badass god like characters and fight scenes are amazing. Really enjoyable movie. And as the last comic book based movie for this year (haha, while ******* ****** first gore movie of the year) it was awesome... so next year again MCU cant wait (and slay the peripheral studio)"]},
{"content": ["A funny film, but basically almost a parody of \"real\" Thor. It seems a spin-off from Guardians of Galaxy. The target has obviously downgraded to teen/child. Where is the pathos and grandeur of Kenneth Brannagh's great first Thor?"], "expanded_content": []},
{"content": [" "], "expanded_content": ["The jokes weren't very funny and the overall atmosphere of the film is far too light. Simple plot, uninspired villain, and a general sense of aesthetics over substance - pretty actors, CGI, and action rather than a decent story. Also feels like it's some sort of inside Hollywood joke by randomly throwing in Matt Damon, Jeff Goldblum and other random actors."]},
{"content": [" "], "expanded_content": ["Look, I can appreciate comic relief in a character but not the whole freaking movie. Is every character workshopping a comedy routine?! Jeez. The Thor series has always been about dynamite action but Ragnarok is like an SNL skit where nothing's taken seriously. Hella, Goddess of Death, is the only persistently serious character and you gotta just love her Make Asgard Great Again rallying call :-) Also, I love Zeppelin's classic \"Immigrant Song\" but using it in this comedic film trivializes it, big swing and a miss on that."]},
{"content": [" "], "expanded_content": ["Don't let the comedy fool you. This is a serious movie with big stakes and heart that still takes time to be an absolutely joyous ride. The action scenes are amazing and there is no weak link amongst the actors. Cate Blanchett chews the scenery every time the villain Hela is on screen. Jeff Goldblum going full Goldblum as the Grandmaster is a delight. Tessa Thompson is an amazing addition to the MCU as Valkyrie. This is a must see and easily a top 5 MCU movie."]},
{"content": [" "], "expanded_content": ["This movie is just SO MUCH FUN!!! The emotional scenes were never quite there and that could create some tonal discrepancies, but it makes for every single flaw this movie carries through the sheer thrill of it. It just contains so much vibrant energy and exuberates it in almost every single second through either breathtaking action sequences, engaging characters, or hilarious moments. This movie is VERY funny indeed and I would definitely recommend it to anyone that has been a fan of Marvel thus far."]},
{"content": [" "], "expanded_content": ["Is a good movie but there's a lot of not funny jokes, that's the worst, there's a joke every 5 minutes, but it's a good movie even that, and if you like the Marvel movies you will enjoy it, but the jokes is the only bad thing, and all the actors are good in there characters"]},
{"content": ["a disaster, Marvel Studios movies were reduced to momentary comedies, this movies are the trash food of the genre, inopportune jokes break the climax and the characters look like buffons"], "expanded_content": []},
{"content": ["+++ Amazing", "++ Very good", "+ Good", "- bad", "-- very bad", "--- terrible", "+++Thor", "+++Hela", "++Loki", "++Heimdall", "+Comedy", "+Action", "+Hulk", "-Grandmaster", "--Skurge", "---Valkyrie"], "expanded_content": []},
{"content": [" "], "expanded_content": ["Marvel clearly found their winning formula: 2 hour music videos with jokes every 30 seconds.", "This could mean good and bad things. The good thing is that people are loving this movie, so it'll make a lot of money. The bad thing is, they're just making every movie the same, and people are ok with it.", "The worst is that this movie had the potential to be a beautiful moving movie. But they just turned it into a snl musical sketch.", "For what it's worth, not all jokes are bad. The fight scene with Hulk had actual reasons to have funny bits. But the fact that after that Hulk just turns into a buffon just ruins it.", "Valkyrie was a cool character. It's satisfying and interesting to know why she acts the way she does. Hela was also well developed. And pretty dope.", "The scene that stands out for me was when Hulk starts transforming into Banner. It was a very interesting sequence and I'm glad they acknowledge Black Widow.", "Korg, oh my god, his humor is barely humor. It's cheap and just not funny.", "But I have to be honest, despite me not liking the movie, I can't deny that people are loving it for a reason. It's just a piece of cheap (but expensive) entertainment. That's what people love to consume, and that's why this movie will succeed."]},
{"content": [" "], "expanded_content": ["Passable. This film plays out like the standard Thor film but adds its own MST3K-style commentary of itself as it goes, mixed in with goofy Looney Tunes-esque humor. When the film is sticking to the script or trying to be goofy, it gets some laughs and feels fun. The improv is pretty weak, though, and unfortunately, there's far more of it.", "There's not much more to the story other than weak improv. None of the dramatic moments land--not unhelped by the improv undercutting all the tension--and the movie loves to focus on the unfunny, boring drama far too much for its own good. Perhaps to supplement how little actually happens in the film. It's more or less a bunch of conversations in one of a very limited set of locales, peppered with a few short action scenes.", "So, we have a story with no tension and little story that plays out like the standard Thor story but undercuts itself by shoving in bad improv wherever it can, but with some decent action and scripted humor that will have you giggling at least once every five minutes or so.  I never felt bored, but I did feel like the movie was constantly reaching to keep me interested and was floundering so much that I felt bad for it.  The strongest parts are the clever ending and the relationship with Loki/Thor finally feeling like it's progressing on some level, which elevate the movie, but only just enough to be passable, and not to excel."]},
{"content": ["Thor: Ragnarok fails to give as much attention to it mediocre plotting, the film is somewhat boring in some parts, and presents too many childish jokes."], "expanded_content": []},
{"content": [" "], "expanded_content": ["This movie is a lot of fun. It´s not faithfull to the source material, is a different thing. And that is not bad in this case. Anyone looking for the Ragnarok comic book story arc must understand this. I enjoyed Thor Ragnarok for what it is: a movie with great visuals, action scenes, an awesome score and soundtrack and a lot of humor."]},
{"content": [" "], "expanded_content": ["The best of all three Thor movies (which isn't much).", "To cut the review short, if you're a fan of the comics then don't bother, but if you aren't into the comics then it might be enjoyable.", "Pros", "-Cate Blanchett is great as Hela", "-Loki is also surpisingly endearing", "-The Hulk", "-Good fight scenes", "-The comedy has it's mmoments", "-Clumsy Thor is quite likable -Thor vs Surtur was great", "-Heimdall is badass", "-Subtle nods to the comics", "Cons", "-The drama is overshadowed by the comedy and comes out as forced due to the lack of build up", "-No suspense", "-Inconclusive fights", "-Korg and Miek was turned into gags", "-No Caeira or Hiroim (which means no Skaar or World War Hulk)", "-Planet Hulk was butchered to fit into Ragnarok's(The movie) comedy", "-No Hulk unbreaking scene", "-Valkyrie does wierd head bobbing", "-Tessa Thompson doesn't look good as Valkyrie", "-Skurge", "-Very lackuster story (especially when compared to the source material)", "-Comedy is crammed into every inch of the movie, even during dramatic scenes.", "-Sakaar isn't the desert badlands it's supposed to be.", "-Too sci-fi for both the source arcs (Thor 80-85 and the Planet Hulk arc)", "-The comedy, while quite funny, is of the lowbrow kind", "If you're wondering why I gave it a 2, it's because I'm rating it based on how much I enjoyed it."]},
{"content": [" "], "expanded_content": ["Incredible, overhelming and hilarious film that is a whole new act of Thor’s sequels. Acting in this movie is very well, situational humor and dialogues are perfectly compile. Battle scenes and music are the strongest pillar of production. I enjoyed it very much."]},
{"content": [" "], "expanded_content": ["This is a great change of pace for the Thor series after the dragging Dark World. With great performances, both comedic and serious, from Hemsworth, Hiddleston, Blanchett, Goldblum, Thompson, and Ruffalo, fantastic imagery and action sequences, and a refreshing renewal energy, Thor: Ragnarok is certainly a highlight in Marvel's ever growing cinematic universe."]},
{"content": [" "], "expanded_content": ["Lo mas bizarro q he visto en mucho tiempo, personajes carismáticos que desprenden fuerza, un odio a las dos anteriores que es casi delicioso, unas escenas de acción como no se han visto antes en marvel, si no te divierte es que eres una persona gris que vive en su mundo gris"]},
{"content": ["The begining and the last minutes gives it 6. Great CGI. Mid (which was pretty long) wasnt very exciting. Jokes were fun at start for me, later got bored by them. Thor was acting to much like a baby trying to be funny."], "expanded_content": []},
{"content": [" "], "expanded_content": ["I have to say I really enjoyed this movie. There are some things that could have been better like any other movie but all in all it was a very enjoyable movie. The actors played their characters very well, there are moments in the movie that the brother relationship felt real. The fight scenes were better than good. Music was great. The CGI was done very well. I'm not actually sure where the argument that the CGI is horrible, I've worked with CGI before, that wasn't horrible. The timing of the jokes could have been improved, very few times it was actually forced. There were some scenes that should have been a bit more impactful. The negative reviews on this movie mostly come from hardcore fans of Thor from comics(I'm not a big Thor fan from the comics or from the other two stand-alone films). The other people who hate this movie seem to think that movies like these(\"RAGNAROK\") that need to be so serious for great storytelling. My advice to those people is look at the DC films, they take themselves seriously, they get okay storytelling, they bore people that are not comic book fans a lot of the times, not fun. They bomb the majority of the times in reviews and if it weren't for their name recognition they would bomb in box offices too."]},
{"content": [" "], "expanded_content": ["A 73?  For this?  Sure, it has a few laughs, but it's still this same-old boring comic book movie nonsense.  When is Hollywood going to re-evaluate this formula?  When can we see a new \"Dark Knight\"?  I'll say that the actress playing the Valkyrie is refreshing.  Everyone else?  Boring."]},
{"content": [" "], "expanded_content": ["An overly flippant movie desperate to crack a joke instead of tell a compelling story. There were so many good ideas in this movie that it is angering to watch them destroyed through shoddy execution that wants to tell jokes. Even at the very end the gravitas of the scene was destroyed by a bad weird joke. The artistry and design were great, but the over reliance on humor made the movie incredibly weak."]},
{"content": [" "], "expanded_content": ["All of the Avenger Movies are poorly written/acted with bad attempts at humor.  I heard Hemsworth asked for more humor i.e. Guardians..what a fail! - Granted I am not the desired audience for this drivel.  The kids and easily amused eat this crap up!!"]},
{"content": [" "], "expanded_content": ["I'm a huge fan of Marvel movies but didn't care for this one. It gets two stars for cast and the occasional laugh, but overall this was very disappointing. Really bad writing and directing. And i didn t like Tessa Thompson she dont belong to norse at all."]},
{"content": [" "], "expanded_content": ["Talk about a disappointment! Lots of unnecessary jokes, lack of action scenes, horrible villain, etc. How are you gonna name a movie 'Thor: Ragnarok' and make it a comedy, it just doesn't make any sense. Previous Thor movies were far better than this. Kinda sad that Marvel missed the point on this movie."]},
{"content": [" "], "expanded_content": ["This is really a 3.5. Generally, I'm a fan of the Marvel movies, but not this one. It is by far the worst that I have actually seen. The plot is thin, and not executed terribly well. Ditto on the villain. The action sequences are okay, but nothing special. The visuals are mostly pretty good, but the background music is often pretty bad. It is meant to be funny, but rarely pulls off the jokes, especially if you aren't a fan of dumb humor. At least half of the movie is just poorly executed improv. I am pretty certain that from now on, the director Taika Waititi will automatically cause me to not see a movie."]},
{"content": [" "], "expanded_content": ["Despite not ridding the MCU of its villain-problems, Thor: Ragnarok is funny throughout, borrowing some of what makes the comics so entertaining. The comedy is on point, the chemistry between the rather big cast works, and the fan service is well executed. The third act is always somewhat of a problem in the MCU, as it usually centers around a shallow villain who turns out to have really shallow and frankly boring motives. Thor: Ragnarok solves this by putting the focus on the relationship between our heroes and their internal conflicts, creating a much more satisfying ending to the Thor trilogy. I can't wait to see more."]},
{"content": [" "], "expanded_content": ["Good humor, good action, good actors, what more do people want in a comic book movie? The negative reviews are almost assuredly being written in the basements of some disappointed parents. I think the fact that the movie pokes fun at itself and comic book movies in general has stung some people's sensitivity. If you want to watch a funny movie with great action go for it. If you will be hurt that they don't treat comic books like Shakespeare or religious canon then you may want to skip it and just re-read your comics. Also seems like quite a bit of racists here upset a non-Aryan was cast. Not sure what they think of Idris but they seem to really dislike the female. I thought she was fine."]},
{"content": [" "], "expanded_content": ["*** This review may contain spoilers ***", "After waiting for Thor: Ragnarok for years. This movie is perhaps, the WORST Marvel movie I have ever seen.", "Poor story-telling, weak character development, scenes felt out of place and total 360 from what Thor is supposed to have been.", "Hollywood blockbusters have been lowering the complexity of its stories to get more butts into the movie seats which include kids who might not be able to understand a more dark, realistic and complex story. This comes at the expense of adult audience who like to see a characters inits true form.", "This movie is basically Logan in reverse. It is a total betrayal of the character's true nature. The following are the movie sins committed in this flick; Warning Spoilers ahead!", "1) Bad Story-line.. This story doesn't allow characters to evolve or grow, a lot of the acting seems too familiar or forced for the sake of moving the movie forward or getting a reaction out of you.", "2) Everything happens so fast without explanation of events or relationships... a) Why did thor figure out that Loki was impersonating Odin now and not before? b) How was the all-powerful Odin enchanted by Loki? c) Why did Odin decide to let Hela to Invade Asgard and why did he decide to disappear? d) How did Hela break Thor's hammer? e) Why did the leader of Sakaar favorite Hulk over Thor?", "2) No setup from previous events and no purpose for characters", "a) Thor and Hulk somehow ended up on the same planet by accident b) Why did Dr. Strange need to be in this movie besides setting up for a thor-strange relationship in a future Marvel movie? c) Why didn't Odin hint in previous films that thor had an evil sister named Hela? 3) Bad acting", "Even Tom Hiddlesto was off point, he had the usual devious smirk on his face but I sometimes wondered if he was expressing contempt at the directors of the film. Besides being a remarkable film crew with amazing actors, somehow this movie manages to bring out the worst acting of these stars.", "Heres a basic breakdown of each character Thor: A more emotional, funny and light-hearted Thor", "Loki: The same devious mischief with no new tricks up his sleeve, Loki is so predictable that even Thor has figured him out.", "Hela: The sorority club's biggest drama-queen, nothing mysterious or godlike about her. Even she falls into the joke frame.", "Heimdall: He had some good scenes and had a nice mystical look to him but wasn't very much useful in the movie.", "Grandmaster: This guy is supposed to be a ruler of a planet, instead he belongs on a SNL skit.", "Valkyrie: Independent strong woman, alcoholic, with both middle fingers up in your face. Somehow this quickly triggered ghetto character manages to defeat Loki in a battle for the sake of showing how women are strong too?", "Skurge: He betrayed Asgard for the whole movie and then tries to make up for it in less then 5 frames before he dies.", "Bruce Banner / Hulk: Even hulk manages to turn himself into a comedian.", "Doctor Strange: Earth's best sorcerer tools Asgardian gods such as Thor and Loki who should have far greater knowledge of magick then Dr. Strange.", "The Executioner: somehow managed to betray Asgard by serving Hela for the entire film, but then sacrifices himself at the end and we're expected to sympathize with this guy?", "Korg: This was a loony toons version of Korg", "To seal the cherry on the cake, Thor basically lets and assists Asguard to be blown up to pieces, because he figures it will destroy Hela, someone who he wasn't able to defeat even with his new powers.", "The disappointment I felt after watching it sure caused a big disconnect for me after I came back home only to read all the positive reviews written by Critics and users alike, which made me question if these Critics are insiders, and if the users are in fact real accounts...", "I know everybody's got to make some money... but at what expense?"]},
{"content": [" "], "expanded_content": ["Just like how Winter Soldier made Captain America great, Ragnarok makes Thor great. This film is a blast from start to finish and never offers up a dull moment. The dialogue (which was heavily improvised) is the best in the Thor trilogy and one of the funniest in the MCU. There are no weak links in the cast as everyone brought their A game. Kate Blanchett is a very good Marvel but still not amazing. It has nothing to do with Kate Blanchett, but rather that the character never really does anything besides killing soldiers. With that said, the Kate Blanchett makes her a memorable Marvel villain. The score is fantastic and often fits perfectly with the action beats. Speaking of action, the choreography is well done and very different from the past Thor films. Chris Hemsworth, Tom Hiddleston, and Mark Ruffalo are perfect in their roles, as expected. If you love Marvel films this is a much watch."]},
{"content": ["One of the best Marvel movies and definitely the best Thor movie, Loved Taika Waititi's direction on this one the best choice for a director in the MCU by far. Absolutely hilarious and a visual treat, this movie was a joy to watch."], "expanded_content": []},
{"content": ["Leagues above every other superhero movie, Thor Ragnarok perfectly blends Action and Comedy. The Thor movie series was always Marvel's Achilles heel, but now, it's Marvel's greatest."], "expanded_content": []},
{"content": [" "], "expanded_content": ["It is a very colorful and humorous Marvel film, I recommend every ex-Thor fans to come back and watch this.", "The action scenes are perfect, as well as the addition of the Immigrant song in the first and final battles, just like Guardians of the Galaxy.", "Chris Hemsworth would do anything to be as funny as Loki. Tom Hiddleston hasn't changed much and we still like him. And Cate Blanchett is the worst, or the baddest villain ever played for the MCU, awesome :) But Mark Ruffalo is still too underrated, probably more underrated than Jeremy Renner's Hawkeye (from Avengers).", "To be honest, when the movie came out, the scenes from the trailer almost looked the same and it's like the final movie didn't make any changes."]},
{"content": ["This movie is one of the funniest movies I have seen!! I 100% recommend it to anyone who loves comedy and a bit of action. This is definitely one of my favorite movies! Even the knew characters in the movie are hilarious!! Go watch it!"], "expanded_content": []},
{"content": [" "], "expanded_content": ["A fun film, and very entertaining, despite what you might expect from a movie bearing the title \"Ragnarok.\"", "It's almost like two separate films tacked together, and while one part - which focuses on Thor finding new partners - is really well done, the actual Ragnarok plotline isn't.", "In similar way, the movie is focused on the comedic side, so whenever there is a serious moment (and there are many in the film, that deserved to be serious,) it undercuts itself with a joke.", "It also builds towards a final confrontation, which I found disappointing and unfulfilling.", "So, to repeat, Thor:Ragnarok is a fun film, an entertaining film; but if you care anything at all for its mythology or story-line, you might be disappointed."]},
{"content": [" "], "expanded_content": ["Taika Waititi was the best choice to make the third movie in the Thor series. After Branagh's standard first one and Taylor's second one (both are very boring), Waititi's Ragnarok looks like acid rain in the moonlight. So, Chris Hemsworth is very funny in this role and Mark Ruffalo still is ridiculous as Hulk/Dr.Banner. Also Mr. Goldblum plays Mr. Goldblum, and Cate Blanchett is magnificent as Hela. Ragnarok does not want to be something more than fun and in this is the excellence of movie. Thor: Ragnarok: very fun, a bit stupid, and entertaining movie with great cast."]},
{"content": [" "], "expanded_content": ["it's a really awesome like always before Marvel has made a piece of art work the film it self was good but it was really disappointing the hammer get crushed"]},
{"content": [" "], "expanded_content": ["After thorough consideration, I've decided that this is my favorite marvel movie to date. It's undeniably funny, which is a change for Marvel, but the film sets a powerful new precedent for sheer entertainment value. It's not moving or awe-inspiring, but it's not trying to be those things. It's trying to be fun to watch, and at that goal, it succeeds admirably."]},
{"content": [" "], "expanded_content": ["There are things to like about this movie. The special effects, the world, the whole idea of Ragnarok but the humor is this movie really sticks out like a sore thumb. It's just plain childish. There are some good moments but most of the time it just feels forced, cheap and overall just not good enough. YMMV as always, but I didn't like this movie as much as I'd wanted to.", "The fights are what keeps this movie going and that's something but in the end it's not really one to remember."]},
{"content": [" "], "expanded_content": ["This was the best Thor movie so far. Lots of action. Lots of punchlines. Comedy. Surprises. Lots of \"moments\".", "My favorite scene were the last action scenes in the movie (without giving away any spoilers). When you're watching the movie in the second part, you will know what scene I'm talking about. It's the scene where movie goers clapped."]},
{"content": [" "], "expanded_content": ["A lot of sweat and tears went into this. And I always appreciate the hard work crews put into these productions. Effects awesome (ie: Thor/Hulk fight) - although used to hide mediocre story development. Character building weak on all fronts (yes, even a comic book movie needs credible arcs - hasn't GOT proved this?). Acting good (for what they had to deal with in direction) Not pleased with where Marvel/Disney taking the franchise. They get $$ hits with being humor focused (Ant Man; Deadpool; Spiderman; Guardians - 1) and now I'm getting the vibe they're going to keep milking this direction with characters that are not humor based. Don't get me wrong, humor good, making my heroes into sitcom joke beaters is not. But I'm old school Marvel (FOOM!). I like great writing; great characters; inspiring story - even in my comic books. This Thor is now ruler of Asgaard - now that's a joke. Oh and one more thing - I realize arena fighting plots are fairly the norm these days - but can't help like it feels ripped from a Lee/Kirby/FF storyline that was written for the Thing."]},
{"content": [" "], "expanded_content": ["The humor felt really forced to me and in some cases, out of place. Because of this, none of the stakes felt real. Why should I care if the characters are just making gags all over the place? Ragnarok was a complete change in tone for the Thor franchise that I could not get behind. The first two weren't Oscar worthy, but at least something actually felt important in them.", "Besides that, continuity of characterization from other installments in the franchise went out the window. Since when does Thor use Earth colloquialisms? When did Hulk start talking in complete sentences and have feelings besides rage? And I want to know: Why does nobody on Asgard remember Hela if the Valkyrie warrior who fought her looks a decade younger than Thor (I know they're godly and all, but they have to age at some point, look at Anthony Hopkins)?", "As a final issue I've not been a fan of in the recent MCU installments, why must they unnecessarily plug they're other characters? Why have drawn out scenes that serve no real purpose except to try and entice you to watch every one of their films?"]},
{"content": [" "], "expanded_content": ["A fun-filled, if slightly overlong action-adventure romp with snazzy special effects, ample humor and perfectly campy performances by many of the picture's principals, especially a stunningly brilliant Cate Blanchett. The film admittedly sags a bit in the middle with several somewhat bloated tangents, but it makes up for this in so many other ways. What's more, one need not have seen its predecessors to follow the story here, an important consideration for new viewers walking in to an established movie franchise. Definitely a rip-roaring good time at the show."]},
{"content": [" "], "expanded_content": ["A lot of good stuff on the movie.", "Great special effects and visuals, however they kill it for me with the amount of forced humor, seems more like a parody than a Thor story.", "Hela was hyped, i think they miss an opportunity to make a great movie for a good comedy movie.", "Still worth to watch for a few good laughs."]},
{"content": [" "], "expanded_content": ["Thor : Ragnarok deserves the colon, it's yet another Marvel superhero movie where the good guys have a team, the bad guys have an army of nameless drones, and the bad guys underestimate the good guys.  Oh, and there's Jeff Goldblum & Taika Waititi, as the goofy side characters.  Marvel figured out COLOR was COOL, so there's alot of that.  Missing GoTG heart & Wit, this movie is just alright but still better than anything DC's put out."]},
{"content": [" "], "expanded_content": ["Thor Ragnarok is one the funnest cinema experiences I have ever taken part in. It is quirky, imaginative, and truly entertaining. While the story is no masterpiece, it is both unpredictable and thrilling from start to finish. This film looks, sounds and feels great."]},
{"content": [" "], "expanded_content": ["A funny movie. Too funny even for Marvel. I think what disappointed me from this movie was that I went to the cinema expecting RAGNAROK which throughout the other arcs in the other films they had already been mentioning or hinting and it was a dark and apocalyptic world. But they say these are the days to change the rules and consider those directors as \"geniuses\" (Rian Johnson) and what are we gonna do about it if people actually love that comedy. I respect their choice but at least can have a place to express my opinion. Thank you Metacritic for that."]},
{"content": [" "], "expanded_content": ["This film is just great to watch, it has lots of humour and action. Also, the quality of this film is insane, every scene looks highly detailed enhancing the experience of the viewers. Downside is some things that the Hulk does in film are contradictory. The villian is weak like every other villian in the MCU, so don't expect that making a villian female and giving it to Cate will stop the weak villian thing. Overall, it's awesome, if you don't like it, it's understandable."]},
{"content": ["I have to say that since \"Captain America: Winter Soldier\", Marvel hasn't really upped their game and offered me a movie with the substance of this one. Lately their recent outings are to o jokey and lacking credible dialogue."], "expanded_content": []},
{"content": [" "], "expanded_content": ["I kind of like the more serious tone and gravitas of the first two Thor films. I think the actors had way more fun making this tongue in cheek Thor Ragnarok than I did watching it. Thor Ragnarok was like a spoof and parody compared to the previous Thor films. They played it way to much for laughs considering the seriousness of what the event Ragnarok is supposed to actually be about."]},
{"content": [" "], "expanded_content": ["Best Thor film ever. This stands out for all the other Marvel films, not only is it funny but it is also memorable. It includes new characters, such as The Grandmaster and Korg, who are now two of my favourite MCU characters. It's incredible, and that after credit scene."]},
{"content": [" "], "expanded_content": ["Too much comedy, this should not be a superhero movie but a comedy movie that makes people laugh. Bad movie for superhero genre, Thor first movie and Thor Dark World more to superhero genre than Thor , maybe thor go crazy since his hair is cut"]},
{"content": ["It's bad, so much jokes, there are scene has unnecessary joke and this does to movie boring and bland, the only good thing is the CGI, Hulk is unnecessary in this movie, only was used for justify the Ruffalo's contract."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Seems like Marvel/the higher ups sacrificed what could've been a decent storyline and immersive universe into a really bad comedy, almost slapstick at times where people falling off a ledge is classed as quality humour. I definitely enjoyed the first 2 Thor films and didn't get why they sacrificed both the genuinely funny idea of the god of thunder landing on planet Earth and having completely different customs to humans as well as decent elements of romance/relationship. In this 3rd edition, characters who I really liked before such as Loki cheapen their appeal; where Loki used to be the sly but rootable brother of Thor now he's given in to crappy one liners. Most disappointing was the female villain, who is so cliched (such as a **** disney villain) that it made me and my girlfriend walk  out the cinema. Why, just why make her script and general persona so off-putting?? I've only give this film a 3 because the design and look of the worlds is amazing, thanks to the advances made in 3D animation in the last decade, the junk world, the arena and the CGI characters like the annoying south african rock all look incredible, just a shame that they have no real substance beyond that.", "I hope Marvel goes back to its former glory days and makes more films like the original Spiderman 1 and 2, the X-Men series and so on..."]},
{"content": ["Everything in this movie is a joke. Even the jokes. I mean... This is not the God of Thunder Thor that I known for almost 20 years. And \"def\" its not about the Ragnarok."], "expanded_content": []},
{"content": ["Movie does no justice to its name. How can a movie about Ragnarok(apocalypse) be a comedy? And Tessa Thompson is big miscast in this movie she dont look like Valkyrie."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Marvel movies are becoming more and more about 1 liners and explosions.  The villains are comical and ridiculous.  The puns are predictable and only good for the occasional chuckle.  The special effects is pretty boring and the stories are not stale.  Even when the villain is killing everyone they are trying to find a way to squeeze in a 1 liner.  Marvel needs to learn how to tell a story and quit trying to make comedies."]},
{"content": [" "], "expanded_content": ["Tries to be a funny movie but the comedy feels out of place or overplayed most times.", "Plot is paper thin. Has the usual fights against throngs of faceless CGI monsters, nothing new there. The villain keeps getting talked up as a great one but she's just a generic one dimensional character that jut wants power for power's sake.", "If you're looking for a good movie, look elsewhere..."]},
{"content": ["The movie sucks.Even though that movie was a blockbuster, I was bored by the story.I think all the impressive parts are in the trailer, don’t waste your time and money to go to the cinema. I’m tired of the non-stop Marvel style joke..."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Suicide Squad in jokes was better, and not even the humorous moments of the movie are so particularly nice to understand, but compare them with the worst jokes of Krusty the Clown, misuse of anti-humor by some characters at undue moments, Hulk was portrayed as a Bobo character, and Valkyrie was very badly stopped among the heroines of the Marvel Cinematic Universe, he did not connect as he should have been, in the comic it is another of Thor's love interests, but at least a wink wink should have made that. On the other hand, the character of Jeff Goldbum (Grand Master) is not at all like the comic book even if he wanted to be original, it seems to come from a casino owner in Las Vegas and did not seem to represent the biggest thing as a film any such I did not notice it, but he missed references to his brother. The planet they were on, looked more like a planet from the 1986 animated film The Transformers, Junkion, and not the comic book planet. the truth, very bad treatment and very bad example to the character who dealt with Odin, likewise, is a reflection of the little American culture on the treatment of older adults that shame to turn that into a joke or sofa gaga as in the Simpsons. As if that were not enough, he gets so far away from the homonymous comic of the stories of Thor and much more that scrambled with Planet Hulk, of course it is free adaptation of both stories, but nothing in common really. Or where is the alien son of Hulk? The only good thing is the photograph that exposes the Valkyries that in itself is at least redeemable in terms of the relationship refers to the eschatological myth of the \"Rägnärök\" of Scandinavian mythology, as seen in flashbacks and in one of the final scenes . But it returns and it moves away, Taikta Wakiti lacked head to be able to listen \"The ring of the nibelungos\" of Wagner and to read something more of Scandinavian-Germanic Literature to be able to give better treatment him to the film."]},
{"content": [" "], "expanded_content": ["Tomaron una historia del comic de Hulk y pusieron de protagonista a Thor, demasiado humor en una pelicula en que deria haber mas drama y una pelea final que deja mucho que desear, se esperaba mas de la ultima entrega del dios del trueno, el chiste la opaco."]},
{"content": ["best thor movie", "first one was alright", "second one was so boring, third time is the charm", "I'm glad to say thor finally has a good movie in his triology just like iron man with iron man 1 and captain america with the winter soldier."], "expanded_content": []},
{"content": [" "], "expanded_content": ["I actually like this new approach because it's interesting and different from other Marvel movies. The jokes are funny and I like that they executed it very well without changing the characteristics of the characters from previous installments. But I just think it'd be better for this particular movie to have darker tone. I also liked the ending, at least it was more logically realistic than other Marvel movies. Overall, this movie is amazing and one of the best Marvel has put out."]},
{"content": [" "], "expanded_content": ["I grew up with Marvel comics and Thor was always my favorite. None of the Thor movies were really up to the standard but as a huge fan I like them. Combined with other MCU movies which were getting better and better I had big hopes for the last Thor movie. I can't even begin to describe the disappointment. I wanted to leave the theater by the beginning of the second act. Disney effectively destroyed everything Marvel was building all these years!", "I was warned by some friends that movie was terrible but still I hoped I would like something. The Story has immense potential but it was ruined beyond belief. The Ragnarok ... the ultimate doom .... and they made a joke of it!?!?!? Sir Anthony Hopkins (Hanibal Lecter) and Cate Blanchett (Galadriel) making fools out of themselves made it even worse. If this movie was made by someone else like the Monthy Python crew it might be fun but like this ...", "I would have given it 0/10 if possible. After this movie I will certainly not going to watch Infinty Wars. Even more I will skip The Last Jedy and anything that has Disney label in the future.", "This is blatant attempt to attract new fans among younger generations by appealing to their shallowness, selling them cheap tricks and distractions instead of a good story and directing."]},
{"content": [" "], "expanded_content": ["Not a superhero movie but comedy. Valkyrie in this movie in not from Norse mythology but somewhere from African mythology. White washing is bad so it s black washing so please stop with this and stay true to the comics. And if there will be Thor 4 please kill Valkyrie character."]},
{"content": [" "], "expanded_content": ["I was surprised by how much I loved this movie. I think this was the hardest I have laughed in a marvel movie, and that is saying something. The action, visuals, and story were all great, and Hela was an intense, badass villain that stole the show when she was on screen. Marvel is continuing to kill it throughout phase 3, and this continues the trend."]},
{"content": [" "], "expanded_content": ["it`s a comedy? and why the name if the \"ragnarok\" happens in the last five minutes...?", "It was a disappointment. Humor is important, but this movie was THOR not the Guardians of the Galaxy.", "And to finish. If my best friends and colleagues are killed and my father dies ... I will only do what Thor did, absolutely nothing. Ah! Although the part where Thor's hair is cut, made me laugh a lot."]},
{"content": [" "], "expanded_content": ["The total change of the hero and the total change in the atmosphere went very good. We have great hopes for the next Avengers, but after such a Thor, it will be difficult to surprise and fascinate us.", "The soundtrack is simply beautiful, always at the right time and strongly adds impressions in certain moments.", "Director Taika Vaititi is just an opening, someone will say that he created in the film a too comic atmosphere. But it was worth it, the jokes are just great. There is no man who does not smile looking Thor: Ragnarok. The humor in the film perfectly dilutes the intense and epic moments. You could add more seriousness or battles, but not the fact that the film would have turned out better.", "Thor from a little interesting hero thanks to \"Ragnorok\" will definitely fight for leadership in popularity and charisma. He added power, humor, and most importantly in intelligence. He started to plan his actions perfectly and use all the opportunities that are provided to him.", "In addition to him, the intellect was added by the Hulk,    but not so much . He is like bully kid now. Funny and interesting moments with him became even more.", "The inhabitants of Sakaara are completely different and unusual, far from being patterned, which are very interesting to observe. Asgardians as true wars do not surrender even in the face of death itself and do not kneel before anyone, with a few exceptions.", "Hella - A great villain. Her motives are perfectly understandable, the power and charisma are simply enormous. She's as pathetic and confident in words as she is on the battlefield. Demonstrating this throughout the film in epic battles. Very rare quality, which makes it one of the most dangerous threats to the universe.", "And of course Loki! I've never been a fan of this character, but it's hard to argue that he improves every film he participates in. In this picture, he introduces such chaos, humor and interest that he is that zest that makes a great film Masterpiece!", "To make a masterpiece there must be a star, a puzzle. It is this director for the script and for the cast. Another excellent camera work, editing and soundtrack. Thor: Ragnarok is just that case, all at the highest level.", "The best film Marvel! Best movie of the year!", "10 of 10"]},
{"content": [" "], "expanded_content": ["The mix of distinctive characters makes Thor: Ragnarok hella great. The comedic and directorial touch of Waititi makes it the best of the three Thor movies. Great performances by Hemsworth and especially by Goldblum and Thompson. Overall, one of the best comedies in the Marvel universe."]},
{"content": [" "], "expanded_content": ["Esta película tiene más humor que créditos, que si bien es gracioso, le quitan todo lo épico a la película. Muertes extremadamente rápidas y poco épicas, puedo definir esta película como decepcionante. Tres comedias en un año hizo Marvel. Sin embargo es entretenida de principio a fin, no como sus predecesoras, y es excelente el diseño de producción"]},
{"content": ["Hilarious, but also with a lot of heart. Through most of the movie, it does funny well, but can still be serious when it needs to. I would give it a ten, but there are a few moments where the humor and drama clash."], "expanded_content": []},
{"content": [" "], "expanded_content": ["No spoliers review.  Thor Ragnarok did for Thor what Captain America Winter Soldier did for Captain America.  This is the best Thor movie hands down.  It is an action/comedy/superhero movie.  If you love Guardians of the Galaxy 1 & 2, you will love Thor. As for the Villain, Marvel still has a slight problem with its villains.  Given that one of the best ones, Dr. Doom is tied up with the rights to Fox, I think we will still continue to see this problem until Thanos. That said, I thought this Villain did a good job.   The movie does somewhat follow the Disney/Marvel formula but they throw some curveballs at you.  There are several times when you expect a superhero style entrance or moment and they change it up with comedy. Overall an EXCELLENT movie."]},
{"content": [" "], "expanded_content": ["This movie was a very fun and refreshing break from the MCU, not all of the jokes work, and a few times they should have toned down the humor, but it was a quite enjoyable experience.  I also liked the ending, as it wasn't a simple \"the heroes defeat the villain ending.\"  I would give it an 8.5"]},
{"content": [" "], "expanded_content": ["The worst piece of crap I long have seen. Measurable with higlander 2 and onwards. I’m sick and tired of hollywood’s cheap jokes, the characters behaving in no way like gods but like in a comedy Like dumb and dumber. But no wonder: it’s the walt Disney studios. The storyline  is SO cheap and predictable that it’s practically non existent. The story of the planet Sakaar is really b or c movie. I can’t recommend this cheap movie, I lost 2 hours of my life watching this, and I honestly regeret it."]},
{"content": [" "], "expanded_content": ["Thor is good in bursts during this 3rd film. The story is extremely thin, it goes off on a tangent and seems to stay there for an eternity. There's some fun and funny moments, however, they over-use the comedy and it becomes too much. The movie clocks out at about 2 hrs 15 mins. It could have been a more concise and evenly entertaining film if the running time had come it at about 1 hr 55 mins."]},
{"content": [" "], "expanded_content": ["Woo-hoo! Three Marvel movies in one year! Everyone’s been celebrating 2017 as perhaps the best year for comic book movies in history, with every single one thus far either meeting or exceeding expectations. I understand the hype, as like the last couple of movies in the MCU, Thor: Ragnarok features lots of good comic timing thanks to director Taika Waititi’s (Hunt for the Wilderpeople, What We Do in the Shadows) effort in staging sound to time each gag. The excitement goes nonstop as the hero fights demon after demon against screaming rock music to put the final cherry on the sundae.", "The continuation of the heroes’ journeys will expectedly keep committed fans raising their foam fingers of approval; when we first see Thor, he is chained over lava, face to face with a fiery demon, but without a hint of fear. When he meets his evil sister, she breaks his sacred hammer, and he’s later pit into a gladiator arena against a familiar green face, escalating the thrills with each new spectacle. The Incredible Hulk even has his own great moments faithful to when we last saw him, particularly in how he remained green and mean for the past two years.", "But that doesn’t excuse Ragnarok’s empty sense of humanity. The lack of consistency essentially starts with Thor’s father passively dying, leaving his evil daughter to rule over Asgard, a “sad” moment standing as a mere plot motive with no hint of trauma. As for the Hulk, what exactly does he think about forgetting the last two years of his life? Apparently nothing, as all his self-doubt gets insultingly contradicted in his final moments on screen. A couple of other new members join Thor’s team, including Valkyrie. Right upon her introduction, she falls off a platform drunk, setting off a damaged amount of sympathy for her shallowness that carries on with every other new character thrown in without consideration.", "For a majority of the feature, each supporting individual says their exact thoughts in service to exposition, even at the cost of satisfying closure to their stories. While I certainly learned plenty about what these new characters are, I learned little about who they are beyond funny caricatures. These characters needed to be more than comic relief against flashy colors to last longer than a month in audience’s memories. The laws of physics and social order make as much sense as the humanity, appearing a little too conscious about who needs to stay alive and who needs to stay beautiful after going through chaos. As a result, too much goes on in the climax to keep everyone active.", "Marvel’s new freak of art does nothing valuable beside combine Greek mythology with visualized techno music, two things that should never go together. As a result, the world looks uglier than ever before, even for a comic book movie, from the stupid historical paintings decorating Asgard’s capital building to Hela’s overdesigned “crown” or whatever you call it. People already care so little about ancient cultures, so once it’s time for kids at school to learn about Greek history, they will think about something less valuable instead.", "Although I most want to talk about the acting, an overstated aspect that the entire Marvel series in actuality does dreadfully. Chris Hemsworth deserves no praise for his awful performance; he just stilts around with a charming smile plastered onto his spray-tanned face as if waiting for an awkward school photo. The film’s comedic charisma has no thanks to give to him, an actor praised only because he’s handsome without being annoying. But Jeff Goldblum was the absolute worst casting decision; his instantly forgettable role simply felt awkward to watch, as he created the most painful attempts at humor. I can’t remember a time he has ever put on a good performance, and I wonder how he’s still getting cast in big movies today.", "The nitpicks go on much further than you may assume:", "Teenage boys might complain about the fake looking graphics fit for the X-Box.", "Long time Marvel fans might complain about Doctor Strange’s underuse in an easily rewritable four-minute scene.", "The more artsy viewers might complain about Hulk’s dumb looking gladiator armor.", "The older viewers might complain about some of the seemingly never-ending jokes.", "Women might complain about how Hela insults middle-aged women everywhere who want representation beyond roadblocks to men’s triumphs.", "And parents might complain about the bad role model Thor sets for younger boys.", "Thor’s first scene alone features him playing with his hammer in its 3D glory as he beats up demons Halo style. Then for the rest of the film he joyfully beats up his siblings, celebrating his rewards afterward. So why let boys look up to some self-righteous white dude with flowing blonde hair who brags about the hardness of his hammer? If anything, Thor will raise a generation of pompous blonde-haired men who think only about claiming the throne."]},
{"content": [" "], "expanded_content": ["I had quite a bit of issues with Ragnarok. Most of my issues seem to be common consensus on the reviews I’ve seen but they all say it’s okay because the comedy was there which I disagree with. Even though there are many spoilery things I could address I will remain spoiler free, at least for now on MetaCritic. The issue, I think, is that this felt like a parody. I think it’s very on level with something like GOTG 2; in fact, I genuinely thought Jeff Goldblum was The Collector from GOTG. Okay, just did some research and the two characters are brothers but Goldblum cameoed in GOTG2? I don’t know. I give up. I also think the ball might have been dropped a wee bit in the costuming department for the females because whenever they were in these body suits, they walk a little bit funny which was quite distracting. There were some distracting soundtrack scenes as well. But, the biggest issue is I felt like the humor was severely lacking. The jokes just felt like something an elementary schooler would find funny. I do not think this is Waititi vision’s fault but that it was better suited for like a television special as opposed to a live action two hour twenty minute show. I am still very interested in his other works, I just feel like this was not the right spot for his comedy."]},
{"content": [" "], "expanded_content": ["What the hell you did with Thor, god of thunder. Hes a joke now, a inanely tomfool, a crybaby. The whole movie is a joke.", "I was so happy that it was out... and so dissapointed after seeing it. Also when the effects were great, the silly slapstick dialogs where crap and are destroying the whole athmosphere. Its the badest of all three thor movies... wrong... this is no real thor movie. What a waste of money!"]},
{"content": ["Clearly the best of the Thor movies. It is kind of crazy and silly, more like a comedy. If you saw Taika Waititi's previous films, you can clearly see some parallels. They did a good thing here."], "expanded_content": []},
{"content": [" "], "expanded_content": ["hor Ragnarok is easily the best Thor movie ever made. Taika Waititi's direction definitely rejuvenated the franchise. The movie is nearly flawless with stellar performances , outstanding visuals and great new characters and action set pieces.The biggest issue with the movie is its forced humor apart from that this is a must see movie for everyone."]},
{"content": [" "], "expanded_content": ["I didn't think this would be a good Thor movie, there isn't much story line or character development. Just lots of witty banter, some humour and one liners, but of course I'm giving it a 7 because I was still entertained. Wish I could give it a 6.5 and not a 7. It's okay that I went to see it with friends to check out the hooplah, but really, I didn't need to."]},
{"content": [" "], "expanded_content": ["As far as \"action comedies\" are concerned, \"Thor: Ragnarok\" delivers on both fronts. There are laughs to be had. Like a whole lot of em.' Genuine ones that I'm sure comedic-oriented director Taika Waititi had a hand in fine tuning. There is violence to be had too. Amazingly glorious showcases of it, in fact. To say that this is the best \"Thor\" movie by far may be a bit of an empty claim, but my claim, it remains. It's fun, funny,  and memorable, which are three separate traits I can't honestly say many recent MCU films have possessed simultaneously. Definitely worth a look if you're a fan of the character or, if you're like me and have been holding out hope for the franchise to try something different."]},
{"content": [" "], "expanded_content": ["Hands down the most enjoyable marvel movie yet. Imagine guardians of the galaxy on steroids basically. Epic level action with top notch cg set in really good looking imaginative settings, really funny dialogue delivered by diverse and interesting characters and fast paced story with never really a dull moment. One could argue the story is rather simple and lacks any nuance or complexity but the film truly delivers on pure entertainment value. Anyone arguing that this feels like a cheap comedy is certainly a very boring soul that somehow has forgotten that superhero stories have never been or tried to be shakespearean dramas."]},
{"content": [" "], "expanded_content": ["I didn’t want to see Thor Ragnarok because I hated the first two so much, the trailer for Thor 3 comes out and the internet nearly wets itself with excitement. I can safely say the trailer undersold the movie, and I nearly didn't see it in the end. The only reason I went to see yet another Thor movie was because of director Taika Waititi, and I'm so glad I did. Doesn’t suffer with an over stuffed cast fighting for screen time leaving room for actual character development. There’s just enough main characters and they have such fun with the roles. Perfectly paced with a simple yet well executed plot. Although not all the jokes land it's funny even if it's unbearably cheesy at times. Thor Ragnarok is without a doubt the best Thor movie and one of Marvels finest. Bizarre and superbly entertaining.", "Chris Hemsworth and Mark Ruffalo are doing their thing better than ever. The two strongest Avengers come head to head and it's everything you'd expect and more. Cate Blanchett struts into every scene in a swirling cloud of evil green mist reminiscent of a stereotypical Disney villain I was almost expecting her to break into song. Spoiler alert, she doesn’t although that wouldn’t be the strangest thing to happen in Thor Ragnarok. Weird doesn’t even cover it. It took me about half way through to really start enjoying Thor but once I did I could appreciate it. Pure fun. Marvel loses itself when it gets all dark and dreary taking itself way too seriously but this is peak Marvel. Full of life and immensely entertaining and if there was ever a better use of Led Zeppelins Immigrant Song in a movie I’ve yet to see it. Easily beats the first two Thors combined, recommended to all the Superhero fans."]},
{"content": [" "], "expanded_content": ["In spite of efforts to inject humor into nearly every scene my full theater was for the most part quiet. The \"Less is More\" philosophy should have been used here. Hulk and Thor tossing it back and forth like the Odd Couple was not funny. Mark Ruffalo can't do comedy and was clearly uncomfortable trying (and I love Ruffalo's Hulk more than any other). I think the funniest characters in the movie were Korg and the short and sassy Kung-Fu slug that followed him around. The rest of the characters should have spent more time building up the gravity of scenes that should have brought out some tension for the audience (Odin, Thor's Warrior Three, Skurge, etc. Finally, there were two cut scenes at the end that were not worth waiting for. Thanos should have appeared in one and a second should have confirmed what the movie suggested...Loki pocketed the tesseract."]},
{"content": [" "], "expanded_content": ["Obviously much better than both Thor(2011) and Thor: The Dark World(2013). A hell of a lot of humour which makes it one of the funniest movie of Marvel Cinematic Universe(MCU). A great job by the director Taika Waititi.", "Last both Thor movies were kind of dark and intense and more dramatic while the Thor: Ragnarok is totally opposite from the prequels.", "This movie gives you the colorful cosmic universe of MCU, great fights, a much better villain (Hela) than Malekith, Loki, Thor, Hulk and also Korg. It's an awesome movie for MCU and Marvel fans."]},
{"content": [" "], "expanded_content": ["First of all here are synopsis for for both the first Thor movie and Thor Ragnarok. \"Thor is stripped of Mjolnir and cast on a distant planet where he embarks on a journey of self rediscovery. The locals keep comedically tazing THE GOD OF THINDER as he forms a new band of friends that help him fight his way off the planet. He returns to Asgard in time to fight a deranged family member out to grab his throne in decisive brawl on the famed Bifrost bridge\" ....Movie critic Chris Jordan says it's a fresh take on the Thor character. On the other hand I really wanted this to be another LOGAN level good Marvel movie but this movie is barely a even a parody. First of all, calling what is essentially an action COMEDY an apocalypse or \"RAGNAROK\" is Ironic enough but here's what I walked out of the theater with. 1- Regular Machine guns work wonders at mowing down Asgardians. 2- The Cosmic Superpower planet known as Asgard apparently has a population of no more than 2 thousand. They literally walked a 2 lane wide bi-frost bridge and evacuated the planet using a single ship. Couple that with the fact that their best resurrected warriors were manhandled by a guy with 2 machine guns and I can see that conquering New York in \"The Avengers\" was REALLY AMBITIOUS. 3- I don't know who Thor is!!! a rugged warrior, a whimpering baby in the face of a haircut or alien goo, an Obnoxious brat, a self sacrificing hero, a wise and intelligent prince/king, a colossal idiot repeatedly and hopelessly performing black widow's lullaby for the Hulk? 4- Dead father, dead companions, destroyed planet, b#@ch of sister, crumbling throne. Screw it. Lets crack jokes for the audience. (That really did it for me). 5- Loosing an eye is a prerequisite to ruling Asgardians (the 349 ones left anyway). 6- We just blew up out planet to win (Wait what!!!!!). where to mate??? Well take us to earth. They love me there. We'll crash the entire planet's population in the new Avengers headquarters till we figure out what's what. This Movie has no sense of it's characters or it's events or its background or its purpose and it would literally sell you a dead family member's corpse for a joke, albeit a bad one."]},
{"content": [" "], "expanded_content": ["Managing to turn what was previously the least liked character of the MCU into one of the most human and well-rounded, Ragnorok takes the best qualities we’ve come to expect from a Marvel movie and expands on them, allowing for a fun, exciting adventure through the cosmos. This was a very surprising film, as when I had heard of a third Thor, my reaction was short of “Oh, Great”. But within the first ten minutes, a much more light-hearted and tongue-in-cheek tone was established, and it felt like a nice change of pace. Taika Waititi’s direction is incredibly strong, and his understanding of the need to expand on the central character is huge in making the story work. All of the performances are fantastic, the visuals are stunning, and the adventure feels fresh and exhilarating. Ragnorok is definitely a must-see."]},
{"content": [" "], "expanded_content": ["THE best Marvel movie to date.", "Fun, retro and interesting, accompanied by an amazing music and picture quality.", "3D is not a MUST but you would enjoy iMAX experience for sure!", "Story is way better than Thor 2 or even 1. Few plot twists and yes... 2 post credit scenes.", "First 1 hour of the movie is by far the craziest, really cool stuff and last 20 min is also amazing. Overall movie kept you engaged pretty much all the time.", "No dragging out. Amazing"]},
{"content": [" "], "expanded_content": ["Thor: Ragnarok is a really fun and entertaining instalment in the MCU. It has a lot of funny and entertaining moments that make it very enjoyable to watch. It looks stunning as well; with bright and colourful locations that make it appealing to the eye. The character development and relationships are well written making the story engrossing. The action is great, especially the final showdown. And the music choices are pretty awesome, adding epicness to the action sequences. The CGI can get a bit over the top at times, but thats my personal taste. Overall its great, thoughtful and thoroughly entertaining."]},
{"content": ["The movie is not bad, the problem is they did´nt take anything seriously and points more to comedy. However, one may be grateful of vigorous sequences of action and Cate Blanchett who plays an astonishing villain."], "expanded_content": []},
{"content": ["I'm sure, my ten years old son would love this movie's humor. I hated it. Seriously, it's unbelievably stupid."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Definitely the best Thor movie.", "The stakes are actually the highest ever and they don't sabotage the humor to show it, with Thor being the center stage of huge character development and Valkriye stealing the show. The inclusion of Hulk was perfect but i really think that at this point, Loki is pretty much useless, even though i enjoyed his presence.", "Hela was a step up for most villains, i mean, she broke Mjolmir with one hand, that already made her into one of the best villains the MCU has had over the years"]},
{"content": [" "], "expanded_content": ["Thor Ragnarok, unlike its predecessors, is a genuinely entertaining movie. Gone are the oh-so-serious plots and dark brooding monologues. Hell, they even parody the ending to Thor 2 within the first 20 minutes!"]},
{"content": [" "], "expanded_content": ["\"Thor: Ragnarok\" was definitely worth seeing. The storyline has the typical \"Jerry Springer\" family drama of all the Thor films.  It has the special effects and action that you would expect from any Marvel film. Even better, the laughter was almost non-stop. The soundtrack had some interesting choices from Led Zeppelin to Willy Wonka.  Jeff Goldblum's performance is icing on the cake."]},
{"content": ["Moderetally epic and very funny movie, one of the best marvel movies for me, watched in one breath, you must buy a ticket to cinema on this movie.", "Its not a MASTERPIECE 12/10, but it is very cool."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Thor Ragnarok felt like a group of special friends coming together and bringing their geniuin funny and quirky personality in the form of a marvel character. The visuals are great and the comedy is similar to the one in Guardians of the galaxy but I feel like Europeans will like it more because it feels even more natural than in Guardians 1 (Where Guardians 2 is an example of a forced and scripted comedy)."]},
{"content": ["Great Movie! Easy to get into, amazing fights and a fantastic plot twist. It is a movie that your family or friends that aren't familiar with the Marvel heroes that can easily understand and love this movie"], "expanded_content": []},
{"content": [" "], "expanded_content": ["This was maybe the most fun Marvel movie I've seen.", "Positives:", "- The humor was great and didn't feel forced.", "- Easily the most personality and the most I've empathized with the Hulk (in particular) and Thor", "- Great side characters: Korg, Heimdall, Skurge, Surtur, Valkyrie, etc. really fleshed out the movie and didn't feel like filler (looking at you Kat Dennings)", "- Jeff Goldblum killed it", "- Awesome special effects, fight scenes, and sets. I loved the fantasty/sci fi mash up", "- No shoehorned romance", "- Clever twist in the climax", "Negatives:", "- Cate Blanchett was great, but Hella still fell into the \"bland Marvel villains\" camp. But she was probably the best Marvel villain in awhile."]},
{"content": [" "], "expanded_content": ["Good movie. Not as good as everyone is saying it is, but certainly better than the other 2 Thor movies. Bruce Banner was by far the worst part, and many jokes were predictable. I hoped more out of this film, and as good as it was, failed to entertain me as much as I though."]},
{"content": [" "], "expanded_content": ["This movie is really good! Easily the best Thor movie to date, the environment and characters actually are really fun and engaging! While at times the comedy feels forced and the movie itself can feel like Guardians of the Galaxy 3, it's still a great film to go see in theaters."]},
{"content": ["First half entertaining. Then the cringe factor goes through the roof. Conclusion: typical Marvel flick"], "expanded_content": []},
{"content": [" "], "expanded_content": ["If you don’t usually go to see Marvel films but you saw, like I did, that this one got good reviews, be warned. This is a juvenile movie, and I say this as someone who often enjoys films for children. This one is loud and colorful and silly (forget anything close to wit). And you will probably have children crawling over you to go to the bathroom every half hour or so and buy food since they may be as bored as you are. But I am grading this not on my tastes, but on its merits as a movie. It has a coherent plot (more or less) and the dumb jokes are at a minimum. It is full of A-list actors who keep their faces straight and don’t camp things up. It is loud and colorful, although I wasn’t too impressed with the special effects. So purely as a movie, it is a decent job. Just be warned that if you are not into Marvel or are older than six, you may be very bored once you’ve identified all the famous actors and the action takes on  a repetitive pattern of danger – danger overcome – danger -- etc."]},
{"content": [" "], "expanded_content": ["Worst Marvel movie since Iron Man, it was a clear step down from Thor and Dark World. I never laughed at all in this movie when I saw this last night. Horrible cast, especially Jeff Goldbloom, Hulk and the ugly Tessa Thompson. I also really disliked Matt Damon's cameo, I hope to not see him in future Marvel flicks."]},
{"content": ["All of this Marvel franchise is pretty bad, and now this one is outright comedy of a camp level to maybe match what the dreadful \"Superman III\" was to the sub-genre in its time.  Only geeks will find this loud, formulaic bore funny and entertaining."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Went last night thinking I'd get a much needed laugh and was severely disappointed.    Not only is TR not funny, it's Fuller House not funny.  This movie wants to be GTB in the worst way and we all know what comes from trying to hard and being something you're not.  The glowing reviews seem dubious now, even payola-ish.   I can't recommend even waiting for this to make it to Netflix.   Not even Hulu free worthy.   Save your money and most impoartantly, save your time.   TR is a cynical money grab."]},
{"content": [" "], "expanded_content": ["lindos efeitos, uma bela vila, tudo poderia ser perfeito, mas a marvel parece querer exagerar em comedia e nos forçar cenas \"engraçadas\" fazendo muito momentos do filme serem bobos, quando poderiam ser muito mais bem explorados, no fim uma otima proposta se tornou uma piada"]},
{"content": ["Best Thor Movie and one of the best Marvel movies by far, you won't stop laughing. Great work of Waititi, I hope more Marvel movies directed by him. Good work!"], "expanded_content": []},
{"content": [" "], "expanded_content": ["This is one hell of a great movie. Personally I had so much fun watching this Thor: Ragnarok. From the Visuals to the Music to the acting everything and everyone delivered. I was not a huge Thor fan based on the previous movies he appeared. However, after seeing Ragnarok,Thor has definitely grown on me. Congrats to everyone involved for making such a good movie. Double Thumbs Up for them!"]},
{"content": [" "], "expanded_content": ["It was about an hour in when I realized this movie was terrible. The only thing that separates this movie from the likes of Paul Blart, Jack and Jill, and Big Mommas House is the decent but not great action set pieces, mainly towards the end. Other than that it felt like a parody on Thor, like they were trying to make fun of him and the other characters and turn them into jokes. Jeff Goldblum was downright cringey at times, Thor was a buffoon, Hulk was a buffoon, there is zero character development given to the characters other than Thor and Valkyrie, who I felt was wrongly casted. The only emotionally touching moments in the film, which were few, were quickly ruined by a terrible out of place joke. The one person who they could and should have made serious was Hela, but they turn even the Goddess of Death into a joke machine. Now for the most part I've enjoyed the MCU movies, but I for one was looking forward to a more dramatic and epic take on Ragnarok and felt backhanded after seeing this. If your a comic book fan or a fan of good movies, please for the love of god do not watch this. If your looking for two hours of stupid fun and have money to burn, then by all means."]},
{"content": [" "], "expanded_content": ["My wife likes these superhero movies, and I'm generally not a fan, but since I love her, and want her to be happy I take her to whatever she wants to see.    We usually take turns picking the shows, and for every \"superhero\" movie, I usually choose a biopic or something wonderfully weird, like a Coen brothers film.    So not expecting anything besides the special effects and usual cliched dialogue (if I hear the word \"destiny\" one more damn time . . .) I was pleasantly surprised to find that \"Thor: Ragnarok\" was actually a pretty decent movie.    Following the success of the \"Guardians of the Galaxy\" series, the folks behind this movie opted for a lighter and more humorous approach but still kept the special effects dazzling as the other \"Thor\" pictures have been.    So while we get the usual plot, Thor vs. The Hulk gladiator duel notwithstanding, of Hela, the Goddess of Death (boo) whom, after Odin dies reappears and promises the utter annihilation of Asgaard and the universe, one presumes.    So leave it to Hammer Boy and the wishy washy Loki, always well played by Tom Hiddleston to figure everything out and save the universe yet again.    That plot has run its course and I deduct two stars for what has become one of Hollywood's lamest cliches for sci-fi and superhero movies.    What saves it though as I said before is a fresh injection of genuinely funny material, even if it is derivative of \"Guardians\".    After all, humor was not invented just for that pair of movies, but it certainly made the difference between another outer space yawner and a brilliantly hilarious pair of movies.    I do not want to spoil the main parts of the movie that aren't part of the old tried and true formula, but it is indeed fun to see that even superheroes can screw up.    A portal between one planet run by a deceptively evil character played by Jeff Goldblum and Asgaard is referred to as the \"Devil's Anus\", and immediately I could think of a few towns and cities I've been to or worked in that deserve that title themselves.    So if you like the \"Thor\" series anyway, you'll be happy with this one.    If you're like me and are long tired of this genre, with the exception of the unexpectedly good \"Wonder Woman\", at least you'll get some good laughs from a movie of this type that for once doesn't take itself too seriously."]},
{"content": [" "], "expanded_content": ["Not the absolute thing of beauty that rave reviews are making it out to be, but still good. It lagged a bit in middle, and seemed to go round in circles. And it doesn't top Civil War, Marvel's high point so far, but is a worth additional to the library. I can't help thinking though, where to from here - copy this film's style and cash in, or leave at a stand alone achievement that is part of the Thor trilogy in name only."]},
{"content": ["Marvel is usually at it's best when it doesn't take itself too seriously. If you liked any of the other Marvel movies give yourself a treat and go watch it straight away. Extremely entertaining!"], "expanded_content": []},
{"content": ["Solidifies Taaka Watiti's reputation as an excellent comedy director while bringing his film making into the mainstream. Though somewhat inconsequential, this film manages to entertain long enough to justify its lightweight nature."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Thor Ragnarok made the wise move to take Thor himself to a more introspective place while outwardly changing to more of a comedic tone. Chris Hemsworth is clearly at home doing this and the rest of the cast are clearly having a blast. Even though there are some flaws, the characters, humour, action scenes, and spectacle are all top notch and this was an outright fun movie to watch. Korg is one of the best and funniest supporting characters in a long time."]},
{"content": [" "], "expanded_content": ["It's the best Thor/Marvel movie to date. Why? Not predictable, funny, and good acting. It was a little self-aware for my taste, especially the aside moments when they just say things to get the audience to laugh, but the film didn't suffer on the whole from it. The message of people being more important than a place was an unexpectedly refreshing thesis. Recommend it."]},
{"content": [" "], "expanded_content": ["'Twas Good af......................................................................................................... Sorry about the periods i'm trying to fill blank space. I gotta blank space baby, and I'll write your name. Wait a minute. Nice to meet you, where you been?", "I could show you incredible things", "Magic, madness, heaven, sin", "Saw you there and I thought", "Oh my God, look at that face", "You look like my next mistake", "Love's a game, want to play?", "New money, suit and tie", "I can read you like a magazine", "Ain't it funny, rumors fly", "And I know you heard about me", "So hey, let's be friends", "I'm dying to see how this one ends", "Grab your passport and my hand", "I can make the bad guys good for a weekend", "So it's gonna be forever", "Or it's gonna go down in flames", "You can tell me when it's over", "If the high was worth the pain", "Got a long list of ex-lovers", "They'll tell you I'm insane", "'Cause you know I love the players", "And you love the game", "'Cause we're young and we're reckless", "We'll take this way too far", "It'll leave you breathless", "Or with a nasty scar", "Got a long list of ex-lovers", "They'll tell you I'm insane", "But I've got a blank space baby", "And I'll write your name", "Cherry lips, crystal skies", "I could show you incredible things", "Stolen kisses, pretty lies", "You're the king baby I'm your Queen", "Find out what you want", "Be that girl for a month", "Wait the worst is yet to come, oh no", "Screaming, crying, perfect storm", "I can make all the tables turn", "Rose gardens filled with thorns", "Keep you second guessing like", "\"Oh my God, who is she?\"", "I get drunk on jealousy", "But you'll come back each time you leave", "'Cause darling I'm a nightmare dressed like a daydream", "So it's gonna be forever", "Or it's gonna go down in flames", "You can tell me when it's over", "If the high was worth the pain", "Got a long list of ex-lovers\nThey'll tell you I'm insane\n'Cause you know I love the players\nAnd you love the game\n'Cause we're young and we're reckless\nWe'll take this way too far\nIt'll leave you breathless\nOr with a nasty scar\nGot a long list of ex-lovers\nThey'll tell you I'm insane (Insane)\nBut I've got a blank space baby\nAnd I'll write your name\nBoys only want love if it's torture\nDon't say I didn't say I didn't warn ya\nBoys only want love if it's torture\nDon't say I didn't say I didn't warn ya\nSo it's gonna be forever\nOr it's gonna go down in flames\nYou can tell me when it's over\nIf the high was worth the pain\nGot a long list of ex-lovers\nThey'll tell you I'm insane\n'Cause you know I love the players\nAnd you love the game\n'Cause we're young and we're reckless\nWe'll take this way too far\nIt'll leave you breathless\nOr with a nasty scar\nGot a long list of ex-lovers\nThey'll tell you I'm insane\nBut I've got a blank space baby\nAnd I'll write your name"]},
{"content": [" "], "expanded_content": ["Melhor filme do thor. Achei uma dos melhores da marvel tambem. Ele tem suas cenas de humor, as vezes o tempo inteiro, o que pode cansar um pouco. Mas nao tira o brilho do filme. Ao meu ver, esse foi o verdadeiro thor que os fãs queriam ver há muito tempo."]},
{"content": [" "], "expanded_content": ["Thor Ragnarok by far surpasses every expectation of any Thor film. The film has everything you could want to continue the MCU with action,heart, and of course comedy. Thor Ragnarok is a well structured action packed cleverly funny film for everyone to enjoy. The entire cast puts on great performances and the journey of Thor here is the best of the films. However it does not fit well for new comers who have not seen previous marvel adaptions. Another issue is that Thor Ragnarok's development of the villain \"Hela\" could have been much better fleshed out. Other than that Thor Ragnarok exceeds all of the Thor films by far, and is a hilarious, action packed, visually pleasing adventure to add to the MCU."]},
{"content": [" "], "expanded_content": ["Easily the 2nd biggest let down in movies (Star Wars: Phantom Menace #1). Expected an Epic adventure to stop the utter destruction of Asgard, instead we got something along the lines of the 5th Element merged with X-Men the last Stand. Over the top non-stop Humor runs contrary to everything Thor has ever been in the comics.  I remember reading the run of Ragnarock in the original Mighty Thor comics and This movie lives up to no part of it. Humor, even with the Death of Odin, Humor, even with the destruction of Mjolnir (dumbest move ever) Humor, as Surtur (who is basically non-exist in the film) drives the Twilight sword into Asgard and destroys it (umm, wasn't there supposed to be demons and fighting, not just insert Sword here).  Korg, the great leader of the gladiator resistance turns out to be nothing more then some dim witted \"Spicoli\" wannabe. Hela, the great goddess of Death (and Loki's Daughter not Odins) whos great power is to shoot swords at people...What???? Probably don't need to address Jeff Goldblum...who is pretty much Jeff Goldblum, and that's not a positive. This movie teases you with so many things you always wanted to see on the screen, and delivers on none of them. We get to meet Skurge,who is anything but an Executioner, only for the Purpose of seeing him Die (and to capture one of the Epic comic panels of all time). have I mentioned the non-Norse like continuous humor, the destruction of Mjolnir, Hela shoots swords, characters are introduced and everyone dies without putting up any real fight (X-Men 3).  This movie, which fans hoped would finally gives us the God of Thunder and be the savior of the Franchise, instead is the death of the franchise.  Helmed by a director who seemed so busy telling jokes he didn't have time to actual read any of the comics, so instead showed you some Fanboy visuals then blew it all up. (a-la Ratner)  Anyone who read the original run should avoid this movie at all costs.  Your kids will enjoy the Shumacher-esk bright colors and frat boy humor.  By the way, your fighting the Sword shooting Hela, but walk past every powerful artifact in Asgards vault and instead choose to release Surtur and blow up Asgard...which apparently isn't a place but a people.  How has the MCU fallen so fast.  Guardians of the Galaxy are great movies, but it's Humor and pace should is cancerous to other Marvel Characters."]},
{"content": ["If films were always this fun, the movie theatres would always be full. Many laughing out loud moments, a lot of great action and some really great characters."], "expanded_content": []},
{"content": [" "], "expanded_content": ["There's some sort of civilization-saving plot that also results in Thor cutting his hair , while losing his hammer and an eye. The story isn't important, but several things help this latest Marvel flick stand out: the irreverent sense of humor (thanks to director Taika Waititi) and the performances of Cate Blanchett (deliciously sexy and wickedly evil) and Jeff Goldblum (playfully off-kilter). There also seem to be fewer big action scenes (none of them especially memorable) and more dialogue (sometimes amusing, sometimes serious). It may be more fun, but it's still got lots of the genre trappings. NOTE: Stay thru the credits to see what happened to one character."]},
{"content": [" "], "expanded_content": ["Mindblowingly good. If you liked Dr Strange and Guardians of the Galaxy, this movie will blow your mind. All of the Thor sequels so far have been very good, but this one takes it to another level.", "The writing and acting are top notch throughout, with some amazing guest appearances. All characters are smart and have perfectly consistent motivations, photography and scoring are impressive.", "It amazes me that Marvel can produce TV as bad as Defenders and then turn out movies of such brilliance."]},
{"content": [" "], "expanded_content": ["One thing I love about the Marvel Universe is that it is always trying to evolve. No matter how big the last box office or how good the last movie, with each film it is is always trying to get bigger, better, and even re-invent itself. With that however there is always a danger of going too far, and when it comes to their latest film, Thor: Ragnarok they came close. In his third installment Thor learns he must face his greatest foe of all, his long lost sister, who had been locked away millennia ago. She is said to be stronger than even Odin himself and casts Thor and Loki out of Asgard, where they wind up on a strange world, where Thor is forced to compete in a battle royal against an old friend. Thor has always featured arguably the best special effects in the Marvel film franchise, and at least to me, has always been more Science Fiction and therefore the least realistic of any of their modern characters. In an attempt to humanize him more and make him a little more friendly to general audiences, Marvel added a ton of humor to the character in Ragnarok. While I agree, Thor was a little dry, he always had his own wit to him, and by adding all the humor to the character I felt as though it took away from his mystique. Marvel is also using a lot more crossover material in the individual films than they have before. While the followers of the universe love it and call for more, this tends to confuse general audiences, who don't necessarily go to see all the Marvel films. It's a fine line that has to be drawn between pleasing the fans of the universe and the general audience, in order to keep the enormous box office. This time, they managed to tow the line, but the direction suggests that next time they may not be so lucky. As for the cast, again Marvel proves that when it comes to casting for their characters, there is no one better in the business as even Jeff Goldblum fit his role like a glove. Their was a little too much humor for my taste, Thor isn't Deadpool or a Guardian of The Galaxy, but by and large it was still a very enjoyable film. Truth be told, I was far more interested in the after credits scene then I was by the collaboration of Hulk and Thor or the resurgence of Hera."]},
{"content": [" "], "expanded_content": ["This movie was one of the more enjoyable Marvel movies ever made and when I got out I wanted to know who played one of my favorite new characters in the movie. What I found was that the director Taika Waititi voiced not just that character but another one as well. Then I found out he also co-wrote and directed the movie I was enamored with recently, \"What We Do In Shadows\". Shadows is genius in all the silliness it portrays in a mockumentary about a house of vampires. So I was elated to also read that they are planning a part 2. Yesterday I did know who Taika Waititi was, now I want to watch every project he is involved with.  Thor: Ragnarok is the funniest superhero movie ever made, and while you will not slap your leg and laugh uncontrollably, you will smile and chuckle throughout. If you like these type of movies, this is the one for you.  If you never seen one of them before, perhaps this is the one to take the chance with.  Best superhero movie eva! Taika Waititi, you are now and forever on my radar."]},
{"content": [" "], "expanded_content": ["The funniest Marvel movie so far. Taika Waititi delivers one of the best Marvel movies that goes against what we've seen so far. The tone of the movie changes completely from the previous Thor movies but that makes it so much better. The improv in the movie helps take it to the next level. The visual are incredible , with bright colors and stunning environments and cities. Must watch."]},
{"content": [" "], "expanded_content": ["Mate, so this film has been getting quite an interesting amount of mixed praise and criticism. So, i wanna, very briefly, explain why this is one of the most diverse and interesting Marvel films to come out in most recent time. By explaining, being a big fan of Taika's films, how he plays with comedy in the mundane, and highlights the absurdity of the superhero genre by taking a much more lighthearted comedic tone. In spite of life-threatening events, to paint a picture of hope and optimism through these quirky big macho men, and has fun with the fact that the circumstances and the characters from these superhero films are absurdly silly, eg, Hulk is a big green man and Thor is a God and they battle evil cosmic people that wear bright colourful clothes and work with the embodiment of patriotism of america who is actually kinda from the 40s... its all kinda crazy....", "Thor Ragnarok is a colourful, vibrant, comic book film that I think is sensational. Im gonna actually probably create a video-essay of a sort about this. Because I loved the flick."]},
{"content": [" "], "expanded_content": ["I like Thor movies. I really do. There is however a few problems I have with this one. Ragnarok made a huge damage to the original characterisation. Thor is not behaving like a noble king anymore, but sports the big bro/guy next door attitude. Loki, charming as he may be, is in this movie reduced to a sidekick punchbag. I think they wasted a great opportunity at making a really good deceiving game with Loki in disguise as Odin. They completely ruined Branaghs initial Shakespearean feel to Thor movies we all loved to make a Guardians like comedy out of it & it was too much. I would love a darker athmosphere considering this is a movie about the end of the world (or realm in this case). A lot of jokes didnt feel right for the situation they were used in, especially the Korg ones at the end trying to downplay the destruction of Asgard."]},
{"content": [" "], "expanded_content": ["Thor gets a haircut, looses his eye and hulk ass is there to see in all its glory... In addition to his bad ass sister appearing kicking everyone’s ass.  What more do you want?  How about comedic relief and an abundance of new colorful actors.  The movie starts off strong and ends strong... I wasn’t expecting much but Thor and Hulk are a match made in heaven.  The bromance is alive... Seems Marvel watched a few telenovelas when producing the story, but hell its such an emotional rollercoaster.  There are a lot of wtf! just happened moments to \"oh no she didn’t.\"  If I were the stereotypical black woman sitting on the back of the movie theatre you would hear, \"oh hell no...\" It’s such a great movie, it’s like visiting your mom for the holidays and eating home cooked food, no five star restaurant could match.  Go watch it now, I haven’t been to the movies in three years so getting my lazy butt up to go watch it was worth it.  Trust me when I say this, you will tear up as I recently lost my father.  Happy Holidays ^.^"]},
{"content": [" "], "expanded_content": ["Thor Ragnarok was very entertaining! I was laughing most of the movie. It felt more like a Guardians of the Galaxy movie than a Thor movie. The 80s vibes were great. The villains were fairly unremarkable, but the characters and their humor carried this film. Hulk was better in this than previous avengers films in my opinion. While the movie was very funny, I feel that some of the more serious moments get lost in humor, which can take away from the depth of the MCU. Great movie!"]},
{"content": ["better than 2nd but not as good as first.", "trying a bit too hard to be funny.", "and not as good as either critic or user reviews suggest."], "expanded_content": []},
{"content": [" "], "expanded_content": ["I knew that the movie was going full comedy with a twist of an indie production, but sadly we found a very similar movie to Guardians of the Galaxy Vol.1, having many similarities in the design of the cities, clothes and spaceships. We lose what made Thor movies interesting, and that's the nordic references. Loki plays his most boring role in the MCU, he basically does nothing related to the plot, just repeating the same \"I hate you\" actions as always. However, Thor does evolve, having a more interesting development in his relations with other characters. You will have fun with this film, but it's far from the best of Marvel movies."]},
{"content": [" "], "expanded_content": ["Hmm, where do I start? The Thor Franchise (And \"The Incredible Hulk\", to be fair) has been rather forgettable and OK at best. \"Ragnarok\" definitely changed that. The third trilogy of the OG MCU squad delivers in action, comedy, and story line. Not only is this one of the funniest MCU installments, but also one of the best. The cast is excellent. Seems like Marvel is getting every A & B list actors possible. This time, they brought in the likes of Cate Blanchett, Tessa Thompson, Karl Urban, and Jeff Goldblum (!) to join the already crowded cast (Hemsworth, Hiddleston, Elba, and Sir A. Hopkins, plus Ruffalo). They all shine in their respective roles. The character Valkyrie makes fans demand her own movie, for good reasons.", "Not all the humors work, but when it does, it's really funny. And unlike most MCU movies, Ragnarok is quite colorful (Just like Guardians of the Galaxy Vol. 2). The ending surely makes us extremely hyped for the upcoming Avengers: Infinity War movie. Oh, and there are some surprising (And hilarious) cameos too. Don't miss this movie, go watch it!"]},
{"content": [" "], "expanded_content": ["Is far better than I expected however is not so good like everyone pretend. To anyone who ever read the comics notes a great difference between MCU and the editorial arcs, but to be an adaptation and a mix of several stories the movie is pretty decent. The moments between Hulk/Banner and Thor with a few white jokes makes the movie fun for moments, a little bit delirant for others. The flip of Loki something that you can see it coming from far away is well executed and the death of Odin is ok.", "At the end is a movie that you can see one in the cinema, and two.. maybe three times in the Tv because you was doing zapping and suddenly remember that funny escene that you want to see again. Is not a masterpiece, is only another disney MCU movie"]},
{"content": [" "], "expanded_content": ["The best parts of this movie were clearly in the direction. Taika Watiti is quickly becoming one of my personal favourite directors for his directing style, it seems he could turn any awful script into a genuinely heartwarming and entertaining movie. However the main issue with this movie is contrast between the tonal choice and the actual premise of the movie. While toned as a buddy comedy type film, it feels strange for a character like Thor to change from serious and proud to a wise cracking, comedian. However on the topic of comedy this film provided me and the audience with a number of laughs and really worked in that aspect. In conclusion Thor: Ragnarok is an extremely well directed movie, with a brilliant cast and only faulted by the strange tonal choices."]},
{"content": [" "], "expanded_content": ["This movie has a different flavor to the earlier Thor movies. Thor himself makes a lot of jokes too and I was little afraid that he wouldn't feel like the same character than before, breaking continuity. But his core heroic self is still present and his priority is still stopping Hela, not just to hang out making jokes. So the movie walks a tight rope between humor and serious business very well almost the whole time. Humor is wacky and fun, environments look pretty and rich, and there are some big stakes at the end. A very good blockbuster movie!"]},
{"content": ["I consider myself a DC fanboy, but I admit that I may start watching more Marvel movies after seeing this one. Hilariously funny & action-packed, Thor: Ragnarok really feels like something out of a comic book."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Definitely my top MCU film! Loved this film with all my heart. It was filled with great humor, story, characters, visuals, and music. I have never been let down by either the MCU nor the DCEU, fortunately, and this only cemented that opinion even more! All-in-all, I loved this movie, and I can't wait to see where the franchise goes from here!"]},
{"content": [" "], "expanded_content": ["Good movie over all but, Marvel, come on, the villain.  Just so bland.  Here is the problem, she doesn't do much.  Her dialogue is mediocre and her motivations are so damn predictable.  The fight takes too long and is over too fast.  Hulk was pretty good.  Banner was good.  I actually enjoyed everyone else in the movie.  A solid watch but not Marvel's A game."]},
{"content": [" "], "expanded_content": ["Trite, boring, cheap, cheesy, predictable. Tries to bring some humor to the Thor saga, but simply isn't funny. Characters enter and exit with little rhyme or reason. Set-pieces are decent, action is good, but the soundtrack is a massive fail. Go watch (or re-watch) Branagh's Thor film (which was the first one) if you want to see a good Thor movie."]},
{"content": ["If one word went into the describing this film...Spectacular...I've never seen a movie blend perfectly timed humor and great action so well. Easily one of the best superhero movies of all time!"], "expanded_content": []},
{"content": [" "], "expanded_content": ["Thor and Thor: The Dark World were two extremely underwhelming movies these being the (in my opinion) worst movies of the MCU. Ironically, Thor: Ragnarok is my favourite movie from all the MCU since they broke the same old \"marvel movie formula\" and tried something new and refreshing.", "Pros", "+ Amazing performances from all characters!", "+ Great mixing of universes (GotG and Thor [even that we knew from before that they are part of the same unvierse it now actually looks like that])", "+ Great use of soundtrack", "+ Superb practical outfits (citizens from the planet)", "+ Top notch Hulk CGI", "+ Refreshing changing the usual Marvel formulae", "+ Great villain", "+ Korg", "Cons", "- Weak CGI for Surtur", "- Not much development on Hulk's side (Even that this is a Thor movie, since the story was adapted from Planet Hulk it was needed to have more Hulk)"]},
{"content": [" "], "expanded_content": ["Congratulations! We have proved the ecuation: Thor + Guardians of the Galaxy= The best thor movie. Don't get me wrong,  I liked Thor: Ragnarok, I thought it was fun, colorful, funny, awesome, and the best Thor movie by far (not that it was that high bar). But, this is barely a Thor movie, it is Guardians  of the Galaxy with a Thor paint job, in some parts even too much. Even with that, this movie is a good marvel movie and worthy in the MCU, and about what I expect for Marvel by this point. Final verdict: 7.5"]},
{"content": ["Just one of the funniest movies of 2017. Amazing fights and pew pew stuff. The art and colors are adorable, really refresh the superhero genre. Entertainment at its highest level: Go for it."], "expanded_content": []},
{"content": [" "], "expanded_content": ["The Thor Hulk fight was cool as hell, even if it was a little simple, it looked incredible. They gave it a definitive space pay per view filter or something. It looked awesome. Hela was cool as well. AND HERE's my biggest defense for the whole movie: Thor himself was great. It felt Waititi designed the whole process of the movie on getting who Chris Hemsworth is, how (Chris Hemsworth) HE sees Thor not how Kevin Feige or Marvel or we the fans have told him to act. How he could actually connect with a Thor he was frankly disconnected from more and more. And I think in this aspect for what the movie is, they had a freaking home run. Hemsworth is fresh again and better than ever. He is awesome, he is Thor and he enjoys it. It feels more like a psychological acting directorial procedure milestone more than a movie merit. But directors should look at whatever Waititi did, because he might have unlocked Chris Hemsworth potential to be awesome to watch on camera. There you have something I can not stop giving props to. Funny and exciting along the way!", "Many people did not expect the Thor franchise to be part of the MCU, and I never watched or read anything from this. But when I saw the hammer at the end of Iron Man 2, I was excited. Honestly, the 1st movie did not disappoint me. But it fits into the poem. The second movie has a weak villain. But it's still fun. For this 3rd item .... Yes, much fun! It's Thor, by The Guardians of the Galaxy, but in a non-literal sense.", "In just two hours, it moved between the new Asgardian planets and returned to Asgard, with a quick stop at the world with a soft beat and a quick feel.", "Once again, Chris Hemsworth and Tom Hendlston knocked it out as Thor and Loki in the park, respectively. They were also characters from the first film. But they have evolved so clearly they are not in the groove. Cate Blanchett as Hela is an interesting mix of introspection, distant, and Cate. Just reveling in her role, she is always winning. Actors who return to work have been excellent, returning performers, as do Chris and Tom. The newcomer brings his own flavor to his character, especially Karl Urban. What will he be? But the villain was throwing. Surprised me (The only negative critic is the voice of the Hulk, but it does not sound right for some reason.)", "The horrific impact that Marvel has had on delivering no complaints. Asgard looks beautiful even as it is smashed. Sakaar, the new planet that we have seen, can be described as a beautiful trash can. It's just like Ancient Vegas Vegas, surrounded by landfills in the US. It's not boring at all. All kinds of creatures and scenery look good. It is difficult to choose what is useful and what is CGI.", "The song is a combination of previous songs and music, with new editions that help to separate each situation.", "Overall, Thor Ragnarok is colorful, surprisingly fun, and surprisingly strong for a Thor franchise worth 4 stars out've 5 within the first half. Now bring Infinity War!"]},
{"content": ["One of the best movies to come out this year. This movie is guaranteed to make you laugh and have a great time at the theater. So round your friends up for another good time from Marvel."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Story : This Thor series probrably the best way to show both Thor's and Loki's love and hate relationship", "Pacing : Theres no any moment where i feel bored. The pacing isnt too fast and too slow either. A perfect one", "Animation : Great", "Action : Great", "The joke is nice as well, but kinda forced. Its still fit the story pretty well", "overall : Great movie"]},
{"content": [" "], "expanded_content": ["Thor: Ragnarok is the best of the \"Lord of Thunder\" trilogy.", "He is the opposite of Iron Man movies, where the first two films are very good and the last one is weak.", "The movie has a touch very similar to Guardians of the Galaxy, maybe that's why the public liked it more than the previous two. I like them all, but this one is much better, I have to admit.", "The level of comedy and action are very well synchronized, which is the specialty of Marvel movies, by the way.", "The story was beautifully built, and every detail makes me think how cool it is to see the interconnection with this shared cinematic universe.", "For me, they should do more of this.", "Betting on something more \"light\" was a sure point, since the previous tried to be the \"darkest film of Marvel\" and is frowned upon by the fans.", "About the characters, I don't have much to say.", "They took the focus of Loki, which for me is important because he is very recurrent in the films of Thor and would be too saturated.", "Hela, the main villain, is a type of enemy I like to see, being quite powerful and really a threat to the protagonists.", "Usually, and for me, the villains in Marvel movies aren't that interesting or are underused.", "Hela was an exception.", "What she wants, she can do.", "Thor and Hulk are an incredible duo that I never thought would work.", "If I were in the movie, I'd be just like Hulk fans screaming \"HULK! HULK! HULK!\". In fact, my friend asked me about what I thought of the most talkative Hulk, and I said, \"He didn't talk like Bruce, he said the way he did, which was good for me. Was time for he starts to talk\"", "Finishing what I said and I want to say, Thor Ragnarok excelled in every aspect and managed to finalize with gold key the trilogy of the God of Hammers and a beautiful cliffhanger for the long awaited Infinite War.", "Even the songs are remarkable.", "Go with your friends and draw your conclusions, but I'm already saying that will not disappoint you at all"]},
{"content": ["Cool movie.If you like super hero based action flicks then you will enjoy this film.Thor & loki acted well but in my personal opinion valkyrie character played by Tessa Thompson was so exciting.Nearly high level entertaining film."], "expanded_content": []},
{"content": [" "], "expanded_content": ["It was just too damned silly.  The fights and the visuals and the scope were all spot on, but then a wowser scene is interrupted by gags out of the Three Stooges playbook.  I don't know why it is so hard for movie makers to find that sweet middle ground between \"grim as two days of constipation\" and \"dizzy slapstick\".  For all intents and purposes, all the characters took their zany and whacky pills, shedding any and all dignity or even coolness.  It was worth seeing, but I'm not collecting it (and I have Thor 1 and 2 in my library)."]},
{"content": [" "], "expanded_content": ["I usually don't like the solo-movies of the MCU. But THOR:RAGNAROK is not one more of the bunch. The humor is genuine (one of the weakest points of the MCU) and it don't overshadow the story as in movies like Star Wars: The Last Jedi. The plot and art characters are awesome, giving us EPIC moments and battles, it's just beyond. One of the best movies in the entire series."]},
{"content": [" "], "expanded_content": ["After the luke-warm reception to Thor: The Dark World, Marvel has decided to shake things up in a big way for the third Thor solo outing, borrowing a lot from the studio’s surprise hit Guardians of the Galaxy films.", "Director Taika Waititi has made a frantically paced, colourful, comedy with Ragnarok, and the result is both a blessing and a curse.", "‘Comedy’ is the operative word here, with virtually every character delivering punchline after punchline as Thor (Chris Hemsworth) embarks on a quest to save Asgard from the evil Hela (Cate Blanchet). While the comedy is for the most part great and definitely delivers a fun time at the cinema, the film’s need to get to the next laugh as soon as possible can sometime leave the dramatic or character elements wanting. While Thor, Loki (Tom Hiddleston) and the other Asgardian characters are dealing with some fairly dire circumstances and the potential destruction of their home, they’re never too far from cracking a joke. It’s ok that the film doesn’t take itself seriously, but the characters don’t take anything seriously either. Every time something potentially dramatic happens it’s undercut by a punchline. It’s as if Waititi feels the need to constantly remind the audience that ‘This is dumb, and you’re dumb for liking it’.", "Now if the alternative to the more comedic approach is The Dark World, (a grey, bland, melodrama with Kat Dennings for comedic relief) then I’ll take Ragnarok any day. However the balance is a little off here. The film tries to beat Guardians of the Galaxy at it’s own game, and doesn’t quite succeed.", "Visually, Ragnarok is definitely one of Marvel’s best entries, with a bright colour palette and some spectacular action sequences, the director uses every tool at his disposal to make each scene pop with on-screen creativity.", "The much advertised return of the Hulk (Mark Ruffalo)is a definite highlight. As Thor is flung to the far side of space he encounters his former team mate in an alien gladiatorial fighting pit and, of course, hilarity ensues.", "Hemsworth and Ruffalo are on great form and the film is at its best when they are together. While neither actor gets anything particularly dramatic to do, they certainly prove they have comedy chops. I for one would love to see some sort of buddy cop movie with these two.", "Likewise Hiddleston is always good value as Loki and while Ragnarok may not be the most witty outing for the God of Mischief, its always fun when the sons of Odin get together.", "The new characters also make fine additions to the growing universe. Jeff Goldblum isn’t so much acting as ‘being Jeff Goldblum’ as the Grand Master but that’s far more entertaining than him phoning it in like he did in last year’s Independence Day: Resurgence. Tessa Thompson’s Valkyrie does a lot with a small amount of screen time and while her arc doesn’t quite have the impact it should in her debut outing, it’ll be great to see how she develops in future installments.", "On the villain front however, Marvel is predictably lacking. Cate Blanchett should have brought some menacing gravitas to proceedings. Instead she is left on her own for most of the movie to monologue to a wasted Karl Urban (who really should have a bigger/better role in the MCU) and threaten extras.", "Where the film does triumph is its ending, as all the pieces fall into place for a final confrontation….and then things take a left turn. Obviously I won’t spoil the ending but its safe to say it did not go the way you’d think and we’re left in a very interesting place going forward.", "As with this years’ Guardians of Galaxy Vol 2, Thor: Ragnarok feels like an assault on the senses on first viewing, with so much going on at such a pace its hard to take it all in. Like GotGv2, I feel it will benefit from repeat viewings, although some of the laughs (of which they’re are plenty) will obviously be lost.", "A spectacular looking, funny, if somewhat superficial entry into the franchise, Thor: Ragnarok is a unique, crazy and most importantly memorable take on Marvel’s God of Thunder."]},
{"content": [" "], "expanded_content": ["Thor Ragnarok is much better than his predecessors, and this is because it was made with heart, freedom and passion. Taika Waititi does a great job of giving us a film that works individually and only takes advantage of her connection with the UCM to complement contexts and references. Finally there is a Spectator-Character connection with Thor (Chris Hemsworth) and Hulk (Mark Ruffalo). The villain Hela the goddess of death (Cate Blanchet) has a great participation, its foundations and intentions are clear, also the interpretation of Cate is perfect and the paper really fits. Loki (Tom Hidleston) as usual is a great character that develops slowly, but effectively.", "The film has a comedy context, thanks to its director (Taika Waititi - What We Do In The Shadows), the comedy is mostly a great success and contribution to the film, but certainly there are times where it is unnecessary and does not allow to develop to the movie emotionally.", "Conclusion: Thor Ragnarok is a relaxed, fun film, which was made with heart, freedom and is a great contribution to the development of character, however it has its flaws that almost always derive from its own comic context.", "Score:8.2/1.0"]},
{"content": ["Thor: Ragnorok is a fun movie that combines action with lots of humor. The characters are fun and interesting, the villain is convicing, and none of the jokes fall flat. 5+ stars!"], "expanded_content": []},
{"content": [" "], "expanded_content": ["\"Тор: Рагнарёк\" - один из лучших фильмов марвел! Не знаю почему его все ругают за кучу юмора, мне показалось его там не много. Злодейка в виде Хелы симпотная но немного сливная (как и половина злодеев MCU)  Тайка Вайтити принёс кучу нового в мир Тора. Кстати, сам Тор стал интересным стал персонажем, хотя раньше было как-то пофиг на него. Ну и конечно битва Тора и Халка, это было классно.  Минусы конечно есть, это в некоторых местах графика не очень и как говорил немного сливная злодейка."]},
{"content": [" "], "expanded_content": ["Thor Ragnarok is an unexpectedly funny return to the Thor trilogy. By far the best of the trilogy Ragnarok stands out because of its humor and color scheme. Many fans have complained that over the years Marvel films have acquired a generic feel and tone, however, Ragnarock is all style. The movie is one of the best looking Marvel films, besides the Guardians movies. It is also very humorous but juxtaposes that humor with some very great character moments that I haven't seen in a Marvel film in a long time. It's because of this blend of action, comedy, and drama that I think this movie is worthwhile. However, the movie is a bit unmemorable. Although it will have major ramifications in the MCU, it never felt very serious. The steaks in this movie are not high enough to get one invested really deeply in the overall plot. If it weren't for the humor, visuals and key moments between the characters we love, I honestly would've rated this lower since really the steaks diminish the overall plot of the film. Having said that, the villain was passable due to some connections to the main characters. Overall I believe this film is really cool, although not groundbreaking. It's not the best film in the MCU but it sure is fun. Final score 7/10"]},
{"content": ["The team at Disney and Marvel do it again.  Another blockbuster that will leave casual movie fans in awe.  Good story, fun action, and some superb jokes will leave the average movie goer delighted."], "expanded_content": []},
{"content": [" "], "expanded_content": ["A beautiful cosmic adventure. Marvel just fixed the Thor trilogy by introducing a new funny version. This makes the characters so realistic and exciting to watch. The antagonists are also multi-dimensional and different than the linear antagonists we usually see in the superhero genre. Even though below the tip of the iceberg there is some serious issue going on, the surface-level is so entertaining that the true meaning of Ragnarok is hardly noticeable. The soundtrack was perfect for the movie. Enjoy your 2 hour cosmic ride."]},
{"content": ["Thor: Ragnarok is one of the most entertaining movies of the year, certainly the best Thor movie, and one of the best marvel movies. Each performance was better than the next, and it was SO FUNNY!"], "expanded_content": []},
{"content": [" "], "expanded_content": ["Thor: Ragnarok is the breath of fresh air that the Thor franchise needed, honestly. The first Thor film was a serious toned take on the character with heart. The second film, The Dark World, fell short due to a boring antagonist and a plot that felt jammed in to just move the MCU along. Now thanks to the vision of Taika Waititi, the franchise is reshaped, tuned up, and defined.", "Thor is truly an interesting character, he's the God of thunder and he embodies that title whole-heartedly in this film. Loki is back and continues to be the MCU's most charismatic antihero. The Hulk is a great addition to roster and is truly a plus.", "Overall, Thor is a character that cannot be taken too serious cause it'll water down the material, it can't be too dark for it'll be unbalanced, but make it an action comedy and it works.", "Go see Thor, my guys!! -A"]},
{"content": ["Emocionante, engraçado e acima de tudo divertido, Thor: Ragnarok é uma aventura cósmica colorida que estabelece um novo padrão para sua franquia - e o resto do Universo cinematográfico Marvel"], "expanded_content": []},
{"content": [" "], "expanded_content": ["When viewing the third installment in the Thor franchise, the greatest strength can be summed up in the skillful introduction of new characters. Korg may perhaps be one of my favorite characters in the Marvel Cinematic Universe of all time, serving as comedic relief but also a way to ground the characters in the midst of a lot of fantasy and pseudo scientific imagery. The fact that director Taika Waititi himself portrayed Korg and directed this fairly stunning nostalgia infused fantasy film only serves to pique the interest in his future projects. Solid performances by Chris Hemsworth and Tom Hiddleston do not leave any want by the viewer. Hiddleston and Hemsworth can be argued, have the best chemistry to date in the MCU. The only issues that arise from this thoroughly enjoyable film, come from the villain of the film Hella Goddess of Death. A common thread among many of the MCU's villains is they come off as an almost cookie cutter depiction of evil. Either lacking in character backstory, or the emotional depth. They are simply there, they fight and then they lose. Over all a solid outing and fitting conclusion to the Thor standalone movies."]},
{"content": ["This is the best Thor movie. Visuals are great - very trippy..", "Hella is great and especially Jeff Goldblum.  Could have handled Odin better.", "Has a little too much humor even in the serious scenes."], "expanded_content": []},
{"content": ["It starts well with the Immigrant song! Has too much humor though. Should be a balance but they throw in jokes even in the serious moments.."], "expanded_content": []},
{"content": ["Once again Marvel shows that it can laugh at itself without being too serious, while still producing great entertaining and eye-pleasing picture."], "expanded_content": []},
{"content": ["A pretty good Superhero Comedy Movie, no the best marvel movie out there but still good. Cate Blanchett performance is flawless"], "expanded_content": []},
{"content": [" "], "expanded_content": ["Thor’s third standalone movie Ragnarok is one of the most refreshing and entertaining Marvel movies in some time, precisely because of wild and bold choices on many levels. Director Taika Watiti has definitely added the much-needed sense of freshness and likability to the character of Thor. The title Ragnarok, which forms the premise of the movie, stands for an important event in Norse mythology that predicts the doom of the gods and the end of Asgard. The story shows that Odin (Anthony Hopkins) reveals a long-kept secret about his past and his first born – Goddess of Death – Hella (Cate Blanchett) to Thor (Chris Hemsworth) & Loki (Tom Hiddleston). Later, Thor finds himself trapped in an alien, warlike planet Sakaar, which is on the other side of the universe, and that too without his mighty hammer. He must find an escape and return to Asgrad to confront one of the most powerful forces he’s ever faced. Every character in the movie has done a fabulous job - be it Chris Hemsworth as mighty turned-witty Thor, Cate Blanchett as the dark Goddess Hella, Jeff Goldblum as the Grandmaster, Mark Ruffalo as the not-so-witty Hulk, or the scene-stealing man of stone, Krog the Kronan, played by Watiti himself. The action scenes are beautifully shot and will definitely give you goosebumps. Thor: Ragnarok is without a doubt the best of Thor franchise and one of the best Marvel movies ever made."]},
{"content": [" "], "expanded_content": ["Not as funny as I hoped, not as clever as I hoped and the villain is nothing special. Still, loads of gags are very funny, the junk planet is visually interesting and the villain is almost a miracle next to Justice League's Steppenwolf. Plus, Korg. Korg is just fantastic."]},
{"content": [" "], "expanded_content": ["This movie was just awesome.  Maybe it's just because i'm a huge superhero/Marvel fan, but i loved this.  The comedy in it was perfect, not too much but when it was there it was hilarious.  Korg was maybe the funniest character i've seen so far in the Marvel series.  Hulk was perfect in this movie, he was hilarious and great as Hulk, and when he was Banner the acting was awesome.  Fitting for a person who basically just missed 2 years.  Thor and Loki's chemistry and back and forth is perfect, like the story about Loki turning into a snake, or when they do \"Get Help\".  Fight scenes were great, and the ending was deep, and powerful.  Asgard is a people, not a place, and now I'm excited to see what happens when they get to Earth."]},
{"content": ["Thor Ragnarok is a much needed improvement to the Thor franchise. It is very funny and introduces great new characters. It fixes what didn't work with previous Thor movies to make something great."], "expanded_content": []},
{"content": [" "], "expanded_content": ["When a powerful new enemy threatens his homeworld Thor faces a race against time to make it back to Asgard and prevent its destruction.", "Ragnorak is great fun and laugh out loud funny throughout making it the easily the best of the three Thor movies and one of my favourite Marvel movies full stop."]},
{"content": ["I’m honestly astonished by how much fun this movie was. Great humour, hilarious scenes and amazing action sequences. One of my favourite Marvel movies ever and I did not expect that at all."], "expanded_content": []},
{"content": ["This film defecates all over European tradition. It replaces timeless themes with cheap cringe comedy, and reduces once great characters to soulless vehicles for cultural Marxism. I weep for the next generation."], "expanded_content": []},
{"content": ["Everything about this film was wrong, apart from great visuals. Not funny, can't be taken seriously, dumb."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Terrible and I mean terrible CG that sticks out like a sore thumb. It's so painfully obvious that the cast is standing on a green screen at times and it kind of takes you out of the film a bit. For the cost of producing this movie, They could have done a much better job making it far less obvious.", "The story is rather generic and predictable. Thor is cast out of his home by a new enemy and recruits his own group to get back and fight this new enemy. The comedy, which has been really emphasized in the trailers, kind of goes in and out. Some jokes are funny while others just fall flat and seem a bit childish at times. All in all, Not a bad movie but definitely overrated and I much prefer Thor 2 over this one."]},
{"content": [" "], "expanded_content": ["I don't usually say this, but this was a great movie.  Predictable?  Yes.  Lame comic book movie?  Yes.  However, the charm and atmosphere of this movie goes beyond words, and the humor is spot on.  Worth watching the other Thor movies just to see this!"]},
{"content": ["Now THIS is how you do a Thor movie. From the expected humor, to the fight we all looked forward to since the first Avengers, then the revelation of a family history.  This truly summarizes the strength and beauty of Asgard citizens."], "expanded_content": []},
{"content": [" "], "expanded_content": ["A ten movie or a humorist movie? Thor become a pathetic hero at this movie. A poor movie!"]},
{"content": ["Great movie,so incedibly  funny but the action also does grip you, its not only funny.I cant remember when I last laughed so much."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Not as good as Justice League or its own predecessors. Cate Blanchett steals the show in this own but a lot of disappointments, such as Hopkins exit from the film being so quick and sudden, without any chance for us to feel it. Script is all over the place and, once again, Thor is always getting lost and finds himself back. This repetitive arc becomes utterly predictable."]},
{"content": [" "], "expanded_content": ["Marvel are doing things right! Maybe not in the printed world but on film they are finally making fantastic superhero movies. After taking a gamble and winning with the Guardian's of the Galaxy and Deadpool, Marvel seem to have realised that seriousness just feels stupid in comic movies and the best way to make a film is to be self aware. So we've had a series of fun and exciting movies that push the limits of fantasy and cool. Ant Man, Guardians, Deadpool, Dr Strange and now joining the ranks of epic: Thor. The film works so well. It's like an insane mix of 70's sci fi visuals mixed with high fantasy, complemented by a fantastic electro synth 80's style soundtrack. It plays out like Flash Gorden meets Lord of The Rings on acid! You can't help but be excited when you see a giant wolf on a rainbow coulored bridge battling The Hulk or the sounds of Led Zeppelin blasting out while Thor smashes hell out of hordes of Demons. The movie is style personified. It's the perfect formular to trigger its audience into shouting 'F**k yea' at the screen! Thor is a rollercoaster from start to finish, never dull always pushing forward with a well paced narrative. Thor: Ragnarok has a cast of weird and wonderful characters to meet along the way. One of the most memorable and hilarious is Korg. The Chilled out rock creature who speaks in a New Zealand accent. He's so good he needs his own movie!", "The cast all work well and manage to keep the audience invested in the crazy world presented. If you haven't seen the film already, do it! Today! I can't wait for the next one!"]},
{"content": ["It's one of my favorite MCU movies. It's a fun movie to watch. Thor has ups and downs and he gets very low. yet rises at the end :)."], "expanded_content": []},
{"content": [" "], "expanded_content": ["+Inspired art style", "+Fantastic cast", "+Memorable soundtrack", "+Immigrant song!", "+Chris Hemsworth natural action-comedian as Thor", "+Great feeling of adventure", "-Blanchett, Elba and Hopkins feel underused", "Honestly wasn't sure what to expect from the trailer and so pleasantly suprised by what appears to be marvels first (second if you count deadpool) comedic / action hybrid. Waitiki's fingerprints are here adding comedic tones that breathe heart and warmth to the thor series thanks to the strength of hemsworth's comedic timing."]},
{"content": [" "], "expanded_content": ["This is one of the flashiest, most eye-popping, and humorous MCU films, at times garishly bordering on decadence. I felt more engaged and entertained while watching it than I do with most Marvel films, but in retrospect the experience feels a bit empty. The film is so nutty and all over the place that the overall plot doesn't feel very coherent or meaningful. Some of the characters are squandered. Loki's usual cunning is underplayed. Thor doesn't seem to go through any meaningful experiences to build character, just some Mufasa-esque \"remember who you are\" mysticism that makes everything okay in the end. Hela, the new villain and Thor and Loki's sister, is such a throwaway \"crazy lady\" villain that she could have easily been Cruella de Ville or any number of other movie villains, and there was no meaningful implementation of the fact that she's their sister. Valkyrie as well feels a bit tossed in, and apparently alcoholism is a joke to the writers of this film, as it's played up for laughs with this character but never shown to be a mistake or problem for the character like it is for Tony Stark in Iron Man 2. There's more than enough twinkle and eye-candy to make this a worthwhile watch for superhero movie fans, but for me this is a one and done. There wasn't really enough memorable plot or character development going on here for me to want to see it again, and some moments were just cringe. Still, it's more fun than most of the MCU."]},
{"content": [" "], "expanded_content": ["First viewing at movie theater...What A Mess! The attempts at funny were well placed...but not for a Thor movie.  And I was drawn in by the Immigrant Song being used in the opening scenes.  Funny...but that's not what I was there for.  Tongue-In-Cheek turned into ham sandwich. Second time around...at home...let's call it Campy.  Not just over the top of the hill...but over the top of the mountain.  And if you're in that Isn't that clever mood...or high...it's a barrel of laughs. It made me imagine what \"Gladiator\" would have been with Crowe playing the funny guy instead of the straight man. ( Comedy reference... those who blood boils at the hint of any slight real or imagined that you aren't straight enough or some such nonsense.)", "Lacks the sophistication and subtlety of previous Thor's (yes it's there)...They just force fee you  the laughs instead of letting you find them.  More of a video game than a movie. But glad I saw it.", "PS When I saw this was the guy who directed \"What we do in the Shadows\"  ...I saw where the humor came from.  Now that was droll in control."]},
{"content": [" "], "expanded_content": ["A movie that tries SO hard to be funny that its hard for me to take seriously and enjoy it. Every 5 seconds there's someone trying to make a joke and trying to lift the mood. Take the first scene:", "Thor's hanging from the ceiling, while Surtur gives his speech and its constantly interrupted by Thor who is spinning on the chains… Am I supposed to laugh at that? It has its moments, great action sequences, but most of the time I thought I was watching a low budget straight to video National Lampoon movie.", "I'm not mad about the change of the source material, I'm glad they took liberties with it, but when they fill the movie with unfunny jokes every 5 minutes it and the overall lack of seriousness in the movie make it the worst of the trilogy."]},
{"content": [" "], "expanded_content": ["It is good for what it is- a mindlessly fun movie that does not take itself too seriously, unlike the other Thor films. While I did find it a bit underwhelming in the end, since it focused more on its fantastic visuals than on its generic and lacking story, it is still an enjoyable blockbuster that's entertaining for all ages."]},
{"content": [" "], "expanded_content": ["Imprisoned on the other side of the universe, Thor must race against time to stop Ragnarok, the destruction of Asgard and the end of the Asgardian civilization at the hands of the ruthless Hela.", "Marvels surprises us with a well made sequel of the Thor franchise series, and in my opinion surpasses even its predecessors, because it tries to portray the series in a completely different light this time round.", "Plots are excellent with many good twists. Characters are memorable and entertaining to watch, including even minor characters. Voice acting is excellent for the most parts. The funny lines, though a bit too many throughout the film, were genuinely of good taste and really funny.", "One can't help but feel genuinely entertained by this film."]},
{"content": [" "], "expanded_content": ["Não esperava muito sinceramente que este filme me desagrada-se tanto. Este filme de Thor não podia nunca ser tão virado para o humor quando é um dos que tem maior carga emocional da trilogia Thor. A morte do pai, o problema em Asgard e mesmo a sua destruição tem de ter um impacto brutal e não tem porque simplesmente o filme tanta ser cómico. Não gostei nada mesmo do facto de ter comicidade no filme em demasia e por isso o filme foi uma desilução. Esperava mais tambem da vila sinceramente, e de todos os outros personagens. Espero que a Marvel não comeca a por demasiada comedia nos seus filmes de agora em diante, eles metiam o quanto baste e yava genial."]},
{"content": ["La mejor de la trilogia sin duda alguna, buen cgi, buenos personajes, buena banda sonora, y por sobretodo, excelente villana."], "expanded_content": []},
{"content": [" "], "expanded_content": ["I liked the movie first time i watched it at the cinema. But watching it later on makes it a uneven and more dumb experience. Loke is no way near as cool as before, now he is just a tool. Thor is joking after serious personal events like he dont care about who he is. Cool action-scenes, but way too much silly humor..."]},
{"content": [" "], "expanded_content": ["I'll explain more detailed below, but keeping it in short words, Thor Ragnarok is not only one of the worst MCU movies, but it tracends beyond one of the worst Marvel movies, it is one of the worst superhero and based comic-book movies ever. I felt is one of the worst things the genre has to offer. Is it worth seeing? I don't think so, I'll explain my opinion.", "Have you ever heard the slang \"jumping the shark\"? Is a therm to describe a plotline so stupid that it turns every character into a cartoon over-the-top parody of it's former self. This movie jumps the shark at every chance. Ir feels more like a Saturday Night Live promotional-parody-sketch than actual movie. And yes, there are great parody sketches, which at worst feel like a 30 second joke only prolonged for 5 minutes, this movie is like a 5 second joke prolonged for 2 hours. Is pure pain, none of the jokes land. It feels like all the worst internet 9-gag memes pasted together.", "The comedy is completely blind, completely deaf to the events that are happening in the plotline. People may be dying and the movie is doing some of the worst jokes ever. Not even Care Blanchet can save this. Nothing has consequences, and everything is overlooked for the sake of the next joke. The worst joke is uttered by the CGI character played by director Taila Waiti, a rock made character that looks like Fantastic 4's member the Thing, but this version is stupid. He jokes when Thor's planet Asgard explodes. Jack Kirby, who drew Thor's comics was sad that people didn't took his life work seriously, he would had hated this movie. Is like Batman and Robin. The second Thor movie was so bad, I thought nothing could be worse and yet this movie is worse.", "Trying to remember it to write a review, is painful. Chris Hemsworth is no longer playing Thor, he is just playing himself as class clown, he is definitely the worst actor of the Original Avengers, the other worst one is Mark Ruffallo's Bruce Banner, whom I'm not even sure what he is supposed to be doing. Is a mess. The movie doesn't know what to do with Loki, he is sorta just there like Hulk. Everything is just sorta there, whenever something dramatic is gonna happen is all ruined by another I'll placed joke.", "And I don't hate humor in films, nor Tex Avery like humor in live-action. Rogger Rabbit, The Mask, Deadpool, Space Jam. All those are great, and fun. This simply is the opposite."]},
{"content": [" "], "expanded_content": ["A lighthearted, fun, watchable (unlike the other Thors) movie that, like most standalone Marvel movies, isn't meant to be taken too seriously (at least in my opinion). I don't know, looking at these other reviews, I feel like fanbases have just been split right down the throat on these recent releases. I thought The Last Jedi would be the last occurrence of this, but people (especially the die-hard fans) are mad at the establishment, I suppose."]},
{"content": [" "], "expanded_content": ["Thor Ragnarok is feels like two seperate movies. On one side it is a straight up comedy with a few genuine laughs, but mostly groan inducing. On the other is your typical superhero flare that is a bit weak on the plot, but bailed out by action scenes. These two sides clash in tones that do not mix well together. Added to that cacophony is an out of place rock soundtrack that occasionally pokes its head into the mix. To be honest, it's a huge mess that doesn't realize it's a mess.", "If you can last through the beginning where its inept comedy half dominates, you'll be rewarded when the action become more frequent. There the quality is just able to bring the movie the thinnest sliver above mediocre."]},
{"content": [" "], "expanded_content": ["The film as a advenute, superheroe film failed. Just to much of comedy. But, the upgrade of Thor in Ragnarok, despite his gags of useless comedy, is quite good and necessary for the event of Infinity War.", "Hela as the main villain works perfectly, and the battle in the Arena of Thor against Hulk is great. Nothing else to say."]},
{"content": ["Very fresh, very funny but also fantastic action and very epic and memorable moments."], "expanded_content": []},
{"content": ["I don't know how but every marvel movie came leter this year were better than the other or others one and I think you got it. Thor Ragnarok is not just the mcu movie in 2017 but it's in mcu movie top 5.(2017)"], "expanded_content": []},
{"content": ["a great addition to the mcu, im very happy with the direction they went with this movie compared to the other thor films."], "expanded_content": []},
{"content": ["This film is a massive improvement over Thor 1 and 2 with plenty of creativity and charm and a superb villain."], "expanded_content": []},
{"content": [" "], "expanded_content": ["The first 2 movies of the trilogy the Thor were boring and one of most uninteresting in Marvel film Universe. The 3rd part has turned out much better, of course considerably it was affected by Hulk's appearance. The main minus of the movie - the main antagonist. Hela the most faceless character, about her tell nothing at all and don't show her history. 30 seconds of timing aren't counted., It seems, on a trilogy plot all have told, all holes of the previous parts are closed. I think the 3rd part the best in the trilogy."]},
{"content": ["Quite good. Only flaws are the \"what are you the god of?\" scene and some unfunny jokes."], "expanded_content": []},
{"content": [" "], "expanded_content": ["I thought Thor ragnarok was a total let down the only good part was the battle with the immigrant song so that tells a lot! The jokes were bad and the characters were boring but still it had a lot of potential if they made it funny and interesting and aren’t we also done with Loki."]},
{"content": ["Proof that a movie can be too funny. Hela was the most bland villain I've ever seem, so lifeless and uninteresting... I love superhero movies, and I love comedies, but this movie is comedy trying to be a superhero movie."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Thor: Ragnarok decided to make a switch from the previous films to comedy after Thor 2 dropped the ball, and it pays off wonderfully. Hemsworth has a natural comic touch and he really drives the whole thing.", "Not to say that the film feels completely disconnected from the last two films. The dramatic and human moments really work here as the film is still about the characters. The relationship between Thor and Loki reaches a natural evolution as Thor has given up on trying to save his brother and Loki has run out of ways to manipulate and deflect from him. Only downside is that since this is a soft reboot, there are a few characters that are written out too quickly, jarringly and disrespectfully. (They could've had more scenes).", "All the new characters work really well here. This may be Tessa Thomson's best performance as Valkyrie who's likable from the get-go. Cate Blanchett is a good villain here, both intimidating and dry-witted when need be, but it's actually Jeff Goldblum who steals the show as the supporting villain The Grandmaster, a wacky Caligula-esque character.", "In costumes, sets, and special effects, this is one of the best looking films I've ever seen. I've heard this movie was inspired by seventies sci-fi and it really shows. The whole thing has this very colorful, flashy and retro style.", "I highly recommend this."]},
{"content": [" "], "expanded_content": ["Thor Ragnarok", "Un nouveau Marvel", "Une qualité comme d'habitude jolie et parsemée de détail alors que l'on profite gentiment du film on aperçois un effet visuel détestable qu'est la visite avec le père.... Ce film coute des millions et des millions et ils sont incapables de régler les lumières de studio comme la scène projetée sur l'écran vert. Une scène pitoyable qui révèle tout l'enjeu du film...", "Heureusement le film est sauvé grâce à Hulk! Une bataille tout simplement géniale Des musiques que j'aurais aimé être plus ansé 80's mais aucun intérêt de tourné le logo en 80's   la musique si c'est juste parce que ça fonctionne avec gardien de la galaxie.. Beaucoup de choses se mélangent un bouilli Martel qui évolue par détail..", "Un film plein d'action une visite d'une planète géniale des scènes d'humour qui fonctionne très bien!", "Vivement la fin que l'on aperçoit une évolution je me lasse...", "3.5/5"]},
{"content": [" "], "expanded_content": ["This is the best Thor movie out of the first 3. The acting is way better, the cast is hilarious and fun to watch throughout the movie. The beginning of the movie was entertaining and funny, the middle had a lot of cool and fun characters, and the ending was funny too, but also filled with action. I recommend this movie."]},
{"content": ["The best Thor movie yet. It's just fun to watch and never gets boring throughout the movie."], "expanded_content": []},
{"content": ["Electrifying in all the right ways there always those two marvel movies after the avengers that just get it right and this one is one of them"], "expanded_content": []},
{"content": ["Better than the other Thor movies. And to be quite honest it wasn't terrible."], "expanded_content": []},
{"content": [" "], "expanded_content": ["The best Thor movie by far, but is it the best Marvel movie? No. Is that a bad thing? No. Thor: Ragnarok is extremely entertaining and refreshing. It stripped away everything that was established about Thor and made it work. I must applaud how self-aware this film is, it makes even more hilarious. Now, while this an extremely entertaining film, that's pretty much all there is to it. Besides the Shakespearean sibling battle for the throne that's always interesting, there's not much else to Thor: Ragnarok besides it being vastly entertaining. So, while being one of the better Marvel films, other than stripping away everything we knew about its character and being hilariously self-aware, it's just another Marvel movie. A-"]},
{"content": [" "], "expanded_content": ["Thor Ragnarok is the third installment in the Thor franchise, and is easily the best one. This movie was almost like a mirror image of GOTG: it had a Drax and a Gamora, and the soundtrack was very similar to it as well. It was also very comedic, and I didn't expect but I definitely didn't hate it; it was so refreshing and fun to see a more laid back superhero film. All the performances are very good, and Jeff Goldblum's character was so perfect for him as an actor that it was one of the most comedic parts of the whole film. There's another character who for me is funnier than almost anyone in any Marvel film, who I won't mention in case I spoil anything, and I almost missed a scene due to how much laughter was coming out of me. I think the reason some people won't like this movie is because (I don't think so but it could be interpreted this way) the story and plot of the film didn't match the comedic tone, as the story is actually very serious, therefore people might be like 'Why are they wasting their time with jokes when they could seriously expand Thor as a character' etc. . Something major happens early on, and it is quite significant and is quite a 'WOW' moment, yet it isn't really explored, so that aspect might be the movie's downfall for some people. Definitely check this movie out, so worth your money, and as a side-note: if anyone is a Hulk fan, specifically a Planet Hulk fan, you DEFINITELY need to see this film. 100%. 'Cos let me tell you, the first character (besides from the Drax-like character, he was just so amazing xD) I discussed and shouted about was Hulk. You'll see why."]},
{"content": ["Thor: Ragnarok rocks! Finally, Marvel has made a wonderful Thor movie that also is one of the best MCU films ever!"], "expanded_content": []},
{"content": [" "], "expanded_content": ["Marvels Thor-Filme nahmen sich schon immer nicht ganz ernst – doch Tag der Entscheidung ist dank 5 Zimmer Küche Sarg-Regisseur Taika Waititi sogar primär eine Komödie. Das stößt so manchem Marvel-Veteranen sicher vor den Kopf, ist aber legitim – denn frische Konzepte hat der Superheldenfilm bekanntlich mehr als nötig. Aber nicht falsch verstehen: Auch wenn der talentierte Neuseeländer dem Mann mit dem Hammer durch verschrobenen Humor und ganz viel Selbstironie seinen Stempel aufdrückt, ist Thor – Tag der Entscheidung immer noch stumpf wie Transformers: Eine echte Geschichte gibt es quasi nicht und Thor (Chris Hemsworth), Loki (Tom Hiddleston), Hulk (Mark Ruffalo) und Neuzugang Valkyrie (Tessa Thompson) springen im Kampf gegen die ultraböse Goth-Queen Hela (Cate Blanchett) auch nur von einer CGI-Actionszene zur nächsten. Das aber ist ziemlich gut gemacht und mindestens so unterhaltsam wie Guardians of the Galaxy. Außerdem gibt es neben einem überraschend trashigen Flash Gordon-Look nebst passendem Elektro-Score ziemlich geniale Cameos und einen tollen Jeff Goldblum als tuckiger Diktator Grandmaster."]},
{"content": ["I don’t really know what to think of this move. It looks pretty great and the acting is nice. Some of the jokes were good especially more towards the end but that’s it really. It just feels off. Rating 72%"], "expanded_content": []},
{"content": [" "], "expanded_content": ["THE  movie was great better than the first 2. There were some forced jokes but it’s still good. I didn’t expect Thor to lose his eye!!"]},
{"content": [" "], "expanded_content": ["Thor:Ragnarok is a fun comedy film that changes the character Thor into a more lovable character. The road trip of Thor has been packed with action that will keep you watching for the next 2 hours. Director Taika Waititi also did a great job on implanting his own style into the movie, colorful but yet somehow different from the similar vibe film The Guardians of the Galaxy."]},
{"content": [" "], "expanded_content": ["Amazing and a brilliant performance from the cast and an incredible joyride watching it and a highly recommended watch , marvel fan or not Despite  a few scenes might have had a bit of forced humour and might have been a bit lagging. The movie is nevertheless a good first time watch"]},
{"content": ["entretiene, pero pusieron a thor y hulk, que pudieron haber inventado a otros personajes y cambiar el nombre de la pelicula, esto no es comic puro, es una burla al comic."], "expanded_content": []},
{"content": [" "], "expanded_content": ["I really wanted to like this more, the trailers looked breathtaking and stunning, yet somehow it fell flat.  The humour in the film was too much and felt forced, previous Marvel films have balanced this, often to great effect.", "Very much a Thor 'coming the man he should be' film, there isn't the gravitas that should be there.", "When Hela was shown in the trailers, and the shots of Asgard at war, this looked like the Thor movie we all wanted, true comic book action and with a dangerous and formidable foe.  The result, forced humour, bad pacing, action set to set up next joke, to set up next action scence, to set up finale"]},
{"content": [" "], "expanded_content": ["I've seen the first two Thor movies in theaters and thought they were alright. I was actually a little hesitant to see this since it seemed more Planet Hulk than something from the lore of Thor. The best way I can describe the movie as a combination of both minus all the heavy themes of either. The movie is trying to be a bit too silly and tries too hard to avoid anything serious. For example, anytime a hero wants something on cue, they are delayed, dramatic music stops and they tell whoever to wait, like Thor summoning his hammer and it takes ten or fifteen seconds before it comes. This happens so much that by the time Banner does the same thing near the end where he needed to be the Hulk, you can predictably tell it isn't going to happen right away. The problem with this is that it is not in character. It makes it look like Thor never even used the hammer before or that Banner doesn't know how to Hulk up despite the stress of falling out of a plane should have easily triggered it.", "The best humor was when the characters are being themselves and play off each other rather than trying to be silly. The Dr. Strange scene was probably the best part. Ironically, I would say Dr. Strange was closer to his comic depiction than he was in his own movie.", "The Asgard section felt tacked on and a bit repetitive. Each scene starts off with Hela upset people don't remember her and then she kills with a bunch of swords. In concept, she's great, but it goes back to being a bit on the repetitive side.", "I wished that the Asgardians put up more of a fight. Two of the Warrior's Three are killed in less time than it takes for it to click on who they are and Lady Sif doesn't even appear. Heimdall was the only one who got decent screen time and while his parts were short, they were well done.  Hela is killing everything and it doesn't feel as dark as it should be. It's not only mostly bloodless, but when people die, they die instantly. Some would say it would ruin the fun, but frankly, if Deadpool can incorporate cancer in a serious manner, why can't the fall of Asgard be treated with a darker tone? The film flows well, except for one section in the third arc. It shows Hela and Scourge are closing in on Heimdall's refugees. She's throwing swords at the door on one side while the others are escaping in the back on a dirt trail with sparse vegetation. Thor says he'll distract her and heads to the throne room. The next moment, there he is and so is Hela. The refugees are on the bridge with Scourge now following after them with soldiers. It's just a strange transition. I still give the movie an 8 because it is a big improvement over the last two Thor films and the marketing pointed to this tone, but it could've been better.", "The next moment,"]},
{"content": [" "], "expanded_content": ["Amazing! This is by far the best Thor movie ever and one of my top 5 favorite marvel and superhero movies and one of my top 10 action movies of all time. It was the perfect combination of action and comedy. This is also to me the 2nd funniest Marvel movie ever. The visual effects were spectacular especially Thor's powers, Hela's powers, Hulk, and Korg. The story and screenplay were excellent. The acting performances were just phenomenal especially from Chris Hemsworth, Cate Blanchett, Mark Ruffalo, Taika Waititi, Tom Hiddleston, Tessa Thompson, Jeff Goldblum, Idris Elba, and Karl Urban. The hairstyling and makeup was superb especially on Chris Hemsworth, Cate Blanchett, Idris Elba, Tessa Thompson, Tom Hiddleston, and Karl Urban. The costumes were outstanding especially Chris Hemsworth's, Cate Blanchett's, Mark Ruffalo's, Tessa Thompson's, Jeff Goldblum's, Karl Urban and Idris Elba's. The musical score was terrific. Thor: Ragnarok is one of my favorite movies of all time. For sure a A+ movie."]},
{"content": [" "], "expanded_content": ["Thor: Ragnarok has the distinction of being by far the best Thor movie, though considering the other two, this isn't that much of a achievement. It focuses much more on comedy than the previous movies, while also giving much more screen time to the Asgardians and the like rather than Earth, a good change in my opinion.", "The story is solid: Odin has died and as such has released Thor's sister, Hela, from her imprisonment. Trying to warn Asgard, he and Loki are then transported to the planet of Sakarr, where Thor is forced to fight in the Arena in order to gain his freedom and travel back to Asgard to defeat Hela and prevent the destruction of yada yada yada.", "The story contains much more comedy, something that is quickly becoming a staple of the newer Marvel movies ever since Guardians of the Galaxy. Most of the comedy can be funny, though there are some jokes that seem rather hit or miss. The tone of the movie also has a serious problem, as there will be many times in the movie when a serious moment is happening, only for it to be ruined by an ill timed joke. The characters of the movie are very well written, with a return of some old fan favorites and some new people as well. Jeff Goldblums character in particular can be one of the most amusing in the story. Hela is a rather generic Marvel Villain, but they do try to make the whole of Asgard seem much more \"grey\" than it previously seemed, but Odin is once again completely wasted.", "As for the effects... they could be better. The CGI is REALLY noticeable during certain scenes, and a lot of the action can seem rather floaty and fake. This detracts from the seriousness of some scenes nearly as much as the humor can.", "The music is rather unremarkable. No original tract stands out, but the use of some rock songs are always welcome, such as \"Immigrant Song\" being used for two important scenes (though one should've been replaced with \"Thunderstruck\", I'm just saying\"", "Overall, a solid Movie in the Marvel Cinematic Universe. Definitely the best Thor movie and has several good moments, but it has several problems that hold it back from being truly great.", "7/10"]},
{"content": [" "], "expanded_content": ["Taika Watiti's Thor: Ragnarok is the first outstanding Thor film. I loved almost everything about this film. The characters were great, and do I even have to say that Chris Hemsworth and Tom Hiddleston were absolutely perfect. I loved the humor, although some was a bit untimely. And, of course, the action scenes were fantastic. In the end, this is a very fun film and I will give it a 9.2/10"]},
{"content": [" "], "expanded_content": ["I have never liked the Thor movies despite Loki being one of the most favorable characters in MCU. Perhaps, I was annoyed at the franchise for messing around with an artistic masterclass like Stefan Skellan and putting Natalie Portman in an annoying damsel role or not utilizing that nigh-pitched bombshell that is Kat Dennings. Maybe, I divulged.", "Anyways, Ragnorak is the funniest Marvel movie ever made and it is done so with the culmination of character deflection Loki who goes from World-conquering evil in Avengers to just a God of Mischief who Thor understands and can deal with and still be counted on to help out. As far as U-turns go, this is about it. But it's not a bad thing. It's enjoyable. And is Chris Hemsworth's Thor portrayal - He's funnier, less broody, realistic about his life choices and position, far less buff and with a new haircut. He has a few cool moments to with his entrance fight, the Gladiator helmet and Thunder God scene. You can pretty much round it off with new incomers - Cate Blanchett (cool Evil make-up), Jeff Goldblum (Wacky and Goldblum) and Tessa Thompson (Hot Warrior who purports to the possibility of Valkyries being a squad of voracious lesbites) being cool enough to complete the enjoyable five-fecta.", "Thor: Ragnorak is nothing extraordinary and nothing except the formulaic story but it is much better to deal to have when you are going to watch a movie of this nature."]},
{"content": ["Spectacular visual effects, very good performances, fresh comedy all present in the Thor Ragnarok"], "expanded_content": []},
{"content": [" "], "expanded_content": ["Out of all the MCU Movies, the Thor films have been the weakest in the bunch. However, Thor finally gets a solid film that does it's source material justice. 'Thor: Ragnarok' is a fun film that is very different to the previous. This isn't a really bad thing, but makes the movie awarkward. Thor and Thor: The Dark World had comdey in them, this film has a lot of comdey, and really didn't feel like a thor movie at times. Don't get me wrong, i'm with comdey MCU movies (Guardins Of The Galaxy), but jumping from different genres was a strange change. Besides that, the film was still funny and had awesome action scenes. However, with the jumping between two places with Hella, then back to Thor and the focus on comdey, it doesn't make this the best MCU movie. But anyway, this was one the best movies of 2017, and from this film, I have high hopes that the future MCU movies will be good!"]},
{"content": [" "], "expanded_content": ["The problem I have with Thor Ragnorak is it's trying so damn hard to be funny, when Thor (as a character) was already hilarious to begin with. But with this new, Guardians-like vision for the character, the sarcasm does get a bit overboard and most of what they show we've seen plenty of times before. But just to get that out of the way, Ragnorak is still a primetime addition to the MCU and many might consider it as the best of the Thor movies, but the way I see it, I kind of miss the old Thor. And to be honest, they didn't really push the envelope as far as I thought they would. Other than Thor's hair-cut and a few sarcastic jokes, with a \"Fifth Element\" like planet, the story and everything else just felt plane same to me. I commend their attempts and applaud their ambition, but in the end, it just didn't work or digest the way I thought it would.  But it was worth the shot."]},
{"content": [" "], "expanded_content": ["Waititi has a housewarming party for the Asgradians with food and entertainment so rich, everyone gets to have a good time.", "Thor: Ragnarok", "Waititi is the surprising exotic vacation in this MCU. It is sunny and breezy in the realm of Asgard where the idea of mockery colors it like a phoenix for Chris Hemsworth who has been working hard in his subsequently failing chapters. It took them two major losses and Taika Waititi, the director, to finally get a clear vision of this \"Lord Of Thunder\" with sparkly fingers, of course. By taking itself not seriously, it takes a tremendous amount of effort, and Waititi walks that fine line and doesn't let the \"joke\" overpower the kinetic energy the film contains.", "It starts off by literally make a tomfoolery out of its previous installments, by pointing out the elephant in the room, the storyline criticizes its own flaws making it impossible to blame for anything. Hemsworth, finally gets the feet tapping rhythm, and as he claims that the character eventually grew into himself to a certain extent, it makes it easy for him to portray and simple for us to swallow. But for me, the film would always be of the guest appearances, there are aplenty and they are just fun. From Benedict Cumberbatch to Jeff Goldblum, these hilarious distractions is what crisps up the hefty part of the material.", "Cate Blanchett, as the first female antagonist in this franchise, strikes fear appropriately but what's absorbing is the equation of her with Hemsworth, where the train of battles are spiraled out by proving their superiority in a sibling rivalry, the honesty of it is bizarrely genius. Tom Hiddleston is hosted aptly by the writers for the first time, while on the other hand, Mark Ruffalo gets to share a few laughs with a drunken and fierceful Tessa Thompson whose innocent relationship plasters a broad smile on our face, in this dark critical time that mythology claims it to be an inevitable natural disaster called Ragnarok and Hemsworth a way out."]},
{"content": ["I have to admit I was not wowed by this movie. it had some fun moments, and good visuals. All in all I think it could have been better. I liked it, i did not love it."], "expanded_content": []},
{"content": ["Thor: Ragnarok is different marvel's movie. Before this movie release, I don't think will see Thor with new hair, and finally, he has that. Valkyrie is so amazing character, Taika as a director makes this movie incredibly fun."], "expanded_content": []},
{"content": ["The best movie in the Thor trilogy.", "With his obvious adaptation of the Guardians of the Galaxy style, Thor: Ragnarok is an enjoyable movie, but the Ragnarok required to be darker and more cruel, like in the comics."], "expanded_content": []},
{"content": [" "], "expanded_content": ["This movie hit the sweet spot with it's vibes, it feels like a futuristic 80's movie, with a touch of cyberpunk to it, and it's made by Marvel studios...simply amazing. The actors did amazing jobs at their performance and delivering us the funnies moments in the MCU yet with the movie script humor which is right on spot and it gives us even a lot of laugh out loud moments. I love the director's style and what he was going for, the cinematography is amazing with the practical effects combined with the CGI makes the movies visual stunning as expected of a Marvel movie. The sound effect and music just adds to the movies amazingly 80's vibe that they where going for and makes it more entertaining. Chris, Jeff Goldblum, Tom, Cate, Idris Elba, Tessa Thompson, Mark and the great Anthony Hopkins did a fantastic job delivering their characters to the big screen, and I think this time it's done the best we've seen so far in the MCU. It has emotion, tension and weight to their personalities and overall immersion to the story. Which is amazingly delivered. The plot is pretty simple but it works with the rest of the movie's formula! It's not even the ending is cheesy or cliche in any way and it represents the drama aspect of the movie. The action is amazing and we finally see Thor in it's full glory and potential. The movie's message is really strong and it has a big presence over the plot, also the sub-plots are amazing with every single character having his screen time. Overall this is an amazing movie, and the best from Thor yet! It's very fun to watch and overly entertaining with not even the slightest pacing issue. It keeps the pressure until the end. Great job and respect for the cast and director/writers."]},
{"content": [" "], "expanded_content": ["Thor has always been a difficult franchise for me. I like Marvel, I do think Chris Hemsworth is a decent actor, but the character didn't work for me. Not in the Avengers movies and definitely not in the Thor standalone movies. Too dour, too serious, the character isn't a lot of fun except for a few one lines. That is until this movie. He was fantastic. The humor bordered on too much, but never crossed that line of being too silly.", "The rest of the movie was pretty good as well. I liked having Hulk/Banner in the movie. I believe Marvel is underutilizing Mark Ruffalo and it was great to see him involved. I also enjoyed Scrapper 142 as a person who surprises Thor with her origins (won't say more for spoilers) and of course The Grand Master was awesome. How can people not love Jeff Goldblum. He is one of those people I could watch an hour of him just talking. I absolutely loved the storyline on his planet, the gladiators and the revolution.", "Sadly the part I didn't like was about Hela and the whole Asgard part. This part felt less fun, less interesting and seemed mostly a way to move around the pieces in the Marvel Cinematic Universe. She wasn't interesting and I absolutely hated her outfit. That being said, it is fortunate they seem to spend more time dealing with Hulk/142/Thor on the scrap planet with The Grandmaster. It was pretty awesome.", "The one other thing though that this underlined was the way Marvel ignores women. So many little cameos in the movie, and the one little tiny thing involving Black Widow just reminded me that we haven't seen  a Black Widow movie, she gets less screen time then any of the others (even the Scarlett Witch, but she doesn't even get her own movie). I am not sure what the problem is with Marvel, they have the Black Panther coming up (and I am going to be there first in line to see it) but still no women led movies.", "The fact that D.C. has them beat on this just confuses me even more.", "That being said, the movie was great. Definitely in the top 5 Marvel movies for me and the best Thor movie period.", "The good: Action packed with a lot of fun moments. It was great to see Hulk/Banner as well, but Thor definitely made it his movie.", "The bad: The part in Asgard was not in sync for me with the rest of the movie, and the whole movie underscored Marvel's issues with female lead roles.", "Of course I will see the next one, and I like his short hair better."]},
{"content": ["What it lacks in story and villains it makes up for in hilarious comedy, breathtaking CGI, and a very memorable performance by Chris Hemsworth. Thor: Ragnarok is one of if not the funniest marvel movie we have seen besides Deadpool."], "expanded_content": []},
{"content": [" "], "expanded_content": ["It was a fun and entertaining movie but nothing special overall. The characters, actors and dialogue was very good but the story felt weak and not very exciting. With that said it’s in my opinion the best Thor movie to date, simply because the others were dreadful."]},
{"content": [" "], "expanded_content": ["First off, this is the best Thor movie obviously. It has the Gotg humor to it (which was left out in the 2nd movie) and seem like it followed the 60s comics done right. I didn't expected this movie to be funny, I thought it was going to be a serious but with 80s vibes to it (which it does) and got good references from the comics. Marvel Studios know how to make a fun film and great moments and better charathers than Thor's friends in the previous movies. You can see the serious moments in this and quite understand it in a comedic way."]},
{"content": [" "], "expanded_content": ["Enjoyed the movie a lot. The story is well-written, Thor is awesome, Hulk is great, but the only thing I don't like is the design of Sakaar. Hella was a good villain, but can't top Vulture! ;)", "One more important thing, humor was finally not childish :)"]},
{"content": [" "], "expanded_content": ["This is one of, if not THE best, MCU movies. A breath of fresh air for the franchise, Waititi went down the comedy road, in contrast to previous movie, and god, did it pay off. It starts of a little weird with a wonky pacing, but ramps up around the start of the second act and from there forward it becomes an incredible experience, with great action, hilarious scenes, and stunning cinematography."]},
{"content": ["A really cool and fresh way to bring back Thor. Much better than most better ones with an alright ending but great characters and acting."], "expanded_content": []},
{"content": ["Out of all the marvel movies I've seen in the past two years this was probably the best. It has great humor, amazing action scenes and furthers the MCU plot by bringing Hulk back into the mix. This is a must see for any action movie fan."], "expanded_content": []},
{"content": ["Too much comedy. Even the serious moments tone down by comedy. Great fights scenes and all but i think the movie had to have a limited amount of humour"], "expanded_content": []},
{"content": [" "], "expanded_content": ["Confusing! It's not that the film was terrible, it just wasn't your typical Thor/Marvel film so you go into it expecting one thing and getting another. This Thor is more comical and cheesy. It's not a superhero, action-adventure flick with comedy, but a comedy with some action. Almost like a spoof. The jokes were non-stop and corny. The acting was mediocre and the storyline was average. We still watched the whole movie but didn't feel it was up to par with the other superhero movies. Maybe if you go into it knowing what to expect you would enjoy it more, instead of feeling like you were taking a sip of soda only to find out its milk...In My Humble Opinion!"]},
{"content": ["A film with funny dialogue and a story that fills in the gaps left from Captain America: Civil War and Avengers: Age of Ultron. Thor: Ragnorök is a light hearted instalment in the MCU and sets the stage for Avengers: Infinity War."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Yes. Incredible movie. I've gave a 9 as I know this isn't a masterpiece but I LOVE THIS. Planet Hulk was one of my favourite books/movies growing up, and seeing it adapted was amazing, and not just that, everything else in this movie is great, the comedy, the visuals, the characters, I just think this is a really great movie."]},
{"content": [" "], "expanded_content": ["I loved this movie because I liked Thor before and didn't feel good every time the movie failed. This movie was the best Thor movie, and it was good as Guardians of the Galaxy which also is Space Opera genre. I liked the movie, but that was it. I think this movie failed as a movie that Marvel fan had expected by the sub title Ragnarok. I still want to give a good score for it."]},
{"content": ["This was in my opinion by far the best thor movie that they have released I wasn't that much of a fan of some of the previous thor movies but this one got me good"], "expanded_content": []},
{"content": ["it really doesn't need too much to say, the movie is beautifully entertaining, one of the very few movies in history that will not let you close your eyes or yawn from boredom, thanks Marvel, 10/10 work"], "expanded_content": []},
{"content": ["Definitely the best Thor movie ever made. It seems that this comedy-like climate suits this character well. It's weird, it's hilarious and it's very, very good. Wonderful soundtrack and equally wonderful Jeff Goldblum being Jeff Goldblum."], "expanded_content": []},
{"content": ["Taika Waititi can do no wrong in my eyes. He has saved the Thor franchise for me. Also, hilarious!!!!"], "expanded_content": []},
{"content": ["Most unique marvel movie, has actual jokes! I laughed out loud twice during this movie which is rare for me !.!.!"], "expanded_content": []},
{"content": ["7.7/10", "This movie is my favourite mcu movie and probably the funniest too. Great comeback for Thor!"], "expanded_content": []},
{"content": ["\"Thor: Ragnarok\" not only boasts beautiful cinematography, thrilling action, and hilarious characters, but it also made Chris Hemsworth's Thor much more interesting."], "expanded_content": []},
{"content": ["Definitely my favourite MCU film along with Winter Soldier. Just had it all. \"Piss off ghost\"."], "expanded_content": []},
{"content": [" "], "expanded_content": ["No spoilers: Thor ragnarok wasn't one of the best movies but it was very entertaining and fun movie. I consider myself as a movie expert for my age (13) I watch from pg animation to pg 13 to mild R to hard R to M18. I dont mind the violence and nudity but I mind the dialogue and where the movie is taking me. I can watch every kind of genre (except for erotic movies they suck). But thor ragnarok took the thor trilogy to another level. The first 2 movies were pretty serious (the first one was good, the seconds one was bad but not garbage) but this one was a pure action packed comedy. It was very fun and entertaining and by far the best thor movie in the trilogy. Hela was also a very enjoyable villain even if She was cheesy. I have a flaw with this film. There were too much jokes and sometimes the characters didnt know when too stop. Being this said this is a pretty good movie."]},
{"content": ["Está bastante entretenida y muy chula visualmente, como nos tiene acostumbrados marvel"], "expanded_content": []},
{"content": ["Uniformly middling, as with most Marvel schlock now. The movie did not stand up to the hype. In fact, you might say it went over like a lead zeppelin."], "expanded_content": []},
{"content": ["This **** had me laughing for 1 hour", "this **** is so funny and fun.", "You can tell the actors had so much fun."], "expanded_content": []},
{"content": ["The best Thor movie. With Doctor Strange it was a great solution. We need more of him haha. Thor vs Hulk was so funny and the end.. Woah"], "expanded_content": []},
{"content": ["Personnellement le film sur Thor que je préfère. Un bon rythme et un humour rafraichissant."], "expanded_content": []},
{"content": ["This is undoubtedly the best Thor movie out of the three, setting new standards for the franchise, with colourful action and ingenious humour."], "expanded_content": []},
{"content": [" "], "expanded_content": ["What's with all the jokes in this Thor installments? I don't watch these movies to hear dime store jokes. No everyone can be deadpool! I really enjoyed the effects and the storyline somewhat. But seriously, get us back to good acting, strong storylines and please less jokes!"]},
{"content": [" "], "expanded_content": ["Best thor movie so far, I didnt pay any attention on the other movies, they seemed boring. This one was funny good story, especially after playing god of war. All those places made more sense asgard those heim places. Only thing valkeries look cooler on god of war and stronger, maybe they can make a good sirieus movie about them, maybe I will get paid for this idea :D"]},
{"content": ["After the first 2 movies of Thor, this one is his redemption. Its style of mixed comedy, superhero genre, action & sci-fi works and makes all of the characters round."], "expanded_content": []},
{"content": ["Funny, interesting, brutal. It is finally a Marvel movie that feels secure about itself. The villain isn't going to be defeated by shear power this time, and the good guys don't escape unscathed.", "It is an excellent movie, it earns an 8/10."], "expanded_content": []},
{"content": ["From the 3 movies, this is the best one. But still is a bit far from the quality of other Marvel movies."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Thor: Ragnarok brings lots of fun and action, with a very bad soundtrack and some unnecessary jokes!", "It was really fun, yeah it actually was! But the soundtrack blew it away.", "The action sequences were totally epic, but once again, the soundtrack blew it away!", "The sense of humor was actually funny, but sometimes there was no reason to say some jokes, they worked with me and made me laugh though, there was no reason for Thor to say a joke like every minute!", "The length was pretty good, for such a movie.. maybe less was going to be better!", "The voice of Korg was totally unfitting and bad!!", "Tessa Thompson as Valkyrie was less than fine.. just like every Marvel movie, they choose the wrong people to act in their movies, and as a result, the performance is always bad!", "The CGI was not that good, actually! Just like every MCU movie!", "All of that made Thor: Ragnarok away to be a decent MCU movie!", "Because of five of the cast (Chris Hemsworth, Tom Hiddleston , Mark Ruffalo, Idris Elba and Cate Blanchett) and the great story, I'm gonna give it a B!"]},
{"content": ["This movie gives Thor some personality, which is great! That movie would have been a 10 if it wasn't for the second part of the movie - which is a mind-numbingly dull affair."], "expanded_content": []},
{"content": ["The story of the ragnarok in the comics was ruined.", "Humor is synonymous with this movie.", "There is no moment of seriousness,", "It is hateful and forgettable."], "expanded_content": []},
{"content": ["This is my favorite MCU movie, no wait, it is my favorite superhero movie, no wait it is my FAVORITE movie !!!!"], "expanded_content": []},
{"content": [" "], "expanded_content": ["Darkest Thor story turned into a comedy because Marvel Studios is a joke factory with fans who honestly believe humor is the epitome of cinema", "A struggle to sit through and I nearly walked out several times.", "Seeing the GOD OF THUNDER taken down by a shock collar was so stupid, and it was a joke the hack of a director kept doing again and again and again.", "You can't even use the \"Well his hammer got broken\" defense for how stupid the shock collar gag was because it's revealed in the third act the power is within him, so he should be immune to it.", "It'd be like Johnny Storm getting taken out by burning his hand on a hot skillet while cooking. It makes no sense and is just stupid.", "Hulk is a joke. Thor is a joke. The movie is a joke.", "Critics giving it anything higher than a zero just shows how biased and untrustworthy they are and how pathetically low the bar is set for Marvel Studios to meet the \"Gold Standard\" mark from critics."]},
{"content": [" "], "expanded_content": ["To start off, this movie has a way different feeling than the previous Thor movies, and it pays off in every way.  This movie is first and foremost a comedy that is accompanied with great action sequences.  The first Thor movies didn’t have this framework and focused more on the conflicts and action, with very little comedy throughout either movie.  The jokes in this movie land well almost every time and keeps you vested throughout the whole movie.  I enjoyed that this Thor movie in that it felt like the scale of the MCU increased a ton with the new planets involved and new characters that give history to Thor’s world.  The comedy being in the forefront gives this movie a great advantage because it feels different from its predecessors and can bring in a new audience because it’s so funny and enjoyable to watch, and rewatch when it comes out on blu-ray. Lastly, the side characters in this movie offered great comedic moments to, which is hard to so with characters like that.", "The new villain, Hela, was also a standout to me because she was one of the more compelling villains that the MCU has had in a while.  While the MCU has great heroes, their villains have never been on the same level as other villains, like the Joker.  I would have to say I enjoyed seeing a different villain in the MCU that not only is acted well, but actually is given a clearer motivation than others.  For example, there is a part in the movie where she reveals some secrets about Asgard and it hits you because you sort of can see things Hela’s way and why she is dong whats she’s doing.  Having clear cut, and understanding, motivations makes Hela an MCU villain that is above average compared to other Marvel villains throughout the years.", "This film is pretty great all around, but there are some nitpicks to talk about.  First off, some of the CGI could’ve been cleaned up a little better, like the bad guy at the beginning of the film Thor fights before Hela.  Also, a lot of this movie was improved, from reports, and it does show in certain scenes that they let the actors just go off and talk.  This is by no means a bad thing, but there were some points I could easily tell what was written in the script and what wasn’t.  This made it feel like two different movies at some points because, to me, it felt obvious what was improvised and actually in the script.  Lastly, I didn’t like how how the last joke was delivered, the last moment of the movie is built up as this dramatic moment and it should’ve been that way.  But, the joke took away from what could’ve been a powerful, dramatic moment for Thor.", "In the end, Marvel has another hit on its hands and gives audiences a fun experience.  Along with delivering a Thor movie that feels like what the previous Thor movies should’ve been like all along.  I enjoyed this movie from beginning to end and was laughing throughout while having a good time."]},
{"content": ["Not often do you see action sci-fi comedies but this movie does it pretty amazingly.  Fun popcorn movie, and left watching it satisfied. Any movie with Jeff Goldblum and Chris Hemsworth should be worth the watch anyway."], "expanded_content": []},
{"content": [" "], "expanded_content": ["How do you take the god of Thunder and make him absolutely intolerable? Make him a stumbling, bumbling, Clutz with 0 body awareness. This wouldnt have been as much of an issue if this was consistent with the rest of the Marvel Universe's Thor lore. Was this move funny? Yep. Was it a thrilling ride? Yep. Did I leave the theater wishing they had handled it EXTEMELY differently? Without. A. Doubt"]},
{"content": [" "], "expanded_content": ["Thor: Ragnarok is THE Thor movie that we have all been waiting for. This movie has so much style that it's surprising it didn't feel like Suicide Squad with all the jumbled tones being thrown left and right. Taika brings his indie directing style to he forfront and makes (ALMOST) each scene a joy to watch. The writing is good as a Thor movie can be. The performances are out of this world, as everyone brings their A-Game (EVEN IF IT'S JUST FOR TEN SECONDS OF SCREEN TIME). Chris Hemsworth proves to all that he is legitamitely funny. Blanchett is always good, though her character is a bit underwhelming at times, but her performance saves it. Goldblum is quirky and weird and fits this movie nicely. Tom Hiddleston brings a bit more depth to Loki, but that's to be expected. Ruffalo shines as the both the Hulk and Banner and brings some of the best laughs in the movie. Everyone is great. Even the action manages to be just as good as ever. Though it may seem I am praising this movie a lot, it SUFFERS badly from ONE massive flaw. Pacing. Just within the first ten minutes alone, you'll feel like you're being whiplashed by J.K. Simmons. It's not that it's start and stop, it's that it's ALWAYS RUNNING. This movie doesn't let up, not even for a moment, which makes it hard to register certain things that happen to characters. Trying to mesh Planet Hulk and Ragarnok works for the most part, but because of this certain things happen to characters that could be huge but is quickly glossed over, and the movie is 2 hours long. So while I love this movie, it suffers from going too fast with the pacing. Luckily, the acting, the story, the characters, and the action save this movie. Plus, because of the pacing, it doesn't even feel like 2 hours. You'll have loads of FUN watching it, which in the end is really all that matters. So go ahead and watch it, then watch it again."]},
{"content": ["Great story, characters are developed and the interactions between them are cleaver and at times heartwarming."], "expanded_content": []},
{"content": ["'Thor Ragnarok'...I thought Marvel lost their minds when they made this movie, but it was I who lost their mind. It succeeds in delivering an over the top, funny, refreshing comic book film. It's just funny and it doesn't stop being funny."], "expanded_content": []},
{"content": [" "], "expanded_content": ["The Norse mythology was integrated in a science-fiction setting in a way I found credible or immersive: I was able to maintain my suspension of disbelief as we say.", "The interactions between the characters is the strong point of the movie, along with some character development. There is a lot of humor and it fits well in the setting (does not break the immersion).", "The drama is also fine and relevant. An overall good story."]},
{"content": ["A great spin-off, in my opinion, Thor is as awkward as ever and the story was more alien based which is a nice change of pace for the MCU."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Wow, 2017 was a great year for the MCU as we got three movies, all of them really good, funny, well written and acted and Thor Ragnarok is no exception. This is yet another one of the funniest movies I saw in 2017, this is more than just a dumb superhero movie is actally a really good comedy movie on its own. Now just because I give it a 9/10 doesn't mean is my pick for winning Oscars, I usually review superhero movies based on how good and entertaining they are and this made me have a really good time laughing at the theater.", "It's well written with really funny lines and jokes that make this movie a big contrast to the previous Thor movies which were pretty forgettable and boring. This is so funny that it seems like it was written as a Thor spoof or something, there are literally jokes that just flat out make fun of the tropes and clichés of the genre.", "The cinematography is solid, the movie looks beautiful, it has really nice looking CGI and bright colors that make this movie stand out compared to other MCU movies. It's almost as good as the art direction of Guardians of the Galaxy movies.", "The new characters are very memorable and charismatic, like Korg and Miek, Korg is just cute and awesome and Taika Waititi's voice acting gives the character an hilarious cute voice compared to its The Thing-like appearence. The returning cast of characters are also really good and actually have new and interesting arcs we haven't seen in their previous appearances, like Thor, I love to see Thor finally having real conflict, struggling to find a way to save Asgard without his best weapon.", "Unlike Spider-Man:Homecoming, this movie has a balance, we have a serious, intimidating villain, it has conflict, drama, tension, stakes, it has what Spider-Man lacked and that makes the movie have an extra point compared to that movie.", "Overall I can't recommend this enough, this is obviously not an Oscar-worthy movie but if you really want to have a good time, watch this."]},
{"content": ["This prequel was a mich better one than the first two movies. There were a lot of parts which were funnier, better in my opinion. In fact, this was the best Thor movie"], "expanded_content": []},
{"content": ["Great movie it vary good  I've never been in a theater and heard so many jokes land so well and get belly laughs from the audience."], "expanded_content": []},
{"content": ["One of the best MCU movies. I didn't like the first two Thor movies this one was amazing."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Thor and Thor:Ragnarok are easily 1 and 2 in the Thor movies. I don't know which is better. Probably Ragnarok. Maybe a bit too much humor , but very enjoyable. Story line could be a bit better but the villain and the co-star are top flight. I really love this movie. They did short-change the Hulk some , but the movie is called Thor after all."]},
{"content": ["MUITO melhor que os filmes anteriores. Conseguiram conciliar momentos engraçados com cenas Badass de uma maneira que eu gostei muito. O primeiro filme do Deus do Trovão que realmente foi digno de sua grandeza."], "expanded_content": []},
{"content": ["Thor ragnrok is best film of the thor trilogy in the MCU Rating - 8/10 super action film"], "expanded_content": []},
{"content": [" "], "expanded_content": ["Drastically changed it's lead character, and giving us more of a Guardians of the Galaxy feel, Thor Ragnarok shows again why Thor is just sadly never given good solo films. The jokes are just so juvenile, the villain leaves no impact, the action is impressive and at times this movie looks absolutely stunning, it's just never enough to pull me through."]},
{"content": [" "], "expanded_content": ["Too bad. I loved the first two Thor movies and was expecting that the third one will hold up to the quality of the first two. But I guess today it's really hard to pull off a trilogy that'll ring throughout the years like how the Wachowskis did with the Matrix."]},
{"content": ["Marvel films are known for sneaking humor in between action sequences, but I don't know what they did with this one. The choreography was lame and I don't understand why Thor felt like he was trying too hard to be funny."], "expanded_content": []},
{"content": ["Despite all the hate surrounding this movie, I actually enjoyed it. If you're as big of a fan of \"Thor\" like me, then you pretty much just like everything that comes out with him on it."], "expanded_content": []},
{"content": ["Thor's character is great with the other Avengers,  but he just doesn't do that well as a stand-alone character with his own storyline. It's sad because he had so much potential too."], "expanded_content": []},
{"content": [" "], "expanded_content": ["Story could've been great but it seemed to me that the writers got lazy with the script and just opted to feed Thor some cheesy humor that made him seem like this kid who was trying too hard to be funny instead of the GOD of Thunder the first two films built him up to be."]},
{"content": [" "], "expanded_content": ["I'm a big fan of Thor but I just couldn't bring myself to like what they did to him in this film. I get that he's going through tough times but turning him from being a thundering, huge god to a man-child who shoots lightning is such an insult to Thor."]},
{"content": ["I know not a lot of people found the humor to be funny but my family and I actually loved it!"], "expanded_content": []},
{"content": ["As a big fan of stand-up comedy, I can say this one really delivered. Most of the jokes had perfect timing and executed in perfect deadpan. Would want another movie like this!"], "expanded_content": []},
{"content": ["I really don't understand why everyone's hating this movie. I remember myself and everyone else in the cinema, laughing our asses off all throughout the movie."], "expanded_content": []},
{"content": ["Childish humor, the same fight scenes and although I gotta say that the plot was creative, it still didn't do it for me."], "expanded_content": []},
{"content": ["This wasn't the Thor movie I expected. Seeing as Marvel did so well with the first two Thor films, I'm surprised this turned out to be a big joke."], "expanded_content": []},
{"content": ["Meh it passed the time. I honestly didn't hate the film but didn't find it to be as entertaining as the other films Marvel has already put out."], "expanded_content": []},
{"content": ["Thor, the goofball of thunder. Mindless comedy and cheesy lines rather than real character development."], "expanded_content": []},
{"content": ["I blame myself for expecting too much from Marvel. They already flopped with the second Thor film and it looks like they're not gonna be redeeming themselves with this one either."], "expanded_content": []},
{"content": ["Nothing to offer other than childish humor and not-even-funny jokes. Even the VFX on this movie sucked."], "expanded_content": []},
{"content": [" "], "expanded_content": ["The reason why people don't enjoy this film is because they just expect too much. You can't just have Thor doing the same thing over and over again. Right now he's taken on a different direction of character development but he is still the God of Thunder."]},
{"content": ["Honestly, I enjoyed it. Not as much as the first Thor film but it still was good popcorn fun."], "expanded_content": []},
{"content": ["Still good, family fun. We ain't no die-hard Marvel fans but we still were able to enjoy it and have good laughs all throughout."], "expanded_content": []},
{"content": ["If my kids love it, then I love it too. I actually like this kind of Thor more as he is much more kid-friendly."], "expanded_content": []},
{"content": ["This does it for me. I expected more from Thor as he is the God of Thunder and you could do so much with him but they weren't able to do that in this film."], "expanded_content": []},
{"content": ["The two earlier Thor films had a more \"godlike\" tone to them. Why not keep that and use it with the third one? This is a huge downgrade for Thor"], "expanded_content": []},
{"content": ["Thor is a funny guy, yes, but he is not in any way childish. I'm disappointed because I really did enjoy his brand of humor in the other Avengers films."], "expanded_content": []},
{"content": ["If you expected too much, then prepare to be disappointed. No epic battles with the valkyries, no Fenrir eating everything that remains, and no Loki bringing death to Asgard."], "expanded_content": []},
{"content": ["Despite the many negative reviews surrounding the humor in this film, I was surprised to see that I actually liked it! It's still not that good of a film but once you get into the story, it could be enjoyable."], "expanded_content": []},
{"content": ["They sure did take things too far with this one. One joke after another and at one point I was confused whether I was watching a superhero film or a parody"], "expanded_content": []},
{"content": ["I've seen some bad movies before so I know what I'm saying when I say that this is definitely one of them."], "expanded_content": []},
{"content": ["I hate how they had to make everything seem funny. Thor is a funny guy but that doesn't mean his film has to be made entirely into a comedy."], "expanded_content": []},
{"content": ["I personally think it's a step towards the wrong direction. I hope they don't let Thor end up a goofball."], "expanded_content": []},
{"content": ["This was the first time I didn't see an entire movie. Seriously, I had to skip to the end because I couldn't bare to see this poor comedy"], "expanded_content": []},
{"content": ["If you enjoy 8 year old humor and cheesy one-liners, then go ahead and watch this movie. Otherwise, go pick another film."], "expanded_content": []},
{"content": ["Alright it looks like Thor finally is done with all that stiff, royalty thing and is now free to do his own thing. Sounds good to me!"], "expanded_content": []},
{"content": [" "], "expanded_content": ["Thor: Ragnarok provides us with crappy conclusions to characters from earlier installments and ruins what made the titular character stand out in the mcu in order to make an unoriginal ripoff of Guardians of the Galaxy that doesn't even capture what made that film so great. Guardians of the Galaxy not only helped elevate the character relationships with humor, but the jokes were not the entire film. Guardians of the Galaxy impressively was not just the funniest mcu film, but also the most emotional. The one dimensional Thor: Ragnarok on the other hand dismisses everything for jokes and when you do that we lose total interest in the story. Even though this is suppose to be the most serious thing that Thor faces, it is treated like a joke. If your not serious then I'm not serious which takes away all interest. I could actually care about what happened in the first two Thor films and they still had jokes that never became jarring like this third installment. I even cared about what happened in The Lego Movie more than I cared about what happened in this film. I have never seen a movie stop me from caring about the plot because of the humor which is what makes Thor: Ragnarok so successful at being bad. The next part of my criticism is a spoiler, but I did not check the box because it does nothing for the rest of the film other than make me drenched in sadness. So basically, because action films despise romance, Thor breaks up with Jane Foster for no reason off screen and to me that is pretty much saying that none of the character development or threats that the characters faced in the first two films really mattered. I already rage quitted on Thor: Ragnarok from that horrendous exposition. It would have been even better if they said nothing or they could have just said she was busy or something much more acceptable. So the question is, why not give this film a zero. Well, Thor: Ragnarok is the only superhero film I have ever seen with a main female villain. That is literally it."]}
]